zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
/***************************************************************************//**
* \file cy_capsense_sensing_lp.c
* \version 10.0.0
*
* \brief
* This file contains the source of functions common for different scanning
* modes.
*
********************************************************************************
* \copyright
* (c) 2020-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/


#include <stddef.h>
#include <string.h>
#include "cy_syslib.h"
#include "cy_sysclk.h"
#include "cy_gpio.h"
#include "cy_device_headers.h"
#include "cycfg_capsense.h"
#include "cycfg_capsense_defines.h"
#include "cycfg_peripherals.h"
#include "cy_capsense_common.h"
#include "cy_capsense_sensing.h"
#include "cy_capsense_sensing_lp.h"
#include "cy_capsense_generator_lp.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_processing.h"
#include "cy_capsense_lib.h"
#include "cy_capsense_selftest.h"
#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    #include "cy_msclp.h"
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

#if (defined(CY_IP_M0S8MSCV3LP))

/*******************************************************************************
* Local definition
*******************************************************************************/
#define CY_CAPSENSE_CSD_CCOMP_CALC_DIV                  (4u * CY_CAPSENSE_PERCENTAGE_100)
#define CY_CAPSENSE_CSX_CCOMP_CALC_DIV                  (8u * CY_CAPSENSE_PERCENTAGE_100)

#define CY_CAPSENSE_EXT_FRAME_START_MODE_SCAN           (1u)
#define CY_CAPSENSE_EXT_FRAME_START_MODE_LP_SCAN        (2u)

#define CY_CAPSENSE_CTL_OPERATING_MODE_CPU              (0u)
#define CY_CAPSENSE_CTL_OPERATING_MODE_AS_MS            (2u)
#define CY_CAPSENSE_CTL_OPERATING_MODE_LP_AOS           (3u)

#define CY_CAPSENSE_SCAN_ST_BSLN_RESET_MSK              (0x01u)
#define CY_CAPSENSE_SCAN_ST_BSLN_VALID_MSK              (0x02u)

/* Offset in words to the first counted SNS registers */
#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_RC_HW_IIR_FILTER_EN)
    #define CY_CAPSENSE_CTL_CFG_OFFSET_VAL              (0u)
#else
    #define CY_CAPSENSE_CTL_CFG_OFFSET_VAL              (8u)
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_RC_HW_IIR_FILTER_EN) */

#define CY_CAPSENSE_CTL_SNS_CTL_OFFSET_VAL              (CY_MSCLP_6_SNS_REGS - 1u)
#define CY_CAPSENSE_CTL_LP_SNS_CTL_OFFSET_VAL           (CY_MSCLP_11_SNS_REGS - 1u)
#define CY_CAPSENSE_LP_AOS_SNS_CFG_REGS_NUM             (5u)

/* CIC2 Filter Divider */
#define CY_CAPSENSE_CIC2_DIVIDER_MAX                    (256u)
/* CIC2 Filter Shift */
#define CY_CAPSENSE_CIC2_SHIFT_MAX                      (15u)

/* CIC2 Accumulator parameters */
#define CY_CAPSENSE_CIC2_ACC_BIT_NUM                    (24u)
#define CY_CAPSENSE_CIC2_ACC_MAX_VAL                    ((1uL << CY_CAPSENSE_CIC2_ACC_BIT_NUM) - 1u)

#define CY_CAPSENSE_AUTOTUNE_SIGPFC_PERCENTAGE          (75u)

/* CAPSENSE ILO compensation constants */
#define CY_CAPSENSE_ILO_FACTOR_SHIFT                    (24u)
#define CY_CAPSENSE_ILO_COMPENSATE_DELAY                (500u)

/* The minimum allowed value of CDAC compensation divider */
#define CY_CAPSENSE_CDAC_COMP_DIV_MIN_MSCLP             (3u)

#define CY_CAPSENSE_ROW_SNS_CALIBRATION                 (0u)
#define CY_CAPSENSE_COL_SNS_CALIBRATION                 (1u)

/* 
* Raw count value equals to appropriate sensor capacitance with dithering configuration. 
* Calculated according to the equation:
* rawCount = (snsCap * CY_CAPSENSE_CONVERSION_HECTO) / CY_CAPSENSE_REF_CDAC_LSB_X100;
*/
#define CY_CAPSENSE_DITHERING_SNS_CAP_300_FEMTO_RAW     (33u)
#define CY_CAPSENSE_DITHERING_SNS_CAP_500_FEMTO_RAW     (56u)
#define CY_CAPSENSE_DITHERING_SNS_CAP_1000_FEMTO_RAW    (112u)
#define CY_CAPSENSE_DITHERING_SNS_CAP_3000_FEMTO_RAW    (338u)
#define CY_CAPSENSE_DITHERING_SNS_CAP_5000_FEMTO_RAW    (564u)
#define CY_CAPSENSE_DITHERING_SNS_CAP_10000_FEMTO_RAW   (1128u)

/* CDAC dithering modes */
#define CY_CAPSENSE_CDAC_DITHERING_MODE_DISABLE         (0x0u)
#define CY_CAPSENSE_CDAC_DITHERING_MODE_MANUAL          (0x1u)
#define CY_CAPSENSE_CDAC_DITHERING_MODE_AUTO            (0x2u)

#define CY_CAPSENSE_CDAC_DITHERING_CDAC_REF             (100u)
#define CY_CAPSENSE_CDAC_DITHERING_NUM_SUBCONV          (100u)
#define CY_CAPSENSE_CDAC_DITHERING_COMP_DIV             (256u)
#define CY_CAPSENSE_CDAC_DITHERING_KREF                 (256u)
#define CY_CAPSENSE_CDAC_DITHERING_CLOCK_REF_RATE       (0x1u)

/* LLS Foam Detection duty cycle configuration */
#define CY_CAPSENSE_SM_REG_SENSE_DUTY_CTL_FLD_PHASE_WIDTH_SEL_FOAM      (0x1uL)
#define CY_CAPSENSE_SM_REG_SENSE_DUTY_CTL_FLD_PHASE_SHIFT_CYCLES_FOAM   (0x1uL) 

