zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
/*
* Watchdog time in us for CDAC auto-dithering scan is calculated according to the equation:
* WdtTime = (fineInit + Nsub + KrefDelay) * Kref * 3 / modClockFreqMhz.
* The calculated value is the duration of one sample with the three-time margin.
*/
#define CY_CAPSENSE_CDAC_DITHERING_WATCHDOG_TIME        (((CY_CAPSENSE_NUM_FINE_INIT_CYCLES + \
                                                           CY_CAPSENSE_CDAC_DITHERING_NUM_SUBCONV + \
                                                           CY_CAPSENSE_NUM_EPI_KREF_DELAY) * \
                                                           CY_CAPSENSE_CDAC_DITHERING_KREF * 3u) / \
                                                           CY_CAPSENSE_MOD_CLOCK_MHZ)

#define CY_CAPSENSE_AOS_CTL_FR_TIMEOUT_INTERVAL_MAX_VALUE (MSCLP_AOS_CTL_FR_TIMEOUT_INTERVAL_Msk >> MSCLP_AOS_CTL_FR_TIMEOUT_INTERVAL_Pos)

/*******************************************************************************
* Constants
*******************************************************************************/
#if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_USE_CAPTURE)
    const cy_stc_msclp_base_config_t cy_capsense_msclpCfg = CY_CAPSENSE_MSC_CONFIG_DEFAULT;
#endif /* (CY_CAPSENSE_DISABLE == CY_CAPSENSE_USE_CAPTURE) */

/******************************************************************************/
/** \cond SECTION_CAPSENSE_INTERNAL */
/** \addtogroup group_capsense_internal *//** \{ */
/******************************************************************************/
#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
cy_capsense_status_t Cy_CapSense_MixedSensorsCheck(
                uint32_t startSlotId,
                uint32_t numberSlots,
                uint32_t * ptrHwCfg,
                cy_stc_capsense_context_t * context);
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED) */

cy_capsense_status_t Cy_CapSense_SlotPinStateInternal(
                uint32_t * ptrSnsFrm,
                const cy_stc_capsense_electrode_config_t * ptrEltdCfg,
                uint32_t pinState,
                cy_stc_capsense_context_t * context);

uint32_t Cy_CapSense_GetLfsrBitsAuto(
                const cy_stc_capsense_widget_config_t * ptrWdConfig,
                const cy_stc_capsense_context_t * context);

uint32_t Cy_CapSense_GetClkSrcSSCAuto(
                const cy_stc_capsense_widget_config_t * ptrWdConfig,
                const cy_stc_capsense_context_t * context);

uint32_t Cy_CapSense_GetClkSrcPRSAuto(
                const cy_stc_capsense_widget_context_t * ptrWdContext,
                const cy_stc_capsense_context_t * context);

uint32_t Cy_CapSense_GetLfsrBitsNumber(
                uint32_t snsClkDivider,
                uint32_t snsClkDividerMin,
                uint32_t ditherLimitPercents,
                uint32_t lfsrScale);

uint32_t Cy_CapSense_RunSSCAuto(
                uint32_t autoSelMode,
                uint32_t lfsrDitherCycles,
                uint32_t ditherLimitCycles,
                uint32_t lfsrPolySize,
                uint32_t subConvNumber);

uint32_t Cy_CapSense_GetPolySize(uint32_t lfsrPoly);

#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CALIBRATION_EN))
cy_capsense_status_t Cy_CapSense_ScanSlotInternalCPU(
                uint32_t startSlotId,
                uint32_t numberSlots,
                cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_ScanWidgetInternalCPU(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context);
uint32_t Cy_CapSense_MinRawSearch(
                uint32_t widgetId,
                uint32_t rowFlag,
                cy_stc_capsense_context_t * context);
#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
uint32_t Cy_CapSense_MaxRawSearch(
                uint32_t widgetId,
                uint32_t rowFlag,
                cy_stc_capsense_context_t * context);
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED) */
uint32_t Cy_CapSense_CalculateAbsDiff(
                uint32_t a,
                uint32_t b);
void Cy_CapSense_SetWidgetFrameRefCdacCodes(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context);
void Cy_CapSense_SetWidgetFrameCompCdacCode(
                uint32_t widgetId,
                uint32_t mode,
                cy_stc_capsense_context_t * context);
void Cy_CapSense_SetCompDivider(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_CdacSuccessAppr(
                uint32_t widgetId,
                uint32_t rowFlag,
                uint8_t calibrMask,
                uint8_t * cdacPtr,
                cy_stc_capsense_context_t * context);
uint32_t Cy_CapSense_CalculateRawTarget(
                uint32_t widgetId,
                uint32_t rowFlag,
                cy_stc_capsense_context_t * context);
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) || \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CALIBRATION_EN) || \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CALIBRATION_EN)) */

void Cy_CapSense_TransferRawCounts(
                uint32_t startSlotId,
                uint32_t numberSlots,
                cy_stc_capsense_context_t * context);

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
void Cy_CapSense_TransferLpRawCounts(
                uint32_t startSlotId,
                uint32_t numberSlots,
                cy_stc_capsense_context_t * context);
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN) */

cy_capsense_status_t Cy_CapSense_WaitMrssStatusChange(
                uint32_t timeout,
                uint32_t mrssStatus,
                cy_stc_capsense_context_t * context);

uint32_t Cy_CapSense_MsclpTimerCalcCycles(
                uint32_t wakeupTimer,
                cy_stc_capsense_context_t * context);

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_AUTO_DITHER_EN)
static cy_capsense_status_t Cy_CapSense_CdacDitherScaleCalc(
                cy_stc_capsense_context_t * context);
static cy_capsense_status_t Cy_CapSense_ConfigureAutoDitherMode(
                cy_stc_capsense_context_t * context);
static cy_capsense_status_t Cy_CapSense_CdacDitherGetMaxRaw(
                uint32_t * ptrSnsFrame,
                const cy_stc_capsense_widget_config_t * ptrWdCfg,
                uint32_t snsFrameSize,
                uint32_t * ptrRawCountMax,
                cy_stc_capsense_context_t * context);
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_AUTO_DITHER_EN) */
#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN)
static cy_capsense_status_t Cy_CapSense_ShortIntegration(
                uint32_t startSlotId,
                uint32_t numberSlots,
                cy_stc_capsense_context_t * context);
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN) */

/** \} \endcond */


