zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
/*******************************************************************************
* Function Name: Cy_CapSense_ScanSlotsInternal
****************************************************************************//**
*
* Transfers sensor frame to Sensor Data RAM and initiates the non-blocking scan
* of specified slots. If the specified slots configuration does not fit into the
* HW SNS RAM then only the CY_CAPSENSE_FIFO_SNS_MAX_NUM number of sensors will
* be scanned. The remaining sensors will be scanned in the next sub-frame(s).
*
* This is an internal function. Do not call this function directly from
* the application program.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param startSlotId
* The slot ID scan will be started from.
*
* \param numberSlots
* The number of slots will be scanned.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_ScanSlotsInternal(
                uint32_t startSlotId,
                uint32_t numberSlots,
                cy_stc_capsense_context_t * context)
{
    uint32_t index;
    uint32_t * ptrSensorFrame;
    __IOM uint32_t * ptrSensorData;
    MSCLP_Type * ptrHwBase = context->ptrCommonConfig->ptrChConfig->ptrHwBase;
    uint32_t numberSlotsLocal = (CY_CAPSENSE_FIFO_SNS_MAX_NUM > numberSlots) ? numberSlots : CY_CAPSENSE_FIFO_SNS_MAX_NUM;
    context->ptrInternalContext->numSlots = (uint16_t)numberSlotsLocal;

    if (0u != numberSlotsLocal)
    {
        /* Initialize frame data pointer */
        ptrSensorFrame = &context->ptrSensorFrameContext[startSlotId * CY_CAPSENSE_SENSOR_FRAME_SIZE];

        /* Initialize sensor data pointer */
        ptrSensorData = &ptrHwBase->SNS.SENSOR_DATA[0u];

        /* Disable HW IP to allow MRSS operations */
        ptrHwBase->CTL &= (~MSCLP_CTL_ENABLED_Msk);

        /* Disable PUMP to save power during the Sensor Data copy */
        #if (CY_MSCLP_VDDA_PUMP_TRESHOLD > CY_CAPSENSE_VDDA_MV)
            ptrHwBase->PUMP_CTL = 0u;
        #endif

        /* Check if IMO is running */
        if (0u == (ptrHwBase->MRSS_STATUS & MSCLP_MRSS_STATUS_IMO_UP_Msk))
        {
            /* Enable MRSS to provide access to the SNS_STC registers */
            ptrHwBase->MRSS_CMD = MSCLP_MRSS_CMD_MRSS_START_Msk;
            (void)Cy_CapSense_WaitMrssStatusChange(CY_MSCLP_CLK_LF_PERIOD_MAX * CY_MSCLP_MRSS_TIMEOUT_FULL,
                                                    CY_CAPSENSE_MRSS_IMO_TURN_ON, context);
        }
        else
        {
            ptrHwBase->MRSS_CMD = MSCLP_MRSS_CMD_MRSS_PUMP_STOP_Msk;
        }

        /* Copy sensor frame to Sensor Data RAM */
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_RC_HW_IIR_FILTER_EN)
            for (index = 0u; index < numberSlotsLocal; index++)
            {
                /* Set raw count filter coefficient */
                ptrSensorData[CY_CAPSENSE_FRM_LP_SNS_LP_AOS_SNS_CTL0] = (ptrSensorFrame[CY_CAPSENSE_SNS_HW_IIR_INDEX] &
                                                    CY_CAPSENSE_RC_HW_IIR_FILTER_COEFF_MASK) >> CY_CAPSENSE_RC_HW_IIR_FILTER_COEFF_POS;
                ptrSensorData[CY_CAPSENSE_FRM_LP_SNS_LP_AOS_SNS_CTL1] = 0u;
                ptrSensorData[CY_CAPSENSE_FRM_LP_SNS_LP_AOS_SNS_CTL2] = 0u;
                /* Set filtered raw count scaled */
                ptrSensorData[CY_CAPSENSE_FRM_LP_SNS_LP_AOS_SNS_CTL3] = ptrSensorFrame[CY_CAPSENSE_SNS_HW_IIR_INDEX] & CY_CAPSENSE_FRC_HW_IIR_FILTER_MASK;
                ptrSensorData[CY_CAPSENSE_FRM_LP_SNS_LP_AOS_SNS_CTL4] = 0u;
                /* Copy sensor frame to SEL and CTL registers */
                ptrSensorData[CY_CAPSENSE_FRM_LP_SNS_SW_SEL_CSW_LO_MASK2_INDEX] = ptrSensorFrame[CY_CAPSENSE_SNS_SW_SEL_CSW_LO_MASK2_INDEX];
                ptrSensorData[CY_CAPSENSE_FRM_LP_SNS_SW_SEL_CSW_LO_MASK1_INDEX] = ptrSensorFrame[CY_CAPSENSE_SNS_SW_SEL_CSW_LO_MASK1_INDEX];
                ptrSensorData[CY_CAPSENSE_FRM_LP_SNS_SW_SEL_CSW_LO_MASK0_INDEX] = ptrSensorFrame[CY_CAPSENSE_SNS_SW_SEL_CSW_LO_MASK0_INDEX];
                ptrSensorData[CY_CAPSENSE_FRM_LP_SNS_SCAN_CTL_INDEX] = ptrSensorFrame[CY_CAPSENSE_SNS_SCAN_CTL_INDEX];
                ptrSensorData[CY_CAPSENSE_FRM_LP_SNS_CDAC_CTL_INDEX] = ptrSensorFrame[CY_CAPSENSE_SNS_CDAC_CTL_INDEX];
                ptrSensorData[CY_CAPSENSE_FRM_LP_SNS_CTL_INDEX] = ptrSensorFrame[CY_CAPSENSE_SNS_CTL_INDEX];
                ptrSensorFrame += CY_CAPSENSE_SENSOR_FRAME_SIZE;
                ptrSensorData += CY_CAPSENSE_LP_SENSOR_FRAME_SIZE;
            }
        #else
            for (index = 0u; index < (numberSlotsLocal * CY_CAPSENSE_SENSOR_FRAME_SIZE); index++)
            {
                *ptrSensorData = *ptrSensorFrame;
                ptrSensorData++;
                ptrSensorFrame++;
            }
        #endif

        ptrSensorData--;
        /* Configure the last slot */
        *ptrSensorData |= MSCLP_SNS_SNS_CTL_LAST_Msk;

        /* Configure Sensor Data RAM start and slot size */
        CY_REG32_CLR_SET(ptrHwBase->SCAN_CTL2, MSCLP_SCAN_CTL2_FRAME_CFG_START_ADDR, 0u);
        CY_REG32_CLR_SET(ptrHwBase->CTL, MSCLP_CTL_CFG_OFFSET, CY_CAPSENSE_CTL_CFG_OFFSET_VAL);

        /* Configure FIFO */
        CY_REG32_CLR_SET(ptrHwBase->SCAN_CTL1, MSCLP_SCAN_CTL1_FRAME_RES_START_ADDR,
                                               MSCLP_SNS_SRAM_WORD_SIZE - numberSlotsLocal);

        if ((NULL != context->ptrInternalContext->ptrSSCallback) &&
            (CY_CAPSENSE_ENABLE == context->ptrInternalContext->firstActSubFrame))
        {
            context->ptrInternalContext->ptrSSCallback(context->ptrActiveScanSns);
        }

        /* Stop MRSS_IMO only for the first sub-frame in LP_AOS mode after the callback as it can operate with SNS registers */
        if ((CY_CAPSENSE_ENABLE == context->ptrInternalContext->firstActSubFrame) &&
            (0u != (ptrHwBase->MRSS_STATUS & MSCLP_MRSS_STATUS_IMO_UP_Msk)))
        {
            /* Stop the MRSS_IMO to save power */
            ptrHwBase->MRSS_CMD = MSCLP_MRSS_CMD_MRSS_STOP_Msk;
        }

        /* Check for the system VDDA value and enable PUMP if VDDA is less than the threshold */
        #if (CY_MSCLP_VDDA_PUMP_TRESHOLD > CY_CAPSENSE_VDDA_MV)
            ptrHwBase->PUMP_CTL = MSCLP_PUMP_CTL_PUMP_MODE_Msk;
        #endif

        /* Check if an external start is enabled */
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_FRM_START_EN)
            if (0u == (context->ptrCommonContext->status & CY_CAPSENSE_MW_STATE_INITIALIZATION_MASK))
            {
                /* Set the external start scan mode to start LP_AOS sequencer */
                CY_REG32_CLR_SET(ptrHwBase->CTL, MSCLP_CTL_EXT_FRAME_START_MODE,
                                    CY_CAPSENSE_EXT_FRAME_START_MODE_LP_SCAN);

                /* Enable HW IP to allow a scan frame start */
                ptrHwBase->CTL |= MSCLP_CTL_ENABLED_Msk;
            }
            else
            {
                /* Enable HW IP to allow a scan frame start */
                ptrHwBase->CTL |= MSCLP_CTL_ENABLED_Msk;

                /* Start LP_AOS scan */
                ptrHwBase->WAKEUP_CMD = MSCLP_WAKEUP_CMD_START_FRAME_AOS_Msk;
            }
        #else
            /* Enable HW IP to allow a scan frame start */
            ptrHwBase->CTL |= MSCLP_CTL_ENABLED_Msk;

            /* Start scan */
            ptrHwBase->WAKEUP_CMD = MSCLP_WAKEUP_CMD_START_FRAME_AOS_Msk;
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_FRM_START_EN) */
    }
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
/*******************************************************************************
* Function Name: Cy_CapSense_MixedSensorsCheck
****************************************************************************//**
*
* Initiates the check of specified slots. Widgets with enabled MPSC feature
* can't be scanned with the others in one scan.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param startSlotId
* The slot ID scan will be started from.
*
* \param numberSlots
* The number of slots will be scanned.
*
* \param ptrHwCfg
* Pointer to a hardware config variable.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_MIXED_SENSORS    - Sensors with MPSC and w/o can't be scanned in one frame.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_MixedSensorsCheck(uint32_t startSlotId,
                                                   uint32_t numberSlots,
                                                   uint32_t * ptrHwCfg,
                                                   cy_stc_capsense_context_t * context)
{
    uint32_t curSlotIndex, wdIndex, snsIndex;
    const cy_stc_capsense_scan_slot_t * ptrScanSlots;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    uint32_t regularWdCnt = 0u;
    uint32_t mpscWdCnt = 0u;
    uint32_t lastSlot = startSlotId + numberSlots - 1u;
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;

    ptrScanSlots = context->ptrScanSlots;
    curSlotIndex = startSlotId;

    do
    {
        wdIndex  = ptrScanSlots[curSlotIndex].wdId;
        snsIndex = ptrScanSlots[curSlotIndex].snsId;
        ptrWdCfg = &context->ptrWdConfig[wdIndex];

        if ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) &&
           (CY_CAPSENSE_MPSC_MIN_ORDER <= ptrWdCfg->mpOrder))
        {
            mpscWdCnt++;
        }
        else
        {
            regularWdCnt++;
        }

