zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
        if ((0u != regularWdCnt) && (0u != mpscWdCnt))
        {
            capStatus = CY_CAPSENSE_STATUS_MIXED_SENSORS;
            break;
        }

        /* Jump to the next widget */
        curSlotIndex += (ptrWdCfg->numSlots - snsIndex);
    } while (curSlotIndex <= lastSlot);

    if ((CY_CAPSENSE_STATUS_SUCCESS == capStatus) && (0u < mpscWdCnt))
    {
        *ptrHwCfg = CY_CAPSENSE_HW_CONFIG_MPSC_SCANNING;
    }

    return capStatus;
}
#endif /* CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED */


/*******************************************************************************
* Function Name: Cy_CapSense_ScanSlots_V3Lp
****************************************************************************//**
*
* Initiates the non-blocking scan of specified slots. 
*
* If the middleware is busy, do not initiate a new scan or set up widgets.
* Use the Cy_CapSense_IsBusy() function to check HW busyness at a particular moment.
* Use the Cy_CapSense_MwState() function to verify if MW executes any firmware 
* tasks related to initialization, scanning, and processing at a particular moment.
* The transition into system DEEP SLEEP mode is allowed after the scan is started.
*
* This function initiates a scan only for the first number of slots that could
* be fit into the Sensor Data RAM and then exits. Scans for the remaining slots
* started in the interrupt service routine (part of middleware), which triggered
* at the end of the scan completion.
*
* If the /ref activeWakeupTimer parameter set by the Cy_CapSense_ConfigureMsclpTimer()
* function is more than 0u, the correspondent time interval will be inserted before
* the frame scan start to provide a desired refresh rate.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param startSlotId
* The slot ID scan will be started from.
*
* \param numberSlots
* The number of slots will be scanned.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - Any of input parameters is invalid.
* - CY_CAPSENSE_STATUS_CONFIG_OVERFLOW  - The numberSlots parameter exceeds
*                                         the maximum number of sensor configurations
*                                         which is possible to be loaded into the
*                                         internal buffer of the CAPSENSE&trade; HW block.
* - CY_CAPSENSE_STATUS_HW_BUSY          - The HW is busy with the previous scan.
* - CY_CAPSENSE_STATUS_HW_LOCKED        - The MSCLP HW block is captured by another
*                                         middleware.
* - CY_CAPSENSE_STATUS_TIMEOUT          - A timeout reached during the MRSS start.
* - CY_CAPSENSE_STATUS_MIXED_SENSORS    - The requested sensors types can't be scanned
*                                         in one frame (in autonomous mode).
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanSlots_V3Lp(
                uint32_t startSlotId,
                uint32_t numberSlots,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    

    uint32_t lastSlot;
    MSCLP_Type * ptrHwBase;
    cy_stc_capsense_internal_context_t * ptrIntrCxt;
    uint32_t hwCfg = CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
        uint32_t slotId = startSlotId;
        const cy_stc_capsense_widget_config_t * ptrWdCfg;
    #endif

    if ((NULL == context) || (0u == numberSlots) || (CY_CAPSENSE_SLOT_COUNT <= startSlotId))
    {
        capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
    }

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_FRM_START_EN)
        if (CY_CAPSENSE_FIFO_SNS_MAX_NUM < numberSlots)
        {
            capStatus = CY_CAPSENSE_STATUS_CONFIG_OVERFLOW;
        }
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
        if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
        {
            capStatus = Cy_CapSense_MixedSensorsCheck(startSlotId, numberSlots, &hwCfg, context);
        }
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
        if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
        {
            for (; slotId < (startSlotId + numberSlots); slotId++)
            {
                ptrWdCfg = &context->ptrWdConfig[context->ptrScanSlots[slotId].wdId];
                if ((uint8_t)CY_CAPSENSE_WD_WHEATSTONE_BRIDGE_E == ptrWdCfg->wdType)
                {
                    hwCfg = CY_CAPSENSE_HW_CONFIG_WBX_SCANNING;
                    if (1u < numberSlots)
                    {
                        capStatus = CY_CAPSENSE_STATUS_MIXED_SENSORS;
                        break;
                    }
                }
            }
        }
    #endif

    if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
    {
        lastSlot = startSlotId + numberSlots - 1u;
        if (CY_CAPSENSE_SLOT_COUNT > lastSlot)
        {
            if (CY_CAPSENSE_BUSY == Cy_CapSense_IsBusy(context))
            {
                /* Previous scan is not completed. Return the BUSY status */
                capStatus = CY_CAPSENSE_STATUS_HW_BUSY;
            }
            else
            {
                Cy_CapSense_SetBusyFlags(context);

                /* Set the Active widget scan status */
                ptrIntrCxt = context->ptrInternalContext;
                ptrHwBase = context->ptrCommonConfig->ptrChConfig->ptrHwBase;

                ptrIntrCxt->repeatScanEn = CY_CAPSENSE_DISABLE;

                if (((CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING == ptrIntrCxt->hwConfigState) ||
                     (CY_CAPSENSE_HW_CONFIG_MPSC_SCANNING == ptrIntrCxt->hwConfigState) ||
                     (CY_CAPSENSE_HW_CONFIG_WBX_SCANNING == ptrIntrCxt->hwConfigState)) &&
                    (ptrIntrCxt->startSlotIndex == startSlotId) && (ptrIntrCxt->numSlots == numberSlots) &&
                    (CY_CAPSENSE_FIFO_SNS_MAX_NUM >= numberSlots) &&
                    (0u == (context->ptrCommonContext->status & CY_CAPSENSE_MW_STATE_CALIBRATION_MASK)) &&
                    (0u != (context->ptrCommonContext->status & CY_CAPSENSE_MW_STATE_ACTIVE_WD_SCAN_MASK)))
                {
                    ptrIntrCxt->repeatScanEn = CY_CAPSENSE_ENABLE;

