zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
                    /* Reset the start slot in the internal context structure */
                    ptrIntrCxt->currentSlotIndex = (uint16_t)startSlotId;

                    if (NULL != context->ptrInternalContext->ptrSSCallback)
                    {
                        context->ptrInternalContext->ptrSSCallback(context->ptrActiveScanSns);
                    }

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN)
                        if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
                        {
                            capStatus = Cy_CapSense_ShortIntegration(startSlotId, numberSlots, context);
                        }
                    #endif

                    /* Check if the external start is enabled */
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_FRM_START_EN)
                        if (0u == (context->ptrCommonContext->status & CY_CAPSENSE_MW_STATE_INITIALIZATION_MASK))
                        {
                            /* Set the External Start scan mode to start the LP_AOS sequencer */
                            CY_REG32_CLR_SET(ptrHwBase->CTL, MSCLP_CTL_EXT_FRAME_START_MODE,
                                             CY_CAPSENSE_EXT_FRAME_START_MODE_LP_SCAN);
                            /* Enable HW IP to allow the scan frame start */
                            ptrHwBase->CTL |= MSCLP_CTL_ENABLED_Msk;
                        }
                        else
                        {
                            /* Enable HW IP to allow the scan frame start */
                            ptrHwBase->CTL |= MSCLP_CTL_ENABLED_Msk;
                            /* Disable the External Start scan mode during initialization and start scans immediately */
                            ptrHwBase->WAKEUP_CMD = MSCLP_WAKEUP_CMD_START_FRAME_AOS_Msk;
                        }
                    #else
                        /* Disable HW block per IFX 005467-513 */
                        ptrHwBase->CTL &= ~MSCLP_CTL_ENABLED_Msk;

                        /* Enable HW IP to allow the scan frame start */
                        ptrHwBase->CTL |= MSCLP_CTL_ENABLED_Msk;

                        /* Start scanning */
                        ptrHwBase->WAKEUP_CMD = MSCLP_WAKEUP_CMD_START_FRAME_AOS_Msk;
                    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_FRM_START_EN) */
                }
                else
                {
                    capStatus = Cy_CapSense_SwitchHwConfiguration(hwCfg, context);

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN)
                        if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
                        {
                            capStatus = Cy_CapSense_ShortIntegration(startSlotId, numberSlots, context);
                        }
                    #endif

                    if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
                    {
                        context->ptrCommonContext->status &= (uint32_t)~((uint32_t)CY_CAPSENSE_MW_STATE_WD_SCAN_MASK);
                        context->ptrCommonContext->status |= CY_CAPSENSE_MW_STATE_ACTIVE_WD_SCAN_MASK;

                        /* Check for the needed MSCv3LP operating mode */
                        ptrIntrCxt->operatingMode = CY_CAPSENSE_CTL_OPERATING_MODE_LP_AOS;
                        CY_REG32_CLR_SET(ptrHwBase->CTL, MSCLP_CTL_OPERATING_MODE,
                                                            CY_CAPSENSE_CTL_OPERATING_MODE_LP_AOS);
                        CY_REG32_CLR_SET(ptrHwBase->CTL, MSCLP_CTL_CFG_OFFSET, 0uL);

                        ptrHwBase->AOS_CTL &= ~MSCLP_AOS_CTL_FR_TIMEOUT_INTERVAL_Msk;
                        ptrHwBase->AOS_CTL |= (uint32_t)(1uL << MSCLP_AOS_CTL_FR_TIMEOUT_INTERVAL_Pos);

                        /* Set the active timer value */
                        context->ptrCommonConfig->ptrChConfig->ptrHwBase->AOS_CTL &= ~MSCLP_AOS_CTL_WAKEUP_TIMER_Msk;
                        context->ptrCommonConfig->ptrChConfig->ptrHwBase->AOS_CTL |=
                            (context->ptrInternalContext->activeWakeupTimerCycles << MSCLP_AOS_CTL_WAKEUP_TIMER_Pos);

                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
                            ptrWdCfg = &context->ptrWdConfig[context->ptrScanSlots[startSlotId].wdId];
                            if ((uint8_t)CY_CAPSENSE_WD_WHEATSTONE_BRIDGE_E == ptrWdCfg->wdType)
                            {
                                /* Configures Compensation CDAC direction */
                                if (0u != (ptrWdCfg->ptrWdContext->status & CY_CAPSENSE_WD_WBX_COMPENSATION_DIRECTION_MASK))
                                {
                                    context->ptrCommonConfig->ptrChConfig->ptrHwBase->SW_SEL_CDAC_CO = 
                                        CY_CAPSENSE_WBX_SW_SEL_CDAC_CO_INVERTED;
                                }
                                else
                                {
                                    context->ptrCommonConfig->ptrChConfig->ptrHwBase->SW_SEL_CDAC_CO = 
                                        CY_CAPSENSE_WBX_SW_SEL_CDAC_CO_DIRECT;
                                }
                                /* Disables CIC2 HW filter for WBX widget */
                                #if (CY_CAPSENSE_CIC2_FILTER_EN)
                                    context->ptrCommonConfig->ptrChConfig->ptrHwBase->FILTER_CTL &= 
                                        (uint32_t)~MSCLP_FILTER_CTL_FILTER_MODE_Msk;
                                #endif
                            }
                        #endif

                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_RC_HW_IIR_FILTER_EN)
                            /* Enable HW processing */
                            ptrHwBase->CE_CTL = MSCLP_CE_CTL_ENABLED_Msk | ptrIntrCxt->hwIirInit;
                        #else
                            /* Disable HW processing */
                            ptrHwBase->CE_CTL = 0uL;
                        #endif

