zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
                        /* Unmask FRAME interrupt for ACTIVE and ALR modes (AS_MS and LP_AOS HW modes) */
                        ptrHwBase->INTR_LP_MASK = MSCLP_INTR_LP_FRAME_Msk;
                        (void)ptrHwBase->INTR_LP_MASK;

                        /* Initialize internal context */
                        ptrIntrCxt->startSlotIndex = (uint16_t)startSlotId;
                        ptrIntrCxt->currentSlotIndex = (uint16_t)startSlotId;
                        ptrIntrCxt->endSlotIndex = (uint16_t)lastSlot;
                        ptrIntrCxt->firstActSubFrame = CY_CAPSENSE_ENABLE;

                        if (CY_CAPSENSE_FIFO_SNS_MAX_NUM >= numberSlots)
                        {
                            /* Set the repeat scan flag */
                            ptrIntrCxt->repeatScanEn = CY_CAPSENSE_ENABLE;
                        }

                        /* Initialize the scan */
                        Cy_CapSense_ScanSlotsInternal(startSlotId, numberSlots, context);
                    }
                }
            }
        }
        else
        {
            capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
        }
    }

    return capStatus;
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_ScanLpSlots
****************************************************************************//**
*
* Initiates a non-blocking scan for specified low power slots and exits.
* Scanning is initiated only if no scan is in progress.
* Scans initiated by this function can be performed in different system power
* modes such as Active, Sleep or Deep Sleep.
* After all specified number of frames are scanned or if a touch is
* detected during the scan, the interrupt is fired, the CPU switches
* Power mode to Active and the interrupt service routine (part of middleware)
* transfers the last frame raw counts and clears the busy status.
* If the middleware is busy, do not initiate a new scan or set up widgets.
* Use the Cy_CapSense_IsBusy() function to check HW busyness at a particular moment.
* Use the Cy_CapSense_MwState() function to verify if MW executes any firmware 
* tasks related to initialization, scanning, and processing at a particular moment.
* The function clears the CY_CAPSENSE_MW_STATE_LP_ACTIVE_MASK status bit. It is
* set when a touch detection occurs during the low power slot scans and will remain
* set until the next Cy_CapSense_ScanLpSlots() function call.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param startLpSlotId
* The slot ID to start a scan from.
*
* \param numberLpSlots
* The number of slots to be scanned.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation completed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_HW_BUSY          - The hardware is busy with the previous scan.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanLpSlots(
                uint32_t startLpSlotId,
                uint32_t numberLpSlots,
                cy_stc_capsense_context_t * context)
{
    uint32_t index;
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
    cy_stc_capsense_internal_context_t * ptrIntrCxt;
    uint32_t * ptrSensorFrameLp;
    MSCLP_Type * ptrHwBase;
    uint32_t lastLpSlot = startLpSlotId + numberLpSlots - 1u;

    if ((NULL != context) && (0u != numberLpSlots) &&
        (CY_CAPSENSE_FIFO_SNS_LP_MAX_NUM >= numberLpSlots) && (CY_CAPSENSE_SLOT_LP_COUNT > lastLpSlot))
    {
        /* Clear the signal detect status for low power scans */
        context->ptrCommonContext->status &= (~((uint32_t)CY_CAPSENSE_MW_STATE_LP_ACTIVE_MASK));
        if (CY_CAPSENSE_BUSY == Cy_CapSense_IsBusy(context))
        {
            /* Previous scan is not completed. Return the BUSY status */
            capStatus = CY_CAPSENSE_STATUS_HW_BUSY;
        }
        else
        {
            capStatus = Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING, context);
            if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
            {
                Cy_CapSense_SetBusyFlags(context);

                ptrIntrCxt = context->ptrInternalContext;
                ptrHwBase = context->ptrCommonConfig->ptrChConfig->ptrHwBase;

                capStatus = CY_CAPSENSE_STATUS_SUCCESS;

                /* Set the repeat scan flag */
                ptrIntrCxt->repeatScanEn = CY_CAPSENSE_ENABLE;

                if (((startLpSlotId != ptrIntrCxt->currentSlotIndex) || (lastLpSlot != ptrIntrCxt->endSlotIndex)) ||
                    (0u == (context->ptrCommonContext->status & CY_CAPSENSE_MW_STATE_LP_WD_SCAN_MASK)))
                {
                    /* Initialize internal context */
                    ptrIntrCxt->currentSlotIndex = (uint16_t)startLpSlotId;
                    ptrIntrCxt->endSlotIndex = (uint16_t)lastLpSlot;
                    ptrIntrCxt->numSlots = (uint16_t)numberLpSlots;

                    /* Set the LP_AOS operating mode */
                    ptrIntrCxt->operatingMode = CY_CAPSENSE_CTL_OPERATING_MODE_LP_AOS;
                    CY_REG32_CLR_SET(ptrHwBase->CTL, MSCLP_CTL_OPERATING_MODE,
                                                     CY_CAPSENSE_CTL_OPERATING_MODE_LP_AOS);
                    CY_REG32_CLR_SET(ptrHwBase->CTL, MSCLP_CTL_CFG_OFFSET, 0u);

                    /* Enable HW processing */
                    ptrHwBase->CE_CTL = MSCLP_CE_CTL_ENABLED_Msk | MSCLP_CE_CTL_BLSD_EN_Msk;

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_RC_IIR_FILTER_EN)
                        ptrHwBase->CE_CTL |= MSCLP_CE_CTL_RCF_EN_Msk;
                    #endif

                    /* Disable HW IP to allow MRSS operations */
                    ptrHwBase->CTL &= (~MSCLP_CTL_ENABLED_Msk);

                    /* Check if IMO is running */
                    if (0u == (ptrHwBase->MRSS_STATUS & MSCLP_MRSS_STATUS_IMO_UP_Msk))
                    {
                        /* Enable only REF and IMO to provide access to the SNS_STC registers */
                        #if (CY_MSCLP_VDDA_PUMP_TRESHOLD > CY_CAPSENSE_VDDA_MV)
                            ptrHwBase->PUMP_CTL = 0u;
                        #endif

                        ptrHwBase->MRSS_CMD = MSCLP_MRSS_CMD_MRSS_START_Msk;
                        capStatus = Cy_CapSense_WaitMrssStatusChange(
                                        CY_MSCLP_CLK_LF_PERIOD_MAX * CY_MSCLP_MRSS_TIMEOUT_SMALL,
                                        CY_CAPSENSE_MRSS_IMO_TURN_ON, context);
                    }
                    else
                    {
                        /* Stop the MRSS pump to save power */
                        ptrHwBase->MRSS_CMD = MSCLP_MRSS_CMD_MRSS_PUMP_STOP_Msk;
                    }


                    if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
                    {
                        /* Initialize frame data pointer */
                        ptrSensorFrameLp = &context->ptrSensorFrameLpContext[startLpSlotId * CY_MSCLP_11_SNS_REGS];

                        /* Copy sensor frame to Sensor Data RAM */
                        for (index = 0u; index < (numberLpSlots * CY_MSCLP_11_SNS_REGS); index++)
                        {
                            ptrHwBase->SNS.SENSOR_DATA[index] = ptrSensorFrameLp[index];
                        }

                        /* Configure the last slot */
                        ptrHwBase->SNS.SENSOR_DATA[((numberLpSlots - 1u) * CY_MSCLP_11_SNS_REGS) +
                                                   CY_CAPSENSE_CTL_LP_SNS_CTL_OFFSET_VAL] |= MSCLP_SNS_SNS_CTL_LAST_Msk;

