zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
                        /* Initialize channel engine to perform processing */
                        ptrHwBase->SNS.CE_INIT_CTL |= MSCLP_SNS_CE_INIT_CTL_SENSOR_INIT_Msk;

                        /* Check AHB2AHB bus response */
                        if ((ptrHwBase->SNS.BRIDGE_STATUS & MSCLP_SNS_BRIDGE_STATUS_READY_Msk) == 0u)
                        {
                            capStatus = CY_CAPSENSE_STATUS_TIMEOUT;
                        }

                        if (0u != (ptrHwBase->MRSS_STATUS & MSCLP_MRSS_STATUS_IMO_UP_Msk))
                        {
                            /* Stop the MRSS to save power */
                            ptrHwBase->MRSS_CMD = MSCLP_MRSS_CMD_MRSS_STOP_Msk;
                        }
                    }

                    if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
                    {
                        /* Configure Sensor Data RAM start and slot size */
                        CY_REG32_CLR_SET(ptrHwBase->SCAN_CTL2, MSCLP_SCAN_CTL2_FRAME_CFG_START_ADDR, 0u);
                        CY_REG32_CLR_SET(ptrHwBase->CTL, MSCLP_CTL_CFG_OFFSET, 0u);

                        /* Set AOS_CTL register with enabled MRSS power cycle */
                        ptrHwBase->AOS_CTL &= (uint32_t)~MSCLP_AOS_CTL_FR_TIMEOUT_INTERVAL_Msk;

                        /* Limit wotTimeout value to maximum if it exceeds range */
                        if (CY_CAPSENSE_AOS_CTL_FR_TIMEOUT_INTERVAL_MAX_VALUE < (uint32_t)context->ptrInternalContext->wotTimeout)
                        {
                            context->ptrInternalContext->wotTimeout = (uint16_t)CY_CAPSENSE_AOS_CTL_FR_TIMEOUT_INTERVAL_MAX_VALUE;
                        }
                        ptrHwBase->AOS_CTL |= (uint32_t)((uint32_t)context->ptrInternalContext->wotTimeout << MSCLP_AOS_CTL_FR_TIMEOUT_INTERVAL_Pos);
                        ptrHwBase->AOS_CTL |= MSCLP_AOS_CTL_MRSS_PWR_CYCLE_EN_Msk;

                        /* Set the WOT timer value */
                        context->ptrCommonConfig->ptrChConfig->ptrHwBase->AOS_CTL &= ~MSCLP_AOS_CTL_WAKEUP_TIMER_Msk;
                        context->ptrCommonConfig->ptrChConfig->ptrHwBase->AOS_CTL |=
                            (context->ptrInternalContext->wotScanIntervalCycles << MSCLP_AOS_CTL_WAKEUP_TIMER_Pos);

                        /* Check for system VDDA value and enable PUMP if VDDA is less then threshold */
                        #if (CY_MSCLP_VDDA_PUMP_TRESHOLD > CY_CAPSENSE_VDDA_MV)
                            ptrHwBase->PUMP_CTL = MSCLP_PUMP_CTL_PUMP_MODE_Msk;
                        #endif

                        /* Configure the start address of FIFO considering fractional part discarding after integer division */
                        CY_REG32_CLR_SET(ptrHwBase->SCAN_CTL1, MSCLP_SCAN_CTL1_FRAME_RES_START_ADDR,
                                         ((uint32_t)MSCLP_SNS_SRAM_WORD_SIZE -
                                          ((((uint32_t)MSCLP_SNS_SRAM_WORD_SIZE / numberLpSlots) - CY_MSCLP_11_SNS_REGS) * numberLpSlots)));
                    }
                }
                else
                {
                    if (0u != (ptrHwBase->MRSS_STATUS & MSCLP_MRSS_STATUS_MRSS_UP_Msk))
                    {
                        /* Disable HW IP to allow MRSS operations */
                        ptrHwBase->CTL &= (~MSCLP_CTL_ENABLED_Msk);

                        /* Stop the MRSS to save power */
                        ptrHwBase->MRSS_CMD = MSCLP_MRSS_CMD_MRSS_STOP_Msk;
                        (void)Cy_CapSense_WaitMrssStatusChange((CY_MSCLP_CLK_LF_PERIOD_MAX * CY_CAPSENSE_MULTIPLIER_TWO), CY_CAPSENSE_MRSS_TURN_OFF, context);
                    }
                }

                /* Set Low Power widget scan status */
                context->ptrCommonContext->status &= (uint32_t)~((uint32_t)CY_CAPSENSE_MW_STATE_WD_SCAN_MASK);
                context->ptrCommonContext->status |= CY_CAPSENSE_MW_STATE_LP_WD_SCAN_MASK;

                if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
                {
                    /* Start of scan callback */
                    if (NULL != ptrIntrCxt->ptrSSCallback)
                    {
                        ptrIntrCxt->ptrSSCallback(context->ptrActiveScanSns);
                    }

                    /* Disable HW block per IFX 005467-513 */
                    ptrHwBase->CTL &= ~MSCLP_CTL_ENABLED_Msk;

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_FRM_START_EN)
                        /* Clear the external start scan mode */
                        ptrHwBase->CTL &= ~MSCLP_CTL_EXT_FRAME_START_MODE_Msk;
                    #endif

                    /* Enable HW IP to allow scans */
                    ptrHwBase->CTL |= MSCLP_CTL_ENABLED_Msk;

                    /* Un-mask FR_TIMEOUT interrupt in LP-AOS mode */
                    ptrHwBase->INTR_LP_MASK = MSCLP_INTR_LP_MASK_FR_TIMEOUT_Msk;
                    (void)ptrHwBase->INTR_LP_MASK;
                    /* Start scan */
                    ptrHwBase->WAKEUP_CMD |= MSCLP_WAKEUP_CMD_START_FRAME_AOS_Msk;
                }
            }
        }
    }

    return capStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_ScanAllLpWidgets
****************************************************************************//**
*
* Initiates a non-blocking scan for all low power widgets/sensors.
* If the middleware is busy, do not initiate a new scan or set up widgets.
* Use the Cy_CapSense_IsBusy() function to check HW busyness at a particular moment.
* Use the Cy_CapSense_MwState() function to verify if MW executes any firmware 
* tasks related to initialization, scanning, and processing at a particular moment.
*
* The function is the wrapper for the Cy_CapSense_ScanAllLpSlots() function.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_HW_BUSY          - The hardware is busy with the previous scan.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanAllLpWidgets(
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;

    if (NULL != context)
    {
        capStatus = Cy_CapSense_ScanLpSlots(0u, CY_CAPSENSE_SLOT_LP_COUNT, context);
    }

