zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
                    case CY_CAPSENSE_ISX_GROUP:
                        context->ptrInternalContext->intrIsxRawTarget = (uint8_t)calibrTarget;
                        break;
                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN) */

                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
                    case CY_CAPSENSE_WBX_GROUP:
                        context->ptrInternalContext->intrWbxRawTarget = (uint8_t)calibrTarget;
                        break;
                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN) */

                default:
                    /* No action */
                    break;
            }
            calibStatus = CY_CAPSENSE_STATUS_SUCCESS;
        }
    }

    return calibStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateAllWidgets_V3Lp
****************************************************************************//**
*
* Executes CapDAC auto-calibration for all all relevant Active widgets if
* enabled.
*
* Having enabled the CDAC auto-calibration algorithm is the most common use
* case. It helps to tune your system considering board-to-board variation,
* temperature drift, etc. CDAC auto-calibration is enabled by default.
*
* The function performs searching of Reference CDAC code, Compensation CDAC
* code and Compensation Divider (whichever is enabled) by using a successive
* approximation method to make the sensor's raw count closest to the
* defined targets. The auto-calibration target values are defined
* (by default) as:
* * 85% of the maximum raw count for CSD widgets
* * 40% of the maximum raw count for CSX widgets.
* * 40% of the maximum raw count for ISX widgets.
*
* To change calibration targets use the Cy_CapSense_SetCalibrationTarget() function.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The calibration is failed due to
*                                         the issues with scanning (either
*                                         watchdog timer, interrupt breaking, etc.).
* - CY_CAPSENSE_STATUS_CALIBRATION_REF_CHECK_FAIL - The reference/fine CapDAC
*                                  calibration stage is failed as the raw count
*                                  minimum across widget is out of range.
* - CY_CAPSENSE_STATUS_CALIBRATION_CHECK_FAIL - The resulting rawcounts across
*                                  all sensors in widget are out of defined range.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateAllWidgets_V3Lp(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t widgetId;

    if (NULL != context)
    {
        for (widgetId = 0u; widgetId < context->ptrCommonConfig->numWd; widgetId++)
        {
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
                if (context->ptrWdConfig[widgetId].wdType != (uint8_t)CY_CAPSENSE_WD_LOW_POWER_E)
            #endif
            {
                calibStatus |= Cy_CapSense_CalibrateWidget_V3Lp(widgetId, context);
            }
        }
    }

    /* Disable repeated scans after calibrations */
    context->ptrInternalContext->repeatScanEn = CY_CAPSENSE_DISABLE;
    context->ptrCommonContext->status &= (uint32_t)~((uint32_t)CY_CAPSENSE_MW_STATE_WD_SCAN_MASK);

    return calibStatus;
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateAllLpSlots
****************************************************************************//**
*
* Calibrates CapDACs for all Low power widgets.
*
* The function is the wrapper for the Cy_CapSense_CalibrateAllLpWidgets() function
* to provide the backward compatibility.
*
* \note
* This function is available only for the fifth-generation
* low power CAPSENSE&trade;.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM     - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The calibration failed if software
*                                         watchdog timeout occurred
*                                         during any calibration scan,
*                                         the scan was not completed, or
*                                         resulted raw counts
*                                         are outside the limits.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateAllLpSlots(cy_stc_capsense_context_t * context)
{
    return Cy_CapSense_CalibrateAllLpWidgets(context);
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateAllLpWidgets
****************************************************************************//**
*
* Executes CapDAC auto-calibration for all relevant low power widgets if enabled.
*
* Having enabled the CDAC auto-calibration algorithm is the most common use
* case. It helps to tune your system considering board-to-board variation,
* temperature drift, etc. CDAC auto-calibration is enabled by default.
*
* The function performs searching of Reference CDAC code, Compensation CDAC
* code, Compensation Divider (whichever is enabled) by using a successive
* approximation method to make the sensor's raw count closest to the
* defined targets. The auto-calibration target values are defined
* (by default) as:
* * 85% of the maximum raw count for CSD widgets
* * 40% of the maximum raw count for CSX widgets.
* * 40% of the maximum raw count for ISX widgets.
*
* To change calibration targets use the Cy_CapSense_SetCalibrationTarget() function.
*
* \note
* This function is available only for the fifth-generation
* low power CAPSENSE&trade;.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The calibration is failed due to
*                                         the issues with scanning (either
*                                         watchdog timer, interrupt breaking, etc.).
* - CY_CAPSENSE_STATUS_CALIBRATION_REF_CHECK_FAIL - The reference/fine CapDAC
*                                  calibration stage is failed as the raw count
*                                  minimum across widget is out of range.
* - CY_CAPSENSE_STATUS_CALIBRATION_CHECK_FAIL - The resulting rawcounts across
*                                  all sensors in widget are out of defined range.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateAllLpWidgets(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t widgetId;

    if (NULL != context)
    {
        for (widgetId = 0u; widgetId < context->ptrCommonConfig->numWd; widgetId++)
        {
            if (context->ptrWdConfig[widgetId].wdType == (uint8_t)CY_CAPSENSE_WD_LOW_POWER_E)
            {
                calibStatus |= Cy_CapSense_CalibrateWidget_V3Lp(widgetId, context);
            }
        }
    }

    /* Disable repeated scans after calibrations */
    context->ptrInternalContext->repeatScanEn = CY_CAPSENSE_DISABLE;
    context->ptrCommonContext->status &= (uint32_t)~((uint32_t)CY_CAPSENSE_MW_STATE_WD_SCAN_MASK);

    return calibStatus;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN) */


#endif /*
        *  ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
        *   (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) || \
        *   (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CALIBRATION_EN))
        */

