zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
/*******************************************************************************
* Function Name: Cy_CapSense_ConfigureMsclpTimer
****************************************************************************//**
*
* Configures the wakeup timer value for Active mode. The wakeup timer interval
* is introduced before each scan frame start. Use the function to implement
* different Active scan refresh rates (for instance an Active mode with
* the 128 Hz refresh rate and an Active Low Refresh Rate mode with the 32 Hz
* refresh rate).
*
* The minimum wakeup time value is corresponding to one ILO cycle (25us for
* 40KHz ILO). The maximum wakeup time value depends on actual ILO frequency and
* can be set to a value, corresponding to 2^16 ILO cycles (1638400us for
* 40KHz ILO). If the timer value exceeds 2^16 ILO cycles, it would be set to
* the maximum possible value.
* The real wakeup time interval depends on ILO frequency which have a big
* tolerance (above +/- 50 %), see device datasheets. In order to improve the
* timer accuracy, use Cy_CapSense_IloCompensate() function.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param wakeupTimer
* The desired wakeup timer value in microseconds.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM     - The input parameter is invalid.
*
* \funcusage
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_ConfigureMsclpTimer
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ConfigureMsclpTimer(
                uint32_t wakeupTimer,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t result = CY_CAPSENSE_STATUS_BAD_PARAM;

    if (NULL != context)
    {
        result = CY_CAPSENSE_STATUS_SUCCESS;
        context->ptrInternalContext->activeWakeupTimer = wakeupTimer;

        /* Calculate and store compensated wakeup timer value */
        context->ptrInternalContext->activeWakeupTimerCycles =
            Cy_CapSense_MsclpTimerCalcCycles(wakeupTimer, context);

        if (0u != (context->ptrCommonContext->status & CY_CAPSENSE_MW_STATE_ACTIVE_WD_SCAN_MASK))
        {
            /* Update value for the wakeup timer */
            context->ptrCommonConfig->ptrChConfig->ptrHwBase->AOS_CTL &= ~MSCLP_AOS_CTL_WAKEUP_TIMER_Msk;
            context->ptrCommonConfig->ptrChConfig->ptrHwBase->AOS_CTL |=
                (uint32_t)(context->ptrInternalContext->activeWakeupTimerCycles << MSCLP_AOS_CTL_WAKEUP_TIMER_Pos);
        }
    }
    return result;
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_ConfigureMsclpWotTimer
****************************************************************************//**
*
* Configures the wakeup timer value for Wake-On-Touch mode. The wakeup time is
* introduced before each scan frame.
*
* The minimum wakeup time value is corresponding to one ILO cycle (25us for
* 40KHz ILO). The maximum wakeup time value depends on actual ILO frequency and
* can be set to a value, corresponding to 2^16 ILO cycles (1638400us for
* 40KHz ILO). If the timer value exceeds 2^16 ILO cycles, it would be set to
* the maximum possible value.
* The real wakeup time interval depends on ILO frequency which have a big
* tolerance (above +/- 50 %), see device datasheets. In order to improve the
* timer accuracy, use Cy_CapSense_IloCompensate() function.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param wakeupTimer
* The desired wakeup timer value in microseconds.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM     - The input parameter is invalid.
*
* \funcusage
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_ScanAllLpSlots
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ConfigureMsclpWotTimer(
                uint32_t wakeupTimer,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t result = CY_CAPSENSE_STATUS_BAD_PARAM;

    if (NULL != context)
    {
        result = CY_CAPSENSE_STATUS_SUCCESS;
        context->ptrInternalContext->wotScanInterval = wakeupTimer;

        /* Calculate and store compensated wakeup timer value */
        context->ptrInternalContext->wotScanIntervalCycles =
            Cy_CapSense_MsclpTimerCalcCycles(wakeupTimer, context);

        if (0u != (context->ptrCommonContext->status & CY_CAPSENSE_MW_STATE_LP_WD_SCAN_MASK))
        {
            /* Update value for the wakeup timer */
            context->ptrCommonConfig->ptrChConfig->ptrHwBase->AOS_CTL &= ~MSCLP_AOS_CTL_WAKEUP_TIMER_Msk;
            context->ptrCommonConfig->ptrChConfig->ptrHwBase->AOS_CTL |=
                (uint32_t)(context->ptrInternalContext->wotScanIntervalCycles << MSCLP_AOS_CTL_WAKEUP_TIMER_Pos);
        }
    }
    return result;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN) */


/*******************************************************************************
* Function Name: Cy_CapSense_IloCompensate
****************************************************************************//**
*
* Measures the actual ILO frequency and calculates the compensation factor for MSCLP
* Active and Wake-On-Touch mode timers. In order to keep timer intervals
* accurate, call this function periodically.
* To set Active and Wake-On-Touch mode timers, use
* Cy_CapSense_ConfigureMsclpTimer() and Cy_CapSense_ConfigureMsclpWotTimer()
* functions correspondingly.
*
* \note SysClk should be clocked by IMO, otherwise the
* Cy_CapSense_IloCompensate() function can work incorrectly.
*
* \note If the System clock frequency is changed in runtime, the
* mtb-pdl-cat2 SystemCoreClockUpdate() function should be called before
* calling Cy_CapSense_IloCompensate().
*
* \note This function is blocking, function execution time is ~1ms, regardless
* of IMO frequency.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM     - The input parameter is invalid.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_IloCompensate(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t result = CY_CAPSENSE_STATUS_BAD_PARAM;
    uint32_t dummyVar = CY_CAPSENSE_ILO_COMPENSATE_DELAY;
    uint16_t trimCnt2Val;

    if (NULL != context)
    {
        /* Perform ILO measurement and get only the result of SRSSLT_TST_TRIM_CNTR2.
        *  The measurement counts number of ILO clocks per set number of IMO clocks,
        *  which corresponds to IMO frequency(Hz) / 1024, so measurement time is
        *  always equal to 1 / 1024 seconds and actual ILO frequency is equal to
        *  SRSSLT_TST_TRIM_CNTR2 value * 1024 or SRSSLT_TST_TRIM_CNTR2 value * 2^10.
        */
        Cy_SysClk_IloStartMeasurement();
        while (CY_SYSCLK_SUCCESS != Cy_SysClk_IloCompensate(dummyVar, &dummyVar))
        {
            /* Wait for the end of ILO measurement */
        }
        trimCnt2Val = (uint16_t)SRSSLT_TST_TRIM_CNTR2;
        Cy_SysClk_IloStopMeasurement();

        /* Calculate ILO compensation factor using number of ILO clocks, measured
        *  by SRSSLT_TST_TRIM_CNTR2. Factor calculated as
        *  actual ILO frequency (Hz) * 2^14 / 1000000 or
        *  SRSSLT_TST_TRIM_CNTR2 * 2^24 / 1000000.
        *  Multiplier 2^14 is used for calculation optimization, so integer
        *  division by 1000000 can be performed during factor calculation.
        */
        context->ptrInternalContext->iloCompensationFactor =
                ((uint32_t)trimCnt2Val << CY_CAPSENSE_ILO_FACTOR_SHIFT) /
                CY_CAPSENSE_1M_DIVIDER;

        /* Calculate and store active and wake-on-touch timer values */
        context->ptrInternalContext->activeWakeupTimerCycles =
            Cy_CapSense_MsclpTimerCalcCycles(context->ptrInternalContext->activeWakeupTimer, context);
        context->ptrInternalContext->wotScanIntervalCycles =
            Cy_CapSense_MsclpTimerCalcCycles(context->ptrInternalContext->wotScanInterval, context);

        /* Select correct timer value */
        dummyVar = context->ptrInternalContext->activeWakeupTimerCycles;
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
            if (0u != (context->ptrCommonContext->status & CY_CAPSENSE_MW_STATE_LP_WD_SCAN_MASK))
            {
                dummyVar = context->ptrInternalContext->wotScanIntervalCycles;
            }
        #endif

        /* Update AOS_CTL register with selected value */
        context->ptrCommonConfig->ptrChConfig->ptrHwBase->AOS_CTL &= ~MSCLP_AOS_CTL_WAKEUP_TIMER_Msk;
        context->ptrCommonConfig->ptrChConfig->ptrHwBase->AOS_CTL |= (uint32_t)(dummyVar << MSCLP_AOS_CTL_WAKEUP_TIMER_Pos);

        result = CY_CAPSENSE_STATUS_SUCCESS;
    }

    return result;
}


