zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
/*******************************************************************************
* Function Name: Cy_CapSense_MsclpTimerCalcCycles
****************************************************************************//**
*
* Calculates the value of MSCLP wakeup timer in number of ILO clocks based on
* compensation factor, measured by Cy_CapSense_IloCompensate() function.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param wakeupTimer
* The desired wakeup timer value in microseconds.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* The wakeupTimer value in ILO cycles.
*
*******************************************************************************/
uint32_t Cy_CapSense_MsclpTimerCalcCycles(uint32_t wakeupTimer, cy_stc_capsense_context_t * context)
{
    /* Calculate actual number of ILO clocks, based on iloCompensationFactor.
    *  Number of ILO cycles equal to wakeupTimer * actual ILO Frequency (Hz) / 1000000 or
    *  wakeupTimer * iloCompensationFactor / 2^14.
    */
    uint32_t numIloClocks = ((wakeupTimer * context->ptrInternalContext->iloCompensationFactor) >>
                            CY_CAPSENSE_ILO_COMPENSATE_SHIFT);

    /* Check wakeup timer value ranges */
    if (0u < numIloClocks)
    {
        numIloClocks--;
    }
    if (((uint32_t)MSCLP_AOS_CTL_WAKEUP_TIMER_Msk >> MSCLP_AOS_CTL_WAKEUP_TIMER_Pos) < numIloClocks)
    {
        numIloClocks = (uint32_t)MSCLP_AOS_CTL_WAKEUP_TIMER_Msk >> MSCLP_AOS_CTL_WAKEUP_TIMER_Pos;
    }

    return numIloClocks;
}


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CALIBRATION_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateWidget_V3Lp
****************************************************************************//**
*
* Executes the CapDAC calibration for all the sensors in the specified widget
* to the default target value.
*
* This function performs exactly the same tasks as
* Cy_CapSense_CalibrateAllWidgets(), but only for a specified widget.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
* This function is available in single-channel solution.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS   - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The calibration is failed due to
*                                  the issues with scanning (either
*                                  watchdog timer, interrupt breaking, etc.).
* - CY_CAPSENSE_STATUS_CALIBRATION_REF_CHECK_FAIL - The reference/fine CapDAC
*                                  calibration stage is failed as the raw count
*                                  minimum across widget is out of range.
* - CY_CAPSENSE_STATUS_CALIBRATION_CHECK_FAIL - The resulting rawcounts across
*                                  all sensors in widget are out of defined range.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateWidget_V3Lp(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibrationStatus = CY_CAPSENSE_STATUS_SUCCESS;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    cy_stc_capsense_widget_context_t * ptrWdCxt;
    uint32_t cdacConfig;
    uint32_t snsIndex;
    uint32_t skipCalibration = 0u;

    if ((NULL != context) && (CY_CAPSENSE_TOTAL_WIDGET_COUNT > widgetId) &&
        (0u != Cy_CapSense_IsWidgetEnabled(widgetId, context)))
    {
        ptrWdCfg = &context->ptrWdConfig[widgetId];

        if (((uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E == ptrWdCfg->wdType) ||
            ((uint8_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_E == ptrWdCfg->wdType))
        {
            if (0u != (ptrWdCfg->ptrWdContext->status & CY_CAPSENSE_WD_FACTORY_CALIBRATION_MASK))
            {
                skipCalibration = 1u;
            }
            else
            {
                skipCalibration = 1u;
                if (0u == (ptrWdCfg->centroidConfig & CY_CAPSENSE_LLW_READY_MASK))
                {
                    skipCalibration = 0u;
                }
                if (CY_CAPSENSE_LLW_READY_MASK == (ptrWdCfg->centroidConfig & CY_CAPSENSE_LLW_READY_MASK))
                {
                    skipCalibration = 0u;
                }
            }
        }

        if ((uint16_t)CY_CAPSENSE_TU_CMD_CALIBRATE_WIDGET_BLOCKING_E == context->ptrCommonContext->tunerCmd)
        {
            skipCalibration = 0u;
        }

        if (0u == skipCalibration)
        {
            ptrWdCxt = ptrWdCfg->ptrWdContext;
            cdacConfig = ptrWdCfg->cdacConfig;

            context->ptrCommonContext->status |= CY_CAPSENSE_MW_STATE_CALIBRATION_MASK;

            /* Reference CapDac configuration */
            if (CY_CAPSENSE_CDAC_REF_MODE_MANUAL_MASK != (cdacConfig & CY_CAPSENSE_CDAC_REF_MODE_MASK))
            {
                ptrWdCxt->cdacRef = 0u;
                ptrWdCxt->rowCdacRef = 0u;
            }

            /* Fine CapDac configuration */
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_FINE_AUTO_EN)
                if (CY_CAPSENSE_CDAC_FINE_MODE_MANUAL_MASK != (cdacConfig & CY_CAPSENSE_CDAC_FINE_MODE_MASK))
                {
                    ptrWdCxt->cdacFine = 0u;
                    ptrWdCxt->rowCdacFine = 0u;
                }
            #endif

            /* Compensation CapDac configuration */
            if (CY_CAPSENSE_CDAC_COMP_MODE_MANUAL_MASK != (cdacConfig & CY_CAPSENSE_CDAC_COMP_MODE_MASK))
            {
                for (snsIndex = 0u; snsIndex < (uint32_t)ptrWdCfg->numSns; snsIndex++)
                {
                    ptrWdCfg->ptrSnsContext[snsIndex].cdacComp = 0u;
                }
            }

            Cy_CapSense_SetWidgetFrameCompCdacCode(widgetId, CY_CAPSENSE_CAL_MODE_COMP_CDAC_CODE_VAL, context);
            Cy_CapSense_SetWidgetFrameRefCdacCodes(widgetId, context);

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_REF_AUTO_EN)
                if (0u != (cdacConfig & CY_CAPSENSE_CDAC_REF_MODE_AUTO_MASK))
                {
                    calibrationStatus |= Cy_CapSense_CalibrateRefCdac(widgetId, context);
                    Cy_CapSense_SetWidgetFrameRefCdacCodes(widgetId, context);
                }
            #endif

