zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_FINE_AUTO_EN)
                if (0u != (cdacConfig & CY_CAPSENSE_CDAC_FINE_MODE_AUTO_MASK))
                {
                    calibrationStatus |= Cy_CapSense_CalibrateFineCdac(widgetId, context);
                    Cy_CapSense_SetWidgetFrameRefCdacCodes(widgetId, context);
                }
            #endif

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_REF_AUTO_EN)
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
                    /* Skip boost for MPSC */
                    if (CY_CAPSENSE_MPSC_MIN_ORDER > context->ptrWdConfig[widgetId].mpOrder)
                #endif
                    {
                        ptrWdCxt->cdacRef /= (uint8_t)((cdacConfig & CY_CAPSENSE_CDAC_BOOST_VAL_MASK) >> CY_CAPSENSE_CDAC_BOOST_VAL_POS);
                        ptrWdCxt->rowCdacRef /= (uint8_t)((cdacConfig & CY_CAPSENSE_CDAC_BOOST_VAL_MASK) >> CY_CAPSENSE_CDAC_BOOST_VAL_POS);
                        Cy_CapSense_SetWidgetFrameRefCdacCodes(widgetId, context);
                    }
            #endif

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_COMP_AUTO_EN)
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_COMP_DIV_AUTO_EN)
                    if (0u != (cdacConfig & CY_CAPSENSE_CDAC_COMP_DIV_MODE_AUTO_MASK))
                    {
                        calibrationStatus |= Cy_CapSense_CalibrateCompDivider(widgetId, context);
                    }
                #endif
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CALIBRATION_EN)
                    if (0u != (cdacConfig & CY_CAPSENSE_CDAC_COMP_MODE_AUTO_MASK))
                    {
                        if ((uint8_t)CY_CAPSENSE_WD_WHEATSTONE_BRIDGE_E == ptrWdCfg->wdType)
                        {
                            calibrationStatus |= Cy_CapSense_CalibrateCompCdacWbx(widgetId, context);
                        }
                        else
                        {
                            calibrationStatus |= Cy_CapSense_CalibrateCompCdac(widgetId, context);
                        }
                    }
                #else
                    if (0u != (cdacConfig & CY_CAPSENSE_CDAC_COMP_MODE_AUTO_MASK))
                    {
                        calibrationStatus |= Cy_CapSense_CalibrateCompCdac(widgetId, context);
                    }
                #endif
                Cy_CapSense_SetWidgetFrameCompCdacCode(widgetId, CY_CAPSENSE_CAL_MODE_COMP_CDAC_CODE_VAL, context);
            #endif

            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) || \
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CALIBRATION_EN))
                if ((0u != (cdacConfig & (CY_CAPSENSE_CDAC_REF_MODE_AUTO_MASK   |
                                        CY_CAPSENSE_CDAC_FINE_MODE_AUTO_MASK  |
                                        CY_CAPSENSE_CDAC_COMP_MODE_AUTO_MASK  |
                                        CY_CAPSENSE_CDAC_COMP_DIV_MODE_AUTO_MASK))) &&
                    (CY_CAPSENSE_WBX_GROUP != ptrWdCfg->senseMethod))
                {
                    /* Check final calibration result */
                    calibrationStatus |= Cy_CapSense_VerifyCalibration(widgetId, context);
                }
            #endif

            /* Update CRC if BIST is enabled */
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
                (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN))
                Cy_CapSense_UpdateCrcWidget(widgetId, context);
            #endif

            if (CY_CAPSENSE_STATUS_SUCCESS != calibrationStatus)
            {
                calibrationStatus |= CY_CAPSENSE_STATUS_CALIBRATION_FAIL;
            }

            context->ptrCommonContext->status &= ~(uint32_t)CY_CAPSENSE_MW_STATE_CALIBRATION_MASK;

            (void)Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_UNDEFINED, context);
        }
    }
    else
    {
        calibrationStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
    }

    return calibrationStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetWidgetFrameRefCdacCodes
****************************************************************************//**
*
* This function updates reference and fine CDACs codes in sensor
* frame to match values in widget structure.
*
* \note
* This function is available only
* for the fifth-generation low power CAPSENSE&trade;.
*
* \param widgetId
* Specifies the ID number of the widget.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetWidgetFrameRefCdacCodes(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    cy_stc_capsense_widget_config_t const * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_stc_capsense_widget_context_t * ptrWdCxt = &context->ptrWdContext[widgetId];
    uint32_t snsIndex;
    uint32_t frameSize;
    uint32_t * ptrSnsFrmCdacCtlReg;

    frameSize = CY_CAPSENSE_SENSOR_FRAME_SIZE;
    ptrSnsFrmCdacCtlReg = &context->ptrSensorFrameContext[CY_CAPSENSE_SNS_CDAC_CTL_INDEX];
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        if ((ptrWdCfg->wdType == (uint8_t)CY_CAPSENSE_WD_LOW_POWER_E))
        {
            ptrSnsFrmCdacCtlReg = &context->ptrSensorFrameLpContext[CY_CAPSENSE_FRM_LP_SNS_CDAC_CTL_INDEX];
            frameSize = CY_MSCLP_11_SNS_REGS;
        }
    #endif

    ptrSnsFrmCdacCtlReg += (frameSize * ptrWdCfg->firstSlotId);

    for (snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
    {
        if (CY_CAPSENSE_CDAC_MODE_AUTO == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_REF_MODE_MASK) >> CY_CAPSENSE_CDAC_REF_MODE_POS))
        {
            *ptrSnsFrmCdacCtlReg &= (uint32_t)~(MSCLP_SNS_SNS_CDAC_CTL_SEL_RE_Msk);
        }
        #if (CY_CAPSENSE_CDAC_FINE_USAGE)
            if (CY_CAPSENSE_CDAC_MODE_AUTO == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_FINE_MODE_MASK) >> CY_CAPSENSE_CDAC_FINE_MODE_POS))
            {
                *ptrSnsFrmCdacCtlReg &= (uint32_t)~(MSCLP_SNS_SNS_CDAC_CTL_SEL_CF_Msk);
            }
        #endif

        #if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
            if ((CY_CAPSENSE_CSD_GROUP == context->ptrWdConfig[widgetId].senseMethod) &&
                (ptrWdCfg->numCols <= snsIndex) &&
                (((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdCfg->wdType) ||
                ((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrWdCfg->wdType)))
            {
                if (CY_CAPSENSE_CDAC_MODE_AUTO == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_REF_MODE_MASK) >> CY_CAPSENSE_CDAC_REF_MODE_POS))
                {
                    *ptrSnsFrmCdacCtlReg |= ((((uint32_t)ptrWdCxt->rowCdacRef)) << MSCLP_SNS_SNS_CDAC_CTL_SEL_RE_Pos);
                }
                #if (CY_CAPSENSE_CDAC_FINE_USAGE)
                    if (CY_CAPSENSE_CDAC_MODE_AUTO == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_FINE_MODE_MASK) >> CY_CAPSENSE_CDAC_FINE_MODE_POS))
                    {
                        *ptrSnsFrmCdacCtlReg |= (((uint32_t)ptrWdCxt->rowCdacFine) << MSCLP_SNS_SNS_CDAC_CTL_SEL_CF_Pos);
                    }
                #endif
            }
            else
        #endif
        {
            if (CY_CAPSENSE_CDAC_MODE_AUTO == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_REF_MODE_MASK) >> CY_CAPSENSE_CDAC_REF_MODE_POS))
            {
                *ptrSnsFrmCdacCtlReg |= (((uint32_t)ptrWdCxt->cdacRef) << MSCLP_SNS_SNS_CDAC_CTL_SEL_RE_Pos);
            }
            #if (CY_CAPSENSE_CDAC_FINE_USAGE)
                if (CY_CAPSENSE_CDAC_MODE_AUTO == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_FINE_MODE_MASK) >> CY_CAPSENSE_CDAC_FINE_MODE_POS))
                {
                    *ptrSnsFrmCdacCtlReg |= (((uint32_t)ptrWdCxt->cdacFine) << MSCLP_SNS_SNS_CDAC_CTL_SEL_CF_Pos);
                }
            #endif
        }

        ptrSnsFrmCdacCtlReg += frameSize;
    }
}


