zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
/*******************************************************************************
* Function Name: Cy_CapSense_SetWidgetFrameCompCdacCode
****************************************************************************//**
*
* Sets the Compensation CDAC code into sensor frames.
*
* This function applies Compensation CDAC code for all
* sensors within specified widget in sensor frame structures.
*
* \param widgetId
* Specifies widget ID.
*
* \param mode
* Specifies the Compensation CDAC code:
* 
* * CY_CAPSENSE_CAL_MODE_COMP_CDAC_CODE_MIN - Sets the minimum CDAC code.
* * CY_CAPSENSE_CAL_MODE_COMP_CDAC_CODE_MAX - Sets the maximum CDAC code.
* * CY_CAPSENSE_CAL_MODE_COMP_CDAC_CODE_VAL - Sets the CDAC code specified in the sensor configuration.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetWidgetFrameCompCdacCode(
                uint32_t widgetId,
                uint32_t mode,
                cy_stc_capsense_context_t * context)
{
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_stc_capsense_sensor_context_t * ptrSnsCxt = ptrWdCfg->ptrSnsContext;

    uint32_t snsCount = ptrWdCfg->numSns;
    uint32_t frameSize;
    uint32_t * ptrSnsFrmCdacCtlReg;

    frameSize = CY_CAPSENSE_SENSOR_FRAME_SIZE;
    ptrSnsFrmCdacCtlReg = &context->ptrSensorFrameContext[CY_CAPSENSE_SNS_CDAC_CTL_INDEX];
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        if ((ptrWdCfg->wdType == (uint8_t)CY_CAPSENSE_WD_LOW_POWER_E))
        {
            frameSize = CY_MSCLP_11_SNS_REGS;
            ptrSnsFrmCdacCtlReg = &context->ptrSensorFrameLpContext[CY_CAPSENSE_FRM_LP_SNS_CDAC_CTL_INDEX];
        }
    #endif

    ptrSnsFrmCdacCtlReg += (frameSize * ptrWdCfg->firstSlotId);
    for (;snsCount-- > 0u;)
    {
        if (CY_CAPSENSE_CDAC_MODE_AUTO == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_COMP_MODE_MASK) >> CY_CAPSENSE_CDAC_COMP_MODE_POS))
        {
            *ptrSnsFrmCdacCtlReg &= (uint32_t)~(MSCLP_SNS_SNS_CDAC_CTL_SEL_CO_Msk);
            switch (mode)
            {
                case CY_CAPSENSE_CAL_MODE_COMP_CDAC_CODE_MAX:
                    *ptrSnsFrmCdacCtlReg |= ((uint32_t)MSCLP_SNS_SNS_CDAC_CTL_SEL_CO_Msk);
                    break;

                case CY_CAPSENSE_CAL_MODE_COMP_CDAC_CODE_VAL:
                    *ptrSnsFrmCdacCtlReg |= (((uint32_t)ptrSnsCxt->cdacComp) << MSCLP_SNS_SNS_CDAC_CTL_SEL_CO_Pos);
                    break;

                default:
                    /* No action for other modes */
                    break;
            }
        }
        ptrSnsFrmCdacCtlReg += frameSize;
        ptrSnsCxt++;
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_MinRawSearch
****************************************************************************//**
*
* This function seeks for a minimal raw count across the widget.
*
* \note
* This function is available only
* for the fifth-generation low power CAPSENSE&trade;.
*
* \param widgetId
* The widget ID scans will be done for.
*
* \param rowFlag
* The flag for a row/column sensors seek.
* CY_CAPSENSE_ROW_SNS_CALIBRATION - seek performed for rows.
* CY_CAPSENSE_COL_SNS_CALIBRATION - seek performed for columns.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* The minimal raw count.
*
*******************************************************************************/
uint32_t Cy_CapSense_MinRawSearch(
                uint32_t widgetId,
                uint32_t rowFlag,
                cy_stc_capsense_context_t * context)
{
    cy_stc_capsense_widget_config_t const * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_stc_capsense_sensor_context_t * ptrSnsCxt = ptrWdCfg->ptrSnsContext;
    uint32_t snsCount;
    uint32_t minRaw = CY_CAPSENSE_32_BIT_MASK;

    snsCount = ptrWdCfg->numSns;
    #if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
        if ((CY_CAPSENSE_CSD_GROUP == context->ptrWdConfig[widgetId].senseMethod) &&
            (((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == context->ptrWdConfig[widgetId].wdType) ||
             ((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == context->ptrWdConfig[widgetId].wdType)))
        {
            snsCount = ptrWdCfg->numCols;
            if (CY_CAPSENSE_ROW_SNS_CALIBRATION != rowFlag)
            {
                ptrSnsCxt += snsCount;
                snsCount = ptrWdCfg->numRows;
            }
        }
    #else
        (void)rowFlag;
    #endif

    for (;snsCount-- > 0u;)
    {
        if (ptrSnsCxt->raw < minRaw)
        {
            minRaw = ptrSnsCxt->raw;
        }
        ptrSnsCxt++;
    }

    return minRaw;
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
/*******************************************************************************
* Function Name: Cy_CapSense_MaxRawSearch
****************************************************************************//**
*
* This function seeks for a maximum raw count across the widget.
*
* \note
* This function is available only
* for the fifth-generation low power CAPSENSE&trade;.
*
* \param widgetId
* The widget ID scans will be done for.
*
* \param rowFlag
* The flag for a row/column sensors seek.
* CY_CAPSENSE_ROW_SNS_CALIBRATION - seek performed for rows.
* CY_CAPSENSE_COL_SNS_CALIBRATION - seek performed for columns.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* The maximum raw count.
*
*******************************************************************************/
uint32_t Cy_CapSense_MaxRawSearch(
                uint32_t widgetId,
                uint32_t rowFlag,
                cy_stc_capsense_context_t * context)
{
    cy_stc_capsense_widget_config_t const * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_stc_capsense_sensor_context_t * ptrSnsCxt = ptrWdCfg->ptrSnsContext;
    uint32_t snsCount;
    uint32_t maxRaw = 0u;

