zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
    snsCount = ptrWdCfg->numSns;
    #if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
        if ((CY_CAPSENSE_CSD_GROUP == context->ptrWdConfig[widgetId].senseMethod) &&
            (((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == context->ptrWdConfig[widgetId].wdType) ||
             ((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == context->ptrWdConfig[widgetId].wdType)))
        {
            snsCount = ptrWdCfg->numCols;
            if (CY_CAPSENSE_ROW_SNS_CALIBRATION != rowFlag)
            {
                ptrSnsCxt += snsCount;
                snsCount = ptrWdCfg->numRows;
            }
        }
    #else
        (void)rowFlag;
    #endif

    for (;snsCount-- > 0u;)
    {
        if (ptrSnsCxt->raw > maxRaw)
        {
            maxRaw = ptrSnsCxt->raw;
        }
        ptrSnsCxt++;
    }

    return maxRaw;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_REF_AUTO_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_CalculateAbsDiff
****************************************************************************//**
*
* The internal function that returns absolute difference of two integers.
*
* \note
* This function is available only
* for the fifth-generation low power CAPSENSE&trade;.
*
* \param a
* The first argument to calculate difference.
*
* \param b
* The second argument to calculate difference.
*
* \return
* Returns the absolute difference of arguments.
*
*******************************************************************************/
uint32_t Cy_CapSense_CalculateAbsDiff(
                uint32_t a,
                uint32_t b)
{
    uint32_t result;

    if (a > b)
    {
        result = a - b;
    }
    else
    {
        result = b - a;
    }
    return result;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_REF_AUTO_EN) */


/*******************************************************************************
* Function Name: Cy_CapSense_CdacSuccessAppr
****************************************************************************//**
*
* The internal function that performs the specified CDAC successive
* approximation seek for the specified widget.
*
* The function performs some scans of the slots in specified widget in the CPU
* driven scan mode to seek a CDAC value which produce raw counts greater than
* the configured target.
* The function usage is limited by the CapDAC auto-calibration.
*
* \note
* This function is available only
* for the fifth-generation low power CAPSENSE&trade;.
*
* \param widgetId
* The widget ID scans will be done for.
*
* \param rowFlag
* The flag for a row/column sensors calibration.
* CY_CAPSENSE_ROW_SNS_CALIBRATION - perform calibration for rows.
* CY_CAPSENSE_COL_SNS_CALIBRATION - perform calibration for columns.
*
* \param calibrMask
* The mask for further calibration.
*
* \param cdacPtr
* The pointer to the CDAC field in data structure.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS   - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The calibration is failed due to
*                                  the issues with scanning (either
*                                  watchdog timer, interrupt breaking, etc.).
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CdacSuccessAppr(
                uint32_t widgetId,
                uint32_t rowFlag,
                uint8_t calibrMask,
                uint8_t * cdacPtr,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibrationStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t rawTarget;
    uint32_t minRaw  = 0u;
    uint32_t csdScanEn = CY_CAPSENSE_DISABLE;
    uint32_t cdacMask = calibrMask;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        uint32_t snsFrameType = CY_CAPSENSE_SNS_FRAME_ACTIVE;
    #endif
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_REF_AUTO_EN)
        uint32_t advancedSearchFlag = CY_CAPSENSE_DISABLE;
        uint32_t minRawAbs = CY_CAPSENSE_16_BIT_MASK;
        uint8_t minRawCode = 0u;
        uint32_t tmpRaw;

        if (CY_CAPSENSE_DISABLE == (context->ptrWdConfig[widgetId].cdacConfig & CY_CAPSENSE_CDAC_FINE_MODE_AUTO_MASK))
        {
            advancedSearchFlag = CY_CAPSENSE_ENABLE;
        }
    #endif

    /* Dummy scan */
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        if (CY_CAPSENSE_CSX_GROUP == context->ptrWdConfig[widgetId].senseMethod)
        {
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
                if ((context->ptrWdConfig[widgetId].wdType == (uint8_t)CY_CAPSENSE_WD_LOW_POWER_E))
                {
                    snsFrameType = CY_CAPSENSE_SNS_FRAME_LOW_POWER;
                }
            #endif
            calibrationStatus |= Cy_CapSense_ScanSlotInternalCPU(snsFrameType,
                    context->ptrWdConfig[widgetId].firstSlotId, context);
        }
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        if (CY_CAPSENSE_CSD_GROUP == context->ptrWdConfig[widgetId].senseMethod)
        {
            /* Set CSD scan flag */
            csdScanEn = CY_CAPSENSE_ENABLE;
        }
    #endif

    rawTarget = Cy_CapSense_CalculateRawTarget(widgetId, rowFlag, context);
    *cdacPtr = 0u;

    while (cdacMask != 0u)
    {
        *cdacPtr |= (uint8_t)cdacMask;
        Cy_CapSense_SetWidgetFrameRefCdacCodes(widgetId, context);

        calibrationStatus |= Cy_CapSense_ScanWidgetInternalCPU(widgetId, context);
        Cy_CapSense_PreProcessWidget(widgetId, context);

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
            if (CY_CAPSENSE_MPSC_MIN_ORDER <= context->ptrWdConfig[widgetId].mpOrder)
            {
                /* Find maximum capacitance across sensors in widget */
                minRaw = Cy_CapSense_MaxRawSearch(widgetId, rowFlag, context);
            }
            else
            {
                /* Find minimal capacitance across sensors in widget */
                minRaw = Cy_CapSense_MinRawSearch(widgetId, rowFlag, context);
            }
        #else
            /* Find minimal capacitance across sensors in widget */
            minRaw = Cy_CapSense_MinRawSearch(widgetId, rowFlag, context);
        #endif

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_REF_AUTO_EN)
            if (CY_CAPSENSE_DISABLE != advancedSearchFlag)
            {
                tmpRaw = Cy_CapSense_CalculateAbsDiff(minRaw, rawTarget);
                if (tmpRaw <= minRawAbs)
                {
                    minRawAbs = tmpRaw;
                    minRawCode = *cdacPtr;
                }
            }
        #endif

        if (((csdScanEn == CY_CAPSENSE_ENABLE) && (minRaw < rawTarget)) ||
            ((csdScanEn == CY_CAPSENSE_DISABLE) && (minRaw >= rawTarget)))
        {
            *cdacPtr  &= (uint8_t)~cdacMask;
        }
        cdacMask >>= 1u;
    }

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_REF_AUTO_EN)
        if (CY_CAPSENSE_DISABLE != advancedSearchFlag)
        {
            *cdacPtr = minRawCode;
        }
    #endif

