zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
    return calibrationStatus;
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_REF_AUTO_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateRefCdac
****************************************************************************//**
*
* The internal function that performs the reference CDAC successive
* approximation seek for the specified widget with compensation CDAC disabled.
*
* The function performs up to 9 scans of the slots in specified widget in the CPU
* driven scan mode to seek for a minimal reference CDAC value needed to match
* count target.
*
* The function usage is limited by the CapDAC auto-calibration.
*
* \note
* This function is available only
* for the fifth-generation low power CAPSENSE&trade;.
*
* \param widgetId
* The widget ID scans will be done for.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS   - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The calibration is failed due to
*                                  the issues with scanning (either
*                                  watchdog timer, interrupt breaking, etc.).
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateRefCdac(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibrationStatus = CY_CAPSENSE_STATUS_SUCCESS;
    cy_stc_capsense_widget_context_t * ptrWdCxt = &context->ptrWdContext[widgetId];

    calibrationStatus |= Cy_CapSense_CdacSuccessAppr(widgetId, CY_CAPSENSE_ROW_SNS_CALIBRATION, CY_CAPSENSE_CAL_REF_CDAC_MIDDLE_CODE, &ptrWdCxt->cdacRef, context);

    #if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
        if ((CY_CAPSENSE_CSD_GROUP == context->ptrWdConfig[widgetId].senseMethod) &&
            (((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == context->ptrWdConfig[widgetId].wdType) ||
             ((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == context->ptrWdConfig[widgetId].wdType)))
        {
            calibrationStatus |= Cy_CapSense_CdacSuccessAppr(widgetId, CY_CAPSENSE_COL_SNS_CALIBRATION, CY_CAPSENSE_CAL_REF_CDAC_MIDDLE_CODE, &ptrWdCxt->rowCdacRef, context);

            /* Align Reference CDAC rows and cols if enabled */
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_ROW_COL_ALIGN_EN)
                if (ptrWdCxt->cdacRef < ptrWdCxt->rowCdacRef)
                {
                    ptrWdCxt->cdacRef = ptrWdCxt->rowCdacRef;
                }
                ptrWdCxt->rowCdacRef = ptrWdCxt->cdacRef;
            #endif
        }
    #endif

    return calibrationStatus;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_REF_AUTO_EN) */


#if (CY_CAPSENSE_CDAC_FINE_AUTO_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateFineCdac
****************************************************************************//**
*
* The internal function that performs the fine CDAC successive
* approximation seek for the specified widget with compensation CDAC disabled and
* fixed reference CDAC.
*
* The function performs up to 6 scans of the slots in specified widget in the CPU
* driven scan mode to seek for a minimal fine CDAC value needed to match
* count target.
*
* The function usage is limited by the CapDAC auto-calibration.
*
* \note
* This function is available only
* for the fifth-generation low power CAPSENSE&trade;.
*
* \param widgetId
* The widget ID scans will be done for.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS   - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The calibration is failed due to
*                                  the issues with scanning (either
*                                  watchdog timer, interrupt breaking, etc.).
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateFineCdac(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibrationStatus = CY_CAPSENSE_STATUS_SUCCESS;
    cy_stc_capsense_widget_context_t * ptrWdCxt = &context->ptrWdContext[widgetId];

    calibrationStatus |= Cy_CapSense_CdacSuccessAppr(widgetId, CY_CAPSENSE_ROW_SNS_CALIBRATION, CY_CAPSENSE_CAL_FINE_CDAC_MIDDLE_CODE, &ptrWdCxt->cdacFine, context);

    #if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
        if ((CY_CAPSENSE_CSD_GROUP == context->ptrWdConfig[widgetId].senseMethod) &&
            (((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == context->ptrWdConfig[widgetId].wdType) ||
             ((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == context->ptrWdConfig[widgetId].wdType)))
        {
            calibrationStatus |= Cy_CapSense_CdacSuccessAppr(widgetId, CY_CAPSENSE_COL_SNS_CALIBRATION, CY_CAPSENSE_CAL_FINE_CDAC_MIDDLE_CODE, &ptrWdCxt->rowCdacFine, context);

            /* Align Fine CDAC rows and cols if enabled */
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_ROW_COL_ALIGN_EN)
                if (ptrWdCxt->cdacFine < ptrWdCxt->rowCdacFine)
                {
                    ptrWdCxt->cdacFine = ptrWdCxt->rowCdacFine;
                }
                ptrWdCxt->rowCdacFine = ptrWdCxt->cdacFine;
            #endif
        }
    #endif

    return calibrationStatus;
}
#endif /* (CY_CAPSENSE_CDAC_FINE_AUTO_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_COMP_DIV_AUTO_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateCompDivider
****************************************************************************//**
*
* This function adjusts the compensation CDAC divider for the specified widget.
*
* The function scans all widget sensors with fixed reference CDAC and maximum
* compensation CDAC values starting from the compensation CDAC divider value
* equal to the snsClk divider (Kcomp = snsClkDiv / CompDiv = 1). If raw counts
* are over the raw target, the function decreases compensation CDAC divider
* value providing Kcomp as integer until raw counts are less than the raw
* target.
*
* The function does not consider multi-frequency feature. I.e. only the first
* (base) frequency channel is used.
*
* \param widgetId
* Specifies the desired widget ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*                                      The compensation CDAC divider is adjusted
*                                      for the specified widget.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The compensation CDAC divider can not be
*                                         adjusted for the specified widget.
* - CY_CAPSENSE_STATUS_BAD_PARAM     - Invalid parameter(s).
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateCompDivider(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t curSlotIndex;
    uint32_t numSlots;
    uint32_t snsOverflow = 0u;
    uint32_t snsIndex;
    uint32_t rawTemp;
    uint32_t frameType;
    uint32_t rawTarget;
    uint32_t j;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        uint32_t dummyScanFlagEn = 1u;
    #endif

    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    uint32_t compDivDefault = ptrWdCfg->ptrWdContext->snsClk;
    const cy_stc_capsense_scan_slot_t * ptrScanSlots;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        if ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E == ptrWdCfg->wdType)
        {
            numSlots = CY_CAPSENSE_SLOT_LP_COUNT;
            frameType = CY_CAPSENSE_SNS_FRAME_LOW_POWER;
            ptrScanSlots = context->ptrLpScanSlots;
        }
        else
    #endif
    {
        numSlots = CY_CAPSENSE_SLOT_COUNT;
        frameType = CY_CAPSENSE_SNS_FRAME_ACTIVE;
        ptrScanSlots = context->ptrScanSlots;
    }

    /* Sets Max CompCDAC Code within specified widget */
    for (j = 0u; j < ptrWdCfg->numSns; j++)
    {
        ptrWdCfg->ptrSnsContext[j].cdacComp = CY_CAPSENSE_CDAC_MAX_CODE;
    }
    Cy_CapSense_SetWidgetFrameCompCdacCode(widgetId, CY_CAPSENSE_CAL_MODE_COMP_CDAC_CODE_MAX, context);

    /* Defines initial value for Compensation Divider including rows and cols */
    #if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) ||\
         (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
        if ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) &&
            (((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrWdCfg->wdType) ||
             ((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdCfg->wdType)))
        {
            if (compDivDefault > ptrWdCfg->ptrWdContext->rowSnsClk)
            {
                compDivDefault = ptrWdCfg->ptrWdContext->rowSnsClk;
            }
        }
        else
        {
            /* Initializes unused rowSnsClk for further optimization */
            ptrWdCfg->ptrWdContext->rowSnsClk = ptrWdCfg->ptrWdContext->snsClk;
        }
    #else
        /* Initializes unused rowSnsClk for further optimization */
        ptrWdCfg->ptrWdContext->rowSnsClk = ptrWdCfg->ptrWdContext->snsClk;
    #endif

    rawTarget = Cy_CapSense_CalculateRawTarget(widgetId, CY_CAPSENSE_ROW_SNS_CALIBRATION, context);

    compDivDefault++;

