zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
    /*
     * Loop through all Compensation Divider values in descending order.
     *
     * Loop ends when CompDiv value equal 1 or Calibration fails.
     * Switches to the next iteration is done when kComp is not an integer
     * or calibration overflows.
     */
    do
    {
        /* Switches to the next possible divider */
        compDivDefault--;
        /* Checks if divider is valid */
        if (((ptrWdCfg->ptrWdContext->snsClk % compDivDefault) != 0u) ||
            ((ptrWdCfg->ptrWdContext->rowSnsClk % compDivDefault) != 0u))
        {
            continue;
        }

        ptrWdCfg->ptrWdContext->cdacCompDivider = (uint16_t)compDivDefault;
        Cy_CapSense_SetCompDivider(widgetId, context);

        snsOverflow = 0u;
        for (curSlotIndex = 0u; curSlotIndex < numSlots; curSlotIndex++)
        {
            /* Checks only the specified widget in the current slot */
            if (widgetId == ptrScanSlots[curSlotIndex].wdId)
            {
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                    /* Dummy scan */
                    if ((0u != dummyScanFlagEn) && (CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod))
                    {
                        calibStatus |= Cy_CapSense_ScanSlotInternalCPU(frameType, curSlotIndex, context);
                        dummyScanFlagEn = 0u;
                    }
                #endif

                calibStatus |= Cy_CapSense_ScanSlotInternalCPU(frameType, curSlotIndex, context);

                snsIndex = ptrScanSlots[curSlotIndex].snsId;
                Cy_CapSense_PreProcessSensor(widgetId, snsIndex, context);
                rawTemp = ptrWdCfg->ptrSnsContext[snsIndex].raw;

                if ((CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod) ||
                    (CY_CAPSENSE_ISX_GROUP == ptrWdCfg->senseMethod) ||
                    ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) && (!(CY_CAPSENSE_MPSC_MIN_ORDER > ptrWdCfg->mpOrder))))
                {
                    if (rawTemp <= rawTarget)
                    {
                        snsOverflow = 1u;
                    }
                }
                else
                {
                    if (rawTemp > rawTarget)
                    {
                        snsOverflow = 1u;
                    }
                }

                if (0u != snsOverflow)
                {
                    /* If at least one sensor of the specified widget has
                     * Raw Count too high (no enough compensation level)
                     * then switch to the next compensation divider value.
                     */
                    break;
                }
            }
        }
        /* Finish the searching if no overflow across all sensors of the specified widget */
        if (0u == snsOverflow)
        {
            break;
        }
    } while ((compDivDefault > CY_CAPSENSE_CDAC_COMP_DIV_MIN_MSCLP) &&
             (CY_CAPSENSE_STATUS_SUCCESS == calibStatus));

    return calibStatus;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_COMP_DIV_AUTO_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_COMP_AUTO_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateCompCdac
****************************************************************************//**
*
* The internal function that performs the compensation CDAC successive
* approximation seek for the specified widget with fixed reference CDAC and
* fixed compensation divider.
*
* The function performs up to 9 scans of the slots in specified widget in the CPU
* driven scan mode to seek for a minimal compensation CDAC value needed to match
* count target.
*
* The function usage is limited by the CapDAC auto-calibration.
*
* \note
* This function is available only
* for the fifth-generation low power CAPSENSE&trade;.
*
* \param widgetId
* The widget ID scans will be done for.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS   - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The calibration is failed due to
*                                  the issues with scanning (either
*                                  watchdog timer, interrupt breaking, etc.).
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateCompCdac(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibStatus = CY_CAPSENSE_STATUS_SUCCESS;
    cy_stc_capsense_widget_config_t const * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    uint8_t cdacMask;
    uint32_t rawTarget;
    uint32_t snsIndex;
    uint32_t sensingGroup = context->ptrWdConfig[widgetId].senseMethod;
    uint32_t csdScanEn = CY_CAPSENSE_DISABLE;
    uint32_t snsFrameType = CY_CAPSENSE_SNS_FRAME_ACTIVE;

    /* Calculate raw target for current sensing method */
    rawTarget = Cy_CapSense_CalculateRawTarget(widgetId, CY_CAPSENSE_ROW_SNS_CALIBRATION, context);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        if ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E == ptrWdCfg->wdType)
        {
            snsFrameType = CY_CAPSENSE_SNS_FRAME_LOW_POWER;
        }
    #endif

    /* Dummy scan */
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        if (CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod)
        {
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
                if ((ptrWdCfg->wdType == (uint8_t)CY_CAPSENSE_WD_LOW_POWER_E))
                {
                    snsFrameType = CY_CAPSENSE_SNS_FRAME_LOW_POWER;
                }
            #endif
            calibStatus |= Cy_CapSense_ScanSlotInternalCPU(snsFrameType,
                    ptrWdCfg->firstSlotId, context);
        }
    #endif

    for (snsIndex = 0u; snsIndex < (uint32_t)ptrWdCfg->numSns; snsIndex++)
    {
        #if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
            if ((CY_CAPSENSE_CSD_GROUP == sensingGroup) &&
                (ptrWdCfg->numCols <= snsIndex) &&
                (((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdCfg->wdType) ||
                ((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrWdCfg->wdType)))
            {
                rawTarget = Cy_CapSense_CalculateRawTarget(widgetId, CY_CAPSENSE_COL_SNS_CALIBRATION, context);
            }
        #endif

        if (CY_CAPSENSE_CSD_GROUP == sensingGroup)
        {
            /* Set CSD scan flag */
            csdScanEn = CY_CAPSENSE_ENABLE;
            /* Clear flag as compensation CapDAC code for MPSC widgets should be increased unlike reference CapDAC */
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
                if (CY_CAPSENSE_MPSC_MIN_ORDER <= ptrWdCfg->mpOrder)
                {
                    csdScanEn = CY_CAPSENSE_DISABLE;
                }
            #endif
        }

        cdacMask = (uint8_t)CY_CAPSENSE_CAL_COMP_CDAC_MIDDLE_CODE;
        ptrSnsCxt = &ptrWdCfg->ptrSnsContext[snsIndex];
        ptrSnsCxt->cdacComp = 0u;
        Cy_CapSense_SetWidgetFrameCompCdacCode(widgetId, CY_CAPSENSE_CAL_MODE_COMP_CDAC_CODE_MIN, context);

        while (0u != cdacMask)
        {
            ptrSnsCxt->cdacComp |= cdacMask;
            Cy_CapSense_SetWidgetFrameCompCdacCode(widgetId, CY_CAPSENSE_CAL_MODE_COMP_CDAC_CODE_VAL, context);

            calibStatus |= Cy_CapSense_ScanSlotInternalCPU(snsFrameType, (ptrWdCfg->firstSlotId + snsIndex), context);
            Cy_CapSense_PreProcessWidget(widgetId, context);

            if (calibStatus == CY_CAPSENSE_STATUS_SUCCESS)
            {
                if (((csdScanEn == CY_CAPSENSE_ENABLE) && ((uint32_t)ptrSnsCxt->raw < rawTarget)) ||
                    ((csdScanEn == CY_CAPSENSE_DISABLE) && ((uint32_t)ptrSnsCxt->raw >= rawTarget)))
                {
                    ptrSnsCxt->cdacComp &= ~cdacMask;
                }

                cdacMask >>= 1u;
            }
            else
            {
                break;
            }
        }
    }

    return calibStatus;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_COMP_AUTO_EN) */


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_REF_AUTO_EN)      || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_FINE_AUTO_EN)     || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_COMP_DIV_AUTO_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_COMP_AUTO_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_CalculateRawTarget
****************************************************************************//**
*
* The internal function that calculates the auto-calibration target in
* raw counts.
*
* \note
* This function is available only
* for the fifth-generation low power CAPSENSE&trade;.
*
* \param widgetId
* The widget ID calculation will be done for.
*
* \param rowFlag
* The flag for a row/column raw target calculation.
* CY_CAPSENSE_ROW_SNS_CALIBRATION - target calculation performed for rows.
* CY_CAPSENSE_COL_SNS_CALIBRATION - target calculation performed for columns.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the raw count target for widget sensing method.
*
*******************************************************************************/
uint32_t Cy_CapSense_CalculateRawTarget(
                uint32_t widgetId,
                uint32_t rowFlag,
                cy_stc_capsense_context_t * context)
{
    uint32_t rawTarget;

    /* Calculate raw target for current sensing method */
    switch (context->ptrWdConfig[widgetId].senseMethod)
    {
        #if (CY_CAPSENSE_CSD_CDAC_CALIBRATION_USAGE)
            case CY_CAPSENSE_CSD_GROUP:
                rawTarget = context->ptrInternalContext->intrCsdRawTarget;
                break;
        #endif

        #if (CY_CAPSENSE_CSX_CDAC_CALIBRATION_USAGE)
            case CY_CAPSENSE_CSX_GROUP:
                rawTarget = context->ptrInternalContext->intrCsxRawTarget;
                break;
        #endif

        #if (CY_CAPSENSE_ISX_CDAC_CALIBRATION_USAGE)
            case CY_CAPSENSE_ISX_GROUP:
                rawTarget = context->ptrInternalContext->intrIsxRawTarget;
                break;
        #endif

        #if (CY_CAPSENSE_WBX_CDAC_CALIBRATION_USAGE)
            case CY_CAPSENSE_WBX_GROUP:
                rawTarget = context->ptrInternalContext->intrWbxRawTarget;
                break;
        #endif

        default:
            /* Widget type is not valid */
            rawTarget = 0u;
            break;
    }

