zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
    if (CY_CAPSENSE_ROW_SNS_CALIBRATION == rowFlag)
    {
        rawTarget *= context->ptrWdContext[widgetId].maxRawCount;
    }
    #if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
        else
        {
            rawTarget *= context->ptrWdContext[widgetId].maxRawCountRow;
        }
    #endif

    rawTarget /= CY_CAPSENSE_PERCENTAGE_100;

    return rawTarget;
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_REF_AUTO_EN)      || \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_FINE_AUTO_EN)     || \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_COMP_DIV_AUTO_EN) || \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_COMP_AUTO_EN)) */


/*******************************************************************************
* Function Name: Cy_CapSense_ScanSlotInternalCPU
****************************************************************************//**
*
* Initiates the blocking scan of specified slot in CPU mode.
*
* This function initiates a scan of specified slot in the CPU driven scan
* mode, waits for operation completion and then exits.
* Use of this function is limited to the CapDAC auto-calibration.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param snsFrameType
* The Sensor Frame type:
* * CY_CAPSENSE_SNS_FRAME_ACTIVE     - Sensor frame for Active slot
* * CY_CAPSENSE_SNS_FRAME_LOW_POWER  - Sensor frame for Low Power slot
*
* \param scanSlotId
* The slot ID scans will be done for.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS   - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The calibration is failed due to
*                                  the issues with scanning (either
*                                  watchdog timer, interrupt breaking, etc.).
*
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanSlotInternalCPU(
                uint32_t snsFrameType,
                uint32_t scanSlotId,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t result = CY_CAPSENSE_STATUS_SUCCESS;
    cy_stc_capsense_internal_context_t * ptrIntrCxt = context->ptrInternalContext;
    const cy_stc_capsense_scan_slot_t * ptrScanSlots;
    MSCLP_Type * ptrHwBase = context->ptrCommonConfig->ptrChConfig->ptrHwBase;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    uint32_t * ptrSensorFrame;
    uint32_t tmpRawCount;
    uint32_t wdIndex;
    uint32_t snsIndex;
    uint32_t watchdog;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        if (snsFrameType == CY_CAPSENSE_SNS_FRAME_LOW_POWER)
        {
            ptrSensorFrame = &context->ptrSensorFrameLpContext[(scanSlotId * CY_MSCLP_11_SNS_REGS) + CY_CAPSENSE_FRM_LP_SNS_SW_SEL_CSW_LO_MASK2_INDEX];
            ptrScanSlots = context->ptrLpScanSlots;
        }
        else
        {
            ptrSensorFrame = &context->ptrSensorFrameContext[scanSlotId * CY_CAPSENSE_SENSOR_FRAME_SIZE];
            ptrScanSlots = context->ptrScanSlots;
        }
    #else
        ptrSensorFrame = &context->ptrSensorFrameContext[scanSlotId * CY_CAPSENSE_SENSOR_FRAME_SIZE];
        ptrScanSlots = context->ptrScanSlots;
        (void) snsFrameType;
    #endif

    wdIndex = ptrScanSlots[scanSlotId].wdId;
    snsIndex = ptrScanSlots[scanSlotId].snsId;
    ptrWdCfg = &context->ptrWdConfig[wdIndex];

    if ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) &&
        (CY_CAPSENSE_MPSC_MIN_ORDER <= ptrWdCfg->mpOrder))
    {
        result = Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_MPSC_SCANNING, context);
    }
    else
    {
        result = Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING, context);
    }

    Cy_CapSense_SetupCpuOperatingMode(context);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN)
        if (0u != (ptrWdCfg->centroidConfig & CY_CAPSENSE_LLW_FOAM_EN_MASK))
        {
            /* Configures Foam Detection scan */
            context->ptrCommonConfig->ptrChConfig->ptrHwBase->SENSE_DUTY_CTL =
                    ((CY_CAPSENSE_SM_REG_SENSE_DUTY_CTL_FLD_PHASE_WIDTH_SEL_FOAM << MSCLP_SENSE_DUTY_CTL_PHASE_WIDTH_SEL_Pos) |
                     (CY_CAPSENSE_SM_REG_SENSE_DUTY_CTL_FLD_PHASE_SHIFT_CYCLES_FOAM << MSCLP_SENSE_DUTY_CTL_PHASE_SHIFT_CYCLES_Pos) |
                     ((uint32_t)ptrWdCfg->ptrWdContext->sigPFC << MSCLP_SENSE_DUTY_CTL_PHASE_WIDTH_Pos));
        }
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
        ptrWdCfg = &context->ptrWdConfig[context->ptrScanSlots[scanSlotId].wdId];
        if ((uint8_t)CY_CAPSENSE_WD_WHEATSTONE_BRIDGE_E == ptrWdCfg->wdType)
        {
            /* Configures Compensation CDAC direction */
            if (0u != (ptrWdCfg->ptrWdContext->status & CY_CAPSENSE_WD_WBX_COMPENSATION_DIRECTION_MASK))
            {
                context->ptrCommonConfig->ptrChConfig->ptrHwBase->SW_SEL_CDAC_CO = 
                    CY_CAPSENSE_WBX_SW_SEL_CDAC_CO_INVERTED;
            }
            else
            {
                context->ptrCommonConfig->ptrChConfig->ptrHwBase->SW_SEL_CDAC_CO = 
                    CY_CAPSENSE_WBX_SW_SEL_CDAC_CO_DIRECT;
            }
            /* Disables CIC2 HW filter for WBX widget */
            #if (CY_CAPSENSE_CIC2_FILTER_EN)
                context->ptrCommonConfig->ptrChConfig->ptrHwBase->FILTER_CTL &= 
                    (uint32_t)~MSCLP_FILTER_CTL_FILTER_MODE_Msk;
            #endif
        }
    #endif

    /* Initialize internal context */
    ptrIntrCxt->currentSlotIndex = (uint16_t)scanSlotId;
    ptrIntrCxt->endSlotIndex = (uint16_t)scanSlotId;

    /* Set sensor config registers (frame) */
    Cy_CapSense_StartCpuScan(ptrSensorFrame, context);
    watchdog = Cy_CapSense_GetScanWatchdogTime(wdIndex, scanSlotId, context);
    watchdog = Cy_CapSense_WaitEndOfCpuScan(watchdog, context);

