zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
    /* Check if the watchdog timeout happened */
    if (0u == watchdog)
    {
        result = CY_CAPSENSE_STATUS_CALIBRATION_FAIL;
    }

    if (result == CY_CAPSENSE_STATUS_SUCCESS)
    {
        /* Read raw counts */
        tmpRawCount = ptrHwBase->SNS.RESULT_FIFO_RD;

        ptrSnsCxt = &context->ptrWdConfig[wdIndex].ptrSnsContext[snsIndex];
        ptrSnsCxt->status &= (uint8_t)~CY_CAPSENSE_SNS_OVERFLOW_MASK;

        if (MSCLP_SNS_RESULT_FIFO_RD_OVERFLOW_Msk == (tmpRawCount & MSCLP_SNS_RESULT_FIFO_RD_OVERFLOW_Msk))
        {
            ptrSnsCxt->status |= CY_CAPSENSE_SNS_OVERFLOW_MASK;
        }
        tmpRawCount &= MSCLP_SNS_RESULT_FIFO_RD_RAW_COUNT_Msk;

        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN) && \
             ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) || (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)))

            if (0u == (context->ptrCommonContext->status & CY_CAPSENSE_MW_STATE_SMARTSENSE_MASK))
            {
                if ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E == ptrWdCfg->wdType)
                {
                    if ((CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod) ||
                        (CY_CAPSENSE_ISX_GROUP == ptrWdCfg->senseMethod))
                    {
                        /* Limit raw counts */
                        if (tmpRawCount < ptrWdCfg->ptrWdContext->maxRawCount)
                        {
                            /* Invert raw counts for CSX/ISX widgets */
                            tmpRawCount = (ptrWdCfg->ptrWdContext->maxRawCount - tmpRawCount);
                        }
                        else
                        {
                            tmpRawCount = 0u;
                        }
                    }
                }
            }
        #endif
        ptrSnsCxt->raw = (uint16_t)tmpRawCount;
    }

    /* Disable HW IP */
    ptrHwBase->CTL &= (~MSCLP_CTL_ENABLED_Msk);

    return result;
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) || \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CALIBRATION_EN) || \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CALIBRATION_EN)) */


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CALIBRATION_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_ScanWidgetInternalCPU
****************************************************************************//**
*
* Initiates the blocking scan of specified widget in CPU mode.
*
* This function initiates a scan of specified widget in the CPU driven scan
* mode, waits for operation completion and then exits.
* Use of this function is limited to the CapDAC auto-calibration.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param widgetId
* The widget ID scans will be done for.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS   - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM - The input parameter is invalid.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanWidgetInternalCPU(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t result = CY_CAPSENSE_STATUS_SUCCESS;
    cy_stc_capsense_widget_config_t const * ptrWdCfg = &context->ptrWdConfig[widgetId];
    uint32_t currSlot;
    uint32_t snsFrameType = CY_CAPSENSE_SNS_FRAME_ACTIVE;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        if ((ptrWdCfg->wdType == (uint8_t)CY_CAPSENSE_WD_LOW_POWER_E))
        {
            snsFrameType = CY_CAPSENSE_SNS_FRAME_LOW_POWER;
        }
    #endif

    for (currSlot = ptrWdCfg->firstSlotId; currSlot < ((uint32_t)ptrWdCfg->firstSlotId + ptrWdCfg->numSlots); currSlot++)
    {
        result |= Cy_CapSense_ScanSlotInternalCPU(snsFrameType, currSlot, context);
    }

    return result;
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) || \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CALIBRATION_EN) || \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CALIBRATION_EN)) */


/*******************************************************************************
* Function Name: Cy_CapSense_WatchdogCyclesNum
****************************************************************************//**
*
* Converts the specified time into number of CPU cycles.
*
* \param desiredTimeUs
* The time (delay) specified in us.
*
* \param cpuFreqMHz
* The CPU frequency in MHz.
*
* \param cyclesPerLoop
* The number of cycles per a loop.
*
*******************************************************************************/
uint32_t Cy_CapSense_WatchdogCyclesNum(
                uint32_t desiredTimeUs,
                uint32_t cpuFreqMHz,
                uint32_t cyclesPerLoop)
{
    uint32_t retVal;

    if (0uL != cyclesPerLoop)
    {
        retVal = (desiredTimeUs * cpuFreqMHz) / cyclesPerLoop;
    }
    else
    {
        retVal = 0xFFFFFFFFuL;
    }

    return retVal;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SsInitialize
****************************************************************************//**
*
* Performs the hardware and firmware initialization required for proper operation
* of the CAPSENSE&trade; middleware. This function is called from
* the Cy_CapSense_Init() prior to calling any other function of the middleware.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return status
* Returns the status of the operation (different statuses can be combined):
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed
*                                         successfully.
* - CY_CAPSENSE_STATUS_BAD_CLOCK_CONFIG - Sense Clock Divider is out
*                                         of the valid range
*                                         for the specified Clock source
*                                         configuration.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - At least one of input parameters is
*                                         not valid.
* - CY_CAPSENSE_STATUS_HW_BUSY          - The MSCLP HW block is busy and cannot be
*                                         configured.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SsInitialize(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;
    uint32_t i;

    capStatus |= Cy_CapSense_InitializeSourceSenseClk(context);

