zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
    /* Initialize the MSCLP channel for scan */
    /* Reset the sense method */
    context->ptrActiveScanSns->currentSenseMethod = CY_CAPSENSE_UNDEFINED_GROUP;
    context->ptrInternalContext->scanSingleSlot = CY_CAPSENSE_SCAN_MULTIPLE_SLOT;

    /* Configure inactive sensor states */
    context->ptrInternalContext->intrCsdInactSnsConn = ptrCommonCfg->csdInactiveSnsConnection;
    context->ptrInternalContext->intrCsxInactSnsConn = ptrCommonCfg->csxInactiveSnsConnection;
    context->ptrInternalContext->intrIsxInactSnsConn = ptrCommonCfg->isxInactiveSnsConnection;
    context->ptrInternalContext->intrWbxInactSnsConn = ptrCommonCfg->wbxInactiveSnsConnection;

    /* Generate base frame configurations for all enabled MSCLP channels */
    capStatus |= Cy_CapSense_GenerateBaseConfig(context);

    /* Generates sensor frame configuration */
    Cy_CapSense_GenerateAllSensorConfig(CY_CAPSENSE_SNS_FRAME_ACTIVE, context);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        Cy_CapSense_GenerateAllSensorConfig(CY_CAPSENSE_SNS_FRAME_LOW_POWER, context);
    #endif /* CY_CAPSENSE_LP_EN */

    /* Assign the ISR for scan */
    context->ptrInternalContext->ptrISRCallback = &Cy_CapSense_ScanISR;

    /* Calculate and store wake-on-touch timer value */
    context->ptrInternalContext->wotScanIntervalCycles =
        Cy_CapSense_MsclpTimerCalcCycles(context->ptrInternalContext->wotScanInterval, context);

    /* Check if an external start is enabled */
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_FRM_START_EN)
        Cy_GPIO_Pin_FastInit(CY_MSCLP0_EXT_FRM_START_PORT, CY_MSCLP0_EXT_FRM_START_PIN,
                             CY_GPIO_DM_HIGHZ, 0u, HSIOM_SEL_DS_1);
    #endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_EXT_FRM_START_EN) */

    /* Call user's callback function if it is registered */
    if (NULL != context->ptrInternalContext->ptrEODsInitCallback)
    {
        context->ptrInternalContext->ptrEODsInitCallback(context);
    }

    /* Resetting the HW configuration in order to trigger the base frame initialization in scope of the
     * next  Cy_CapSense_SwitchHwConfiguration() function call with the desired HW configuration.
     */
    if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
    {
        capStatus |= Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT, context);
    }

    if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
    {
        capStatus |= Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING, context);
    }

    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN) && \
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC_RATE_MODE_AUTO_EN))
        capStatus |= Cy_CapSense_InitializeCic2Rate(context);
    #endif

    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN) && \
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_AUTO_EN))
        capStatus |= Cy_CapSense_InitializeCic2Shift(context);
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_AUTO_DITHER_EN)
        if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
        {
            capStatus = Cy_CapSense_CdacDitherScaleCalc(context);
        }
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_AUTO_DITHER_EN) */

    /* Find maximum raw count for each widget */
    for (i = 0u; i < CY_CAPSENSE_TOTAL_WIDGET_COUNT; i++)
    {
        if (0u != Cy_CapSense_IsWidgetEnabled(i, context))
        {
            capStatus |= Cy_CapSense_InitializeMaxRaw(i, context);

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN)
                if (0u != (context->ptrWdConfig[i].centroidConfig & CY_CAPSENSE_LLW_FOAM_EN_MASK))
                {
                    context->ptrWdConfig[i].ptrWdContext->sigPFC = context->ptrWdConfig[i].foamCoefficient;
                }
            #endif
        }
    }

    return capStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_InterruptHandler_V3Lp
****************************************************************************//**
*
* Implements the interrupt service routine (ISR) for the Fifth generation low power
* CAPSENSE&trade;.
*
* At the end of the whole frame scan, the MSCLP HW block generates interrupts
* (for the frame while regular widget scanning and for the time-out number of frames
* or for signal detection while low power widget scanning). The ISR distinguishes
* these interrupts and reads raw counts into the Data structure respectively, and
* then exits if no other slots to scan left,
* Otherwise - starts a scan for the next set of regular sensors. The HW MRSS is turned
* off after the last regular widget scan.
*
* The CAPSENSE&trade; middleware uses this interrupt to implement the
* non-blocking sensor scan method, in which only the first frame scan is
* initiated in the interrupt service routine as soon as the current frame scan
* completes. The interrupt service routine is implemented
* as a part of the CAPSENSE&trade; middleware.
*
* The CAPSENSE&trade; middleware does not initialize or modify the priority
* of interrupts - instead, the application program
* configures an MSCLP interrupt and assigns the interrupt vector to
* the Cy_CapSense_InterruptHandler() function. For details, refer to the function
* usage example.
*
* \note
* This function is available only for the fifth-generation low power
* CAPSENSE&trade;.
*
* The call of the End Of Scan callback (for details, see the \ref group_capsense_callbacks
* section) is the part of the Cy_CapSense_InterruptHandler() routine
* and that call lengthens its execution. Such a callback lengthens the MSCLP ISR execution
* in the case of a direct call of the Cy_CapSense_InterruptHandler() function
* from a MSCLP ISR.
*
* \param base
* The pointer to the base register address of the MSCLP HW block.
* This argument is kept for uniformity and backward compatibility
* and is not used. The function can be called with value NULL.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \funcusage
*
* An example of the ISR initialization:
*
* The CapSense_ISR_cfg variable should be declared by the application
* program according to the examples below:<br>
* For Core CM0+:
* \snippet capsense/snippet/main.c snippet_m0p_capsense_interrupt_source_declaration
*
* The CAPSENSE&trade; interrupt handler should be defined by the application program
* according to the example below:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_IntHandler
*
* Then, the application program configures and enables the interrupt
* for each MSCLP HW block between calls of the Cy_CapSense_Init() and
* Cy_CapSense_Enable() functions:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_Initialization
*
*******************************************************************************/
void Cy_CapSense_InterruptHandler_V3Lp(const MSCLP_Type * base, cy_stc_capsense_context_t * context)
{
    (void)base;
    context->ptrInternalContext->ptrISRCallback((void *)context);
}


