zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
/*******************************************************************************
* Function Name: Cy_CapSense_ScanISR
****************************************************************************//**
*
* This is an internal ISR function to handle the MSCLP sensing
* in AS_MS and LP_AoS operating modes.
*
* \param capsenseContext
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_ScanISR(void * capsenseContext)
{
    cy_stc_capsense_context_t * cxt = (cy_stc_capsense_context_t *)capsenseContext;
    MSCLP_Type * ptrHwBase = cxt->ptrCommonConfig->ptrChConfig->ptrHwBase;
    cy_stc_capsense_internal_context_t * ptrIntrCxt = cxt->ptrInternalContext;
    uint32_t numScanSlots;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        /* Check for interrupt source: MSCLP_INTR_LP_FRAME_Msk for ACTIVE widget scan */
        if (MSCLP_INTR_LP_FRAME_Msk != (ptrHwBase->INTR_LP & ptrHwBase->INTR_LP_MASK & MSCLP_INTR_LP_FRAME_Msk))
        {
            /* It was the low power scan - check if a signal detection had occurred */
            if (MSCLP_INTR_LP_SIG_DET_Msk == (ptrHwBase->INTR_LP & MSCLP_INTR_LP_SIG_DET_Msk))
            {
                cxt->ptrCommonContext->status |= (uint32_t)CY_CAPSENSE_MW_STATE_LP_ACTIVE_MASK;
            }

            /* Read the last low power frame raw counts */
            if ((cxt->ptrCommonContext->lpDataSt & CY_CAPSENSE_LP_PROCESS_ENABLED_MASK) != 0u)
            {
                Cy_CapSense_TransferLpRawCounts(ptrIntrCxt->currentSlotIndex, ptrIntrCxt->numSlots, cxt);

                /* Mark completion of low power scan cycle */
                cxt->ptrCommonContext->lpScanCounter++;
            }

            /* Disable HW IP */
            ptrHwBase->CTL &= (~MSCLP_CTL_ENABLED_Msk);

            /* Clear all pending interrupts of the MSCLP HW block */
            ptrHwBase->INTR_LP = CY_CAPSENSE_MSCLP_INTR_LP_ALL_MSK;
            (void)ptrHwBase->INTR_LP;

            /* Stop the MRSS to save power */
            ptrHwBase->MRSS_CMD = MSCLP_MRSS_CMD_MRSS_STOP_Msk;

            Cy_CapSense_ClrBusyFlags(cxt);
        }
        else
    #endif
    {
        /* Clear all pending interrupts of the MSCLP HW block */
        ptrHwBase->INTR_LP = CY_CAPSENSE_MSCLP_INTR_LP_ALL_MSK;
        (void)ptrHwBase->INTR_LP;

        /* Read the last ACTIVE frame raw counts */
        Cy_CapSense_TransferRawCounts(ptrIntrCxt->currentSlotIndex, ptrIntrCxt->numSlots, cxt);

        ptrIntrCxt->currentSlotIndex += ptrIntrCxt->numSlots;

        /* Check for the last slot with multiple slot scan, if not - start the next slot scan */
        if (ptrIntrCxt->currentSlotIndex <= ptrIntrCxt->endSlotIndex)
        {
            numScanSlots = (uint32_t)ptrIntrCxt->endSlotIndex - (uint32_t)ptrIntrCxt->currentSlotIndex + 1uL;

            /* Disable delay before next scan */
            ptrHwBase->AOS_CTL &= ~MSCLP_AOS_CTL_WAKEUP_TIMER_Msk;

            /* Clear the first sub-frame flag */
            ptrIntrCxt->firstActSubFrame = CY_CAPSENSE_DISABLE;

            Cy_CapSense_ScanSlotsInternal(ptrIntrCxt->currentSlotIndex, numScanSlots, cxt);
        }
        else
        {
            /* Disable HW IP to allow MRSS operations */
            ptrHwBase->CTL &= (~MSCLP_CTL_ENABLED_Msk);

            /* Stop the MRSS to save power */
            ptrHwBase->MRSS_CMD = MSCLP_MRSS_CMD_MRSS_STOP_Msk;

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN)
                /* Restores config for regular scan */
                cxt->ptrCommonConfig->ptrChConfig->ptrHwBase->SENSE_DUTY_CTL = 
                    ((CY_CAPSENSE_SM_REG_SENSE_DUTY_CTL_FLD_PHASE_WIDTH_SEL << MSCLP_SENSE_DUTY_CTL_PHASE_WIDTH_SEL_Pos) | 
                     (CY_CAPSENSE_SM_REG_SENSE_DUTY_CTL_FLD_PHASE_SHIFT_CYCLES << MSCLP_SENSE_DUTY_CTL_PHASE_SHIFT_CYCLES_Pos) | 
                     (CY_CAPSENSE_SM_REG_SENSE_DUTY_CTL_FLD_PHASE_WIDTH << MSCLP_SENSE_DUTY_CTL_PHASE_WIDTH_Pos));
            #endif

            /* Mark completion of active scan cycle */
            cxt->ptrCommonContext->scanCounter++;

            Cy_CapSense_ClrBusyFlags(cxt);
        }
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetCmodInDesiredState
****************************************************************************//**
*
* Sets all available MSCLP Cmod pins into a desired state.
*
The default state to provide the fifth generation low power CAPSENSE&trade; operation is:
* - HSIOM   - Disconnected, the GPIO mode.
* - DM      - High-Z Analog, Input off drive mode.
* - MSC_ANA - Enabled.
*
* Do not call this function directly from the application program.
*
* \param desiredDriveMode
* Specifies the desired pin control port (PC) configuration.
*
* \param desiredHsiom
* Specifies the desired pin HSIOM state.
*
* \param desiredMscCtrl
* Specifies the desired (MSC_ANA) control status of the IO port analog signaling by the MSC.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetCmodInDesiredState(
                uint32_t desiredDriveMode,
                en_hsiom_sel_t desiredHsiom,
                uint32_t desiredMscCtrl,
                const cy_stc_capsense_context_t * context)
{
    Cy_CapSense_SsConfigPinRegisters(
    context->ptrCommonConfig->ptrChConfig->portCmod1,
    (uint32_t)context->ptrCommonConfig->ptrChConfig->pinCmod1,
    desiredDriveMode, desiredHsiom, desiredMscCtrl);

    Cy_CapSense_SsConfigPinRegisters(
    context->ptrCommonConfig->ptrChConfig->portCmod2,
    (uint32_t)context->ptrCommonConfig->ptrChConfig->pinCmod2,
    desiredDriveMode, desiredHsiom, desiredMscCtrl);
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetIOsInDesiredState
****************************************************************************//**
*
* Sets all CAPSENSE&trade; pins into a desired state.
*
* The default state to provide the fifth generation low power CAPSENSE&trade; operation is:
* - HSIOM   - Disconnected, the GPIO mode.
* - DM      - Strong drive.
* - MSC_ANA - Enabled.
* - State   - Zero.
*
* Do not call this function directly from the application program.
*
* \param desiredDriveMode
* Specifies the desired pin control port (PC) configuration.
*
* \param desiredHsiom
* Specifies the desired pin HSIOM state.
*
* \param desiredPinOutput
* Specifies the desired pin output data register (DR) state.
*
* \param desiredMscCtrl
* Specifies the desired (MSC_ANA) control status of the IO port analog signaling by the MSC.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetIOsInDesiredState(
                uint32_t desiredDriveMode,
                en_hsiom_sel_t desiredHsiom,
                uint32_t desiredPinOutput,
                uint32_t desiredMscCtrl,
                const cy_stc_capsense_context_t * context)
{
    uint32_t loopIndex;
    const cy_stc_capsense_pin_config_t * ptrPinCfg = context->ptrPinConfig;

