zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
                    for (snsIndex = ptrWdCfg->numCols; snsIndex < ptrWdCfg->numSns; snsIndex++)
                    {
                        if ((ptrSnsCxt->raw < ((temp * lowerLimit) / CY_CAPSENSE_PERCENTAGE_100)) ||
                            (ptrSnsCxt->raw > ((temp * upperLimit) / CY_CAPSENSE_PERCENTAGE_100)))
                        {
                            calibStatus |= CY_CAPSENSE_STATUS_CALIBRATION_CHECK_FAIL;
                            break;
                        }
                        ptrSnsCxt++;
                    }
                    break;
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) || \
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN))
                case CY_CAPSENSE_CSX_GROUP:
                case CY_CAPSENSE_ISX_GROUP:
                    for (snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
                    {
                        if ((ptrSnsCxt->raw < ((temp * lowerLimit) / CY_CAPSENSE_PERCENTAGE_100)) ||
                            (ptrSnsCxt->raw > ((temp * upperLimit) / CY_CAPSENSE_PERCENTAGE_100)))
                        {
                            calibStatus |= CY_CAPSENSE_STATUS_CALIBRATION_CHECK_FAIL;
                            break;
                        }
                        ptrSnsCxt++;
                    }
                    break;
            #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) || \
                       (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)) */

            default:
                calibStatus |= CY_CAPSENSE_STATUS_BAD_PARAM;
                /* No action */
                break;
        }
    }

    return calibStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetCompDivider
****************************************************************************//**
*
* Sets the desired Compensation divider into sensor frames.
*
* This function takes Compensation Divider value from widget structure and
* applies it to all widget's sensors in sensor frame structures.
* This function must not be called when AMUX mode is configured.
*
* \param widgetId
* Specifies widget ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetCompDivider(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    uint32_t i;
    uint32_t * currentFramePtr;
    const cy_stc_capsense_scan_slot_t * ptrScanSlots;
    uint32_t compensationCdacDivider = context->ptrWdContext[widgetId].cdacCompDivider;

    if (0uL != compensationCdacDivider)
    {
        compensationCdacDivider--;
    }

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        if (((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E == context->ptrWdConfig[widgetId].wdType))
        {
            ptrScanSlots = context->ptrLpScanSlots;
            currentFramePtr = &context->ptrSensorFrameLpContext[CY_CAPSENSE_FRM_LP_SNS_SCAN_CTL_INDEX];

            for (i = 0u; i < CY_CAPSENSE_SLOT_LP_COUNT; i++)
            {
                if (ptrScanSlots->wdId == widgetId)
                {
                    *currentFramePtr &= ~MSCLP_SNS_SNS_SCAN_CTL_COMP_DIV_Msk;
                    *currentFramePtr |= (uint32_t)(compensationCdacDivider << MSCLP_SNS_SNS_SCAN_CTL_COMP_DIV_Pos);
                }
                ptrScanSlots++;
                currentFramePtr = &currentFramePtr[CY_MSCLP_11_SNS_REGS];
            }
        }
        else
    #endif
    {
        ptrScanSlots = context->ptrScanSlots;
        currentFramePtr = &context->ptrSensorFrameContext[CY_CAPSENSE_SNS_SCAN_CTL_INDEX];

        for (i = 0u; i < CY_CAPSENSE_SLOT_COUNT; i++)
        {
            if (ptrScanSlots->wdId == widgetId)
            {
                *currentFramePtr &= ~MSCLP_SNS_SNS_SCAN_CTL_COMP_DIV_Msk;
                *currentFramePtr |= (uint32_t)(compensationCdacDivider << MSCLP_SNS_SNS_SCAN_CTL_COMP_DIV_Pos);
            }
            ptrScanSlots++;
            currentFramePtr = &currentFramePtr[CY_CAPSENSE_SENSOR_FRAME_SIZE];
        }
    }
}
#endif


/*******************************************************************************
* Function Name: Cy_CapSense_WaitEndScan
****************************************************************************//**
*
* Waits till end of scan or till the provided timeout.
*
* \param timeout
* Watchdog timeout in microseconds.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_TIMEOUT       - The software watchdog timeout occurred
*                                      during the scan, the scan was not completed.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_WaitEndScan(
                uint32_t timeout,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t status = CY_CAPSENSE_STATUS_BAD_PARAM;

    /* Approximate duration of Wait For Scan */
    uint32_t isBusyLoopDuration = CY_CAPSENSE_APPROX_LOOP_DURATION;

    uint32_t cpuFreqMHz;
    uint32_t watchdogCounter;

    if (NULL != context)
    {
        status = CY_CAPSENSE_STATUS_SUCCESS;
        cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA;

        /* Init Watchdog Counter to prevent a hang */
        watchdogCounter = Cy_CapSense_WatchdogCyclesNum(timeout, cpuFreqMHz, isBusyLoopDuration);
        while (CY_CAPSENSE_NOT_BUSY != Cy_CapSense_IsBusy(context))
        {
            if (0uL == watchdogCounter)
            {
                status = CY_CAPSENSE_STATUS_TIMEOUT;
                break;
            }
            watchdogCounter--;
        }
    }

