zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
    return status;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SlotPinStateInternal
****************************************************************************//**
*
* Configures the desired electrode to the specified state by
* updating the CAPSENSE&trade; configuration.
*
* See detailed descriptions for the  Cy_CapSense_SlotPinState() and
* Cy_CapSense_LpSlotPinState() functions.
*
* \note
* This function does not check correctness of input arguments. Therefore, 
* wrong values might lead to unpredictable behavior. pinState parameter 
* describes all supported options.
* Some electrodes have specific elements outside a device (for example 
* resistance, capacitance, inductance, connection to GND). Therefore,
* we recommend configuring an electrode to its original type and not use it differently.
*
* \param ptrSnsFrm
* The pointer for sensor frame (Active or Low Power) context structure.
*
* \param ptrEltdCfg
* The pointer to an electrode the all pins states of which will be configured
* as pinState parameter.
*
* \param pinState
* The desired pins state for CSX widget electrodes:
* * CY_CAPSENSE_PIN_STATE_IDX_CSX_RX     - Rx electrode.
* * CY_CAPSENSE_PIN_STATE_IDX_CSX_TX     - Tx electrode.
* * CY_CAPSENSE_PIN_STATE_IDX_GND        - Grounded.
* * CY_CAPSENSE_PIN_STATE_IDX_CSX_NEG_TX - Negative Tx electrode
*     (for multi-phase TX method).
* * CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z     - Unconnected (high-z).
* * CY_CAPSENSE_PIN_STATE_IDX_CSX_VDDA2  - Connected to VDDA/2.
*
* The desired pins state for CSD widget electrodes:
* * CY_CAPSENSE_PIN_STATE_IDX_CSD_SNS    - Self-cap sensor.
* * CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z     - Unconnected (high-z).
* * CY_CAPSENSE_PIN_STATE_IDX_GND        - Grounded.
* * CY_CAPSENSE_PIN_STATE_IDX_ACT_SHIELD - Active shield is routed to the pin.
* * CY_CAPSENSE_PIN_STATE_IDX_PAS_SHIELD - Passive shield is routed to the pin.
*
* The desired pins state for ISX widget electrodes:
* * CY_CAPSENSE_PIN_STATE_IDX_ISX_LX     - Lx electrode.
* * CY_CAPSENSE_PIN_STATE_IDX_ISX_RX     - Rx electrode.
* * CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z     - Unconnected (high-z).
* * CY_CAPSENSE_PIN_STATE_IDX_GND        - Grounded.
*
* The desired pins state for WBX widget electrodes:
* * CY_CAPSENSE_PIN_STATE_WBX_NODE_A     - Node A electrode.
* * CY_CAPSENSE_PIN_STATE_WBX_NODE_B     - Node B electrode.
* * CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z     - Unconnected (high-z).
* * CY_CAPSENSE_PIN_STATE_IDX_GND        - Grounded.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_CONFIG       - The function does not suppose to be
*                                         called with the current CAPSENSE&trade;
*                                         configuration.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SlotPinStateInternal(
                uint32_t * ptrSnsFrm,
                const cy_stc_capsense_electrode_config_t * ptrEltdCfg,
                uint32_t pinState,
                cy_stc_capsense_context_t * context)
{
    uint32_t i;
    uint32_t mask = 0u;
    uint32_t * ptrCswFunc = &context->ptrBaseFrameContext->swSelCswFunc[0u];
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_BAD_CONFIG;
    const uint32_t pinStates[CY_CAPSENSE_CTRLMUX_PIN_STATE_NUMBER] = CY_CAPSENSE_PIN_STATES_ARR;

    /* Check if the desired pin state is assigned already */
    if ((context->ptrInternalContext->mapPinState[pinState] == CY_CAPSENSE_SCW_FUNC_PIN_STATE_IDX_UNDEFINED) &&
        (MSCLP_CSW_GLOBAL_FUNC_NR > context->ptrInternalContext->numFunc))
    {
        context->ptrInternalContext->mapPinState[pinState] = context->ptrInternalContext->numFunc;
        ptrCswFunc[context->ptrInternalContext->numFunc] = pinStates[pinState];
        context->ptrCommonConfig->ptrChConfig->ptrHwBase->SW_SEL_CSW_FUNC[context->ptrInternalContext->numFunc] =
                                                           pinStates[pinState];
        context->ptrInternalContext->numFunc += 1u;
        capStatus = CY_CAPSENSE_STATUS_SUCCESS;

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
            if (CY_CAPSENSE_PIN_STATE_IDX_CSX_VDDA2 == pinState)
            {
                /* Close the reference to filter switch */
                context->ptrBaseFrameContext->mode[context->ptrInternalContext->mapSenseMethod[CY_CAPSENSE_REG_MODE_CSX]].swSelSh |= MSCLP_MODE_SW_SEL_SH_SOMB_Msk;
            }
        #endif
    }
    else if (context->ptrInternalContext->mapPinState[pinState] != CY_CAPSENSE_SCW_FUNC_PIN_STATE_IDX_UNDEFINED)
    {
        capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    }
    else
    {
        /* Do nothing */
    }

    if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
    {
        /* Update SNS_SW_SEL_CSW_LO_MASK0 - SNS_SW_SEL_CSW_LO_MASK2 in the sensor frame */
        for (i = 0u; i < ptrEltdCfg->numPins; i++)
        {
            mask |= 0x01uL << ptrEltdCfg->ptrPin[i].padNumber;
        }

        for (i = 0u; i < CY_CAPSENSE_CTRLMUX_PIN_STATE_MASK_NUMBER; i++)
        {
            ptrSnsFrm[i] &= ~mask;
            if (0u != (context->ptrInternalContext->mapPinState[pinState] &
                       ((uint8_t)(1u << (CY_CAPSENSE_CTRLMUX_PIN_STATE_MASK_NUMBER - 1u - i)))))
            {
                ptrSnsFrm[i] |= mask;
            }
        }

        /* Force HW configuration update on the next scan */
        capStatus = Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT, context);
    }

    return capStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SlotPinState_V3Lp
****************************************************************************//**
*
* The internal function that configures the specified electrode to the desired state
* in the specified Active slot by updating the CAPSENSE&trade; configuration.
*
* See the Cy_CapSense_SlotPinState() description for details.
*
* \note
* This function is available for the fifth-generation (only
* for CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) and the fifth-generation
* low power CAPSENSE&trade;. For the fourth-generation CAPSENSE&trade; and
* the fifth-generation CAPSENSE&trade; with
* CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD use Cy_CapSense_SetPinState().
* For Low Power slots for the fifth-generation low power CAPSENSE&trade;
* use Cy_CapSense_LpSlotPinState().
*
* \param slotId
* The slot ID to change the pin state for (Active slot ID for
* the fifth-generation low power CAPSENSE&trade;).
*
* \param ptrEltdCfg
* The pointer to an electrode the all pins states of which will be configured
* as pinState parameter.
*
* \param pinState
* The parameter have different values for the fifth- and the fifth-generation
* low power CAPSENSE&trade;.
*
* The desired pins state for CSX widget electrodes can be:
* * CY_CAPSENSE_PIN_STATE_IDX_CSX_RX     - Rx electrode.
* * CY_CAPSENSE_PIN_STATE_IDX_CSX_TX     - Tx electrode.
* * CY_CAPSENSE_PIN_STATE_IDX_GND        - Grounded.
* * CY_CAPSENSE_PIN_STATE_IDX_CSX_NEG_TX - Negative Tx electrode
*     (for multi-phase TX method).
* * CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z     - Unconnected (high-z).
* * CY_CAPSENSE_PIN_STATE_IDX_CSX_VDDA2  - Connected to VDDA/2.
*
* The desired pins state for CSD widget electrodes can be:
* * CY_CAPSENSE_PIN_STATE_IDX_CSD_SNS    - Self-cap sensor.
* * CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z     - Unconnected (high-z).
* * CY_CAPSENSE_PIN_STATE_IDX_GND        - Grounded.
* * CY_CAPSENSE_PIN_STATE_IDX_ACT_SHIELD - Active shield is routed to the pin.
* * CY_CAPSENSE_PIN_STATE_IDX_PAS_SHIELD - Passive shield is routed to the pin.
*
* The desired pins state for ISX widget electrodes can be:
* * CY_CAPSENSE_PIN_STATE_IDX_ISX_LX     - Lx electrode.
* * CY_CAPSENSE_PIN_STATE_IDX_ISX_RX     - Rx electrode.
* * CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z     - Unconnected (high-z).
* * CY_CAPSENSE_PIN_STATE_IDX_GND        - Grounded.
*
* The desired pins state for WBX widget electrodes:
* * CY_CAPSENSE_PIN_STATE_WBX_NODE_A     - Node A electrode.
* * CY_CAPSENSE_PIN_STATE_WBX_NODE_B     - Node B electrode.
* * CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z     - Unconnected (high-z).
* * CY_CAPSENSE_PIN_STATE_IDX_GND        - Grounded.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_CONFIG       - The function does not suppose to be
*                                         called with the current CAPSENSE&trade;
*                                         configuration.
*
* \funcusage
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_SlotPinState
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SlotPinState_V3Lp(
                uint32_t slotId,
                const cy_stc_capsense_electrode_config_t * ptrEltdCfg,
                uint32_t pinState,
                cy_stc_capsense_context_t * context)
{
    uint32_t * ptrSnsFrm = &context->ptrSensorFrameContext[slotId * CY_CAPSENSE_SENSOR_FRAME_SIZE];

    return (Cy_CapSense_SlotPinStateInternal(ptrSnsFrm, ptrEltdCfg, pinState, context));
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_LpSlotPinState
****************************************************************************//**
*
* Configures the specified electrode to the desired state in the specified Low Power
* slot by updating the CAPSENSE&trade; configuration.
*
* This function changes / overwrites configuration of an electrode (several
* pins in case the electrode is ganged to more pins) with a state specified
* by the pinState parameter. The function does this only for the specified Low Power
* slot ID. If the electrode should have the desired state during scans in another Low
* Power slots, the function should be called multiple times for each desired Low Power
* slot.
*
* The function call changes the pin states permanently and all further scans of
* the slot will have the electrode state as specified by the pinState parameter.
* Call the function again to change the electrode state to a new desired one or
* reinitialize CAPSENSE&trade; middleware by using the Cy_CapSense_Enable() function.
*
* The function changes the configuration of an electrode without storing
* the previous state. A user is responsible to keep the previous state to
* revert to the default settings if needed. Also, the default settings
* can be configured again by calling Cy_CapSense_Enable() function that
* leads to repeating CAPSENSE&trade; Data Structure initialization,
* DAC auto-calibration, and baseline initialization.
*
* Using the function is recommended only for advanced users for specific use cases.
* For instance, to change the CAPSENSE&trade; default electrode configuration,
* the function could be called by using a CAPSENSE&trade; Data Structure
* Initialization callback ptrEODsInitCallback. For details of how to register
* the callback see the \ref group_capsense_callbacks section. That avoids repeating of
* DAC auto-calibration and baseline initialization since the callback is called after
* CAPSENSE&trade; Data Structure initialization but before the first initialization
* scan.
*
* The function is a low-level function and does not perform an input parameter
* verification (like Low Power slot ID, pointers, etc.). For example, the
* CY_CAPSENSE_CTRLMUX_PIN_STATE_SHIELD pin state is not available if a shield is not
* configured in the project, but the function will set the pin state and the HW block
* behavior is unpredictable.
*
* \note
* This function is available only for the fifth-generation low power
* CAPSENSE&trade;. For the fifth-generation (only for
* CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) and fifth-generation low power
* CAPSENSE&trade; Active slots use Cy_CapSense_SlotPinState(). For fourth-generation
* CAPSENSE&trade; and fifth-generation CAPSENSE&trade; with
* CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD use Cy_CapSense_SetPinState().
*
* \param lpSlotId
* The desired Low Power slot ID.
*
* \param ptrEltdCfg
* The pointer to an electrode the all pins states of which will be configured
* as pinState parameter.
*
* \param pinState
* The desired pins state for CSX widget electrodes could be:
* * CY_CAPSENSE_RX_PIN - Rx electrode
* * CY_CAPSENSE_TX_PIN - Tx electrode
* * CY_CAPSENSE_GROUND - Grounded
* * CY_CAPSENSE_NEGATIVE_TX_PIN - Negative Tx electrode
*     (for multi-phase TX method)
* * CY_CAPSENSE_HIGHZ - Unconnected (High-Z)
* * CY_CAPSENSE_VDDA2 - Connected to VDDA/2.
*
* The desired pins state for CSD widget electrodes could be:
* * CY_CAPSENSE_SENSOR - Self-cap sensor
* * CY_CAPSENSE_HIGHZ - Unconnected (High-Z)
* * CY_CAPSENSE_GROUND - Grounded
* * CY_CAPSENSE_SHIELD - Shield is routed to the pin.
*
* The desired pins state for ISX widget electrodes could be:
* * CY_CAPSENSE_ISX_RX_PIN - ISX Rx electrode
* * CY_CAPSENSE_ISX_LX_PIN - ISX Lx electrode
* * CY_CAPSENSE_HIGHZ - Unconnected (High-Z).
*
* The desired pins state for WBX widget electrodes:
* * CY_CAPSENSE_PIN_STATE_WBX_NODE_A     - Node A electrode.
* * CY_CAPSENSE_PIN_STATE_WBX_NODE_B     - Node B electrode.
* * CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z     - Unconnected (high-z).
* * CY_CAPSENSE_PIN_STATE_IDX_GND        - Grounded.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_CONFIG       - The function does not suppose to be
*                                         called with the current CAPSENSE&trade;
*                                         configuration.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - 1) lpSlotId, sensorElement or pinState
*                                            are not valid;
*                      2) the CSD sensing method is disabled for desired
*                         CY_CAPSENSE_SHIELD or CY_CAPSENSE_SENSOR states;
*                      3) the CSX sensing method is disabled for desired
*                         CY_CAPSENSE_TX_PIN, CY_CAPSENSE_NEGATIVE_TX_PIN or
*                         CY_CAPSENSE_RX_PIN states.
*                      4) the ISX sensing method is disabled for desired
*                         CY_CAPSENSE_ISX_RX_PIN or CY_CAPSENSE_ISX_LX_PIN
*                         states.
*                      5) the WBX sensing method is disabled for desired
*                         CY_CAPSENSE_PIN_STATE_WBX_NODE_A or 
*                         CY_CAPSENSE_PIN_STATE_WBX_NODE_B states.
*
* \funcusage
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_LpSlotPinState
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_LpSlotPinState(
                uint32_t lpSlotId,
                const cy_stc_capsense_electrode_config_t * ptrEltdCfg,
                uint32_t pinState,
                cy_stc_capsense_context_t * context)
{
    uint32_t * ptrSnsFrm;
    uint32_t localPinState;
    cy_capsense_status_t result = CY_CAPSENSE_STATUS_BAD_PARAM;

    if ((NULL != context) && (NULL != ptrEltdCfg) && (CY_CAPSENSE_SLOT_LP_COUNT > lpSlotId))
    {
        result = Cy_CapSense_ConvertPinState(pinState, &localPinState);

        if ((uint32_t)CY_CAPSENSE_SUCCESS_E == result)
        {
            ptrSnsFrm = &context->ptrSensorFrameLpContext[(lpSlotId * CY_MSCLP_11_SNS_REGS) + CY_MSCLP_5_SNS_REGS];
            result = Cy_CapSense_SlotPinStateInternal(ptrSnsFrm, ptrEltdCfg, localPinState, context);
        }
    }
    return (result);
}
#endif /* CY_CAPSENSE_LP_EN */


