zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
/*******************************************************************************
* Function Name: Cy_CapSense_SwitchHwConfiguration
****************************************************************************//**
*
* Configures CAPSENSE&trade;-related hardware to the specified state.
*
* \param configuration
* The state of CAPSENSE&trade;-related hardware:
* * CY_CAPSENSE_HW_CONFIG_UNDEFINED.
* * CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT.
* * CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING.
* * CY_CAPSENSE_HW_CONFIG_MPSC_SCANNING.
* * CY_CAPSENSE_HW_CONFIG_CHANNEL_SATURATION
* * CY_CAPSENSE_HW_CONFIG_WBX_SCANNING.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS      - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM    - At least one of input parameters is
*                                     not valid.
* - CY_CAPSENSE_STATUS_HW_BUSY      - The MSCLP HW block is busy and cannot be
*                                     configured.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SwitchHwConfiguration(
                uint32_t configuration,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    cy_en_msclp_status_t msclpStatus;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;
    MSCLP_Type * ptrHwBase = ptrCommonCfg->ptrChConfig->ptrHwBase;

    if (context->ptrInternalContext->hwConfigState != configuration)
    {
        /* Turn off the previous HW configuration */
        switch (context->ptrInternalContext->hwConfigState)
        {
            case CY_CAPSENSE_HW_CONFIG_UNDEFINED:
                break;
            case CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT:
                break;
            case CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING:
                break;
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN)
                case CY_CAPSENSE_HW_CONFIG_BIST_FUNCTIONALITY:
                    Cy_CapSense_BistDisableMode(context);
                    break;
            #endif
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
                case CY_CAPSENSE_HW_CONFIG_MPSC_SCANNING:
                    break;
            #endif
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
                case CY_CAPSENSE_HW_CONFIG_WBX_SCANNING:
                    break;
            #endif
            case CY_CAPSENSE_HW_CONFIG_CHANNEL_SATURATION:
                break;
            case CY_CAPSENSE_HW_CONFIG_SMARTSENSE:
                break;
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_AUTO_DITHER_EN)
                case CY_CAPSENSE_HW_CONFIG_AUTO_DITHERING:
                    break;
            #endif
            default:
                capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
                break;
        }

        /* Clear the repeat scan flag as the HW configuration is changed */
        context->ptrInternalContext->repeatScanEn = CY_CAPSENSE_DISABLE;

        if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
        {
            /* Turn on the desired HW configuration */
            switch (configuration)
            {
                case CY_CAPSENSE_HW_CONFIG_UNDEFINED:
                    break;
                case CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT:
                    break;

                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
                    case CY_CAPSENSE_HW_CONFIG_MPSC_SCANNING: /* fall through */
                #endif
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
                    case CY_CAPSENSE_HW_CONFIG_WBX_SCANNING: /* fall through */
                #endif

                case CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING:
                    Cy_CapSense_SetIOsInDesiredState(CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO, 0u,
                                                     CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_EN, context);

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                        Cy_CapSense_SetShieldPinsInDesiredState(CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO,
                                                                CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_EN, context);
                    #endif

                    /* Reset last scanned widget type */
                    context->ptrCommonContext->status &= (uint32_t)~((uint32_t)CY_CAPSENSE_MW_STATE_WD_SCAN_MASK);
                    context->ptrActiveScanSns->currentSenseMethod = CY_CAPSENSE_UNDEFINED_GROUP;

                    Cy_CapSense_SetCmodInDesiredState(CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO,
                                                      CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_EN, context);

                    msclpStatus = Cy_MSCLP_Configure(ptrHwBase,
                                                     context->ptrBaseFrameContext,
                                                     CY_MSCLP_CAPSENSE_KEY,
                                                     ptrCommonCfg->ptrChConfig->ptrHwContext);
                    if (CY_MSCLP_SUCCESS != msclpStatus)
                    {
                        capStatus = CY_CAPSENSE_STATUS_HW_BUSY;
                        break;
                    }

                    /* Disable ACTIVE domain interrupts  */
                    ptrHwBase->INTR_MASK = 0x00u;
                    (void)ptrHwBase->INTR_MASK;

                    /* Clear all pending interrupts */
                    ptrHwBase->INTR_LP = CY_CAPSENSE_MSCLP_INTR_LP_ALL_MSK;
                    (void)ptrHwBase->INTR_LP;

                    /* Update Comp CDAC switch ctrl and replace CSD mode struct with the MPSC configuration */
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
                        if (CY_CAPSENSE_HW_CONFIG_MPSC_SCANNING == configuration)
                        {
                            ptrHwBase->SW_SEL_CDAC_CO = ((CY_CAPSENSE_SM_MPSC_REG_SW_SEL_CDAC_CO_FLD_SW_COTCA << MSCLP_SW_SEL_CDAC_CO_SW_COTCA_Pos) |
                                (CY_CAPSENSE_SM_MPSC_REG_SW_SEL_CDAC_CO_FLD_SW_COCB << MSCLP_SW_SEL_CDAC_CO_SW_COCB_Pos)   |
                                (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COTV << MSCLP_SW_SEL_CDAC_CO_SW_COTV_Pos)   |
                                (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COTG << MSCLP_SW_SEL_CDAC_CO_SW_COTG_Pos)   |
                                (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COBG << MSCLP_SW_SEL_CDAC_CO_SW_COBG_Pos)   |
                                (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COBV << MSCLP_SW_SEL_CDAC_CO_SW_COBV_Pos));

                            if (CY_CAPSENSE_ENABLE == context->ptrInternalContext->csdCdacDitherEn)
                            {
                                ptrHwBase->MODE[CY_CAPSENSE_REG_MODE_CSD].SENSE_DUTY_CTL = CY_CAPSENSE_MPSC_RM_DITHER_SENSE_DUTY_CTL;
                                ptrHwBase->MODE[CY_CAPSENSE_REG_MODE_CSD].SW_SEL_CDAC_FL = CY_CAPSENSE_MPSC_RM_DITHER_SW_SEL_CDAC_FL;
                                ptrHwBase->MODE[CY_CAPSENSE_REG_MODE_CSD].SW_SEL_TOP     = CY_CAPSENSE_MPSC_RM_DITHER_SW_SEL_TOP;
                                ptrHwBase->MODE[CY_CAPSENSE_REG_MODE_CSD].SW_SEL_COMP    = CY_CAPSENSE_MPSC_RM_DITHER_SW_SEL_COMP;
                                ptrHwBase->MODE[CY_CAPSENSE_REG_MODE_CSD].SW_SEL_SH      = CY_CAPSENSE_MPSC_RM_DITHER_SW_SEL_SH;
                                ptrHwBase->MODE[CY_CAPSENSE_REG_MODE_CSD].SW_SEL_CMOD1   = CY_CAPSENSE_MPSC_RM_DITHER_SW_SEL_CMOD1;
                                ptrHwBase->MODE[CY_CAPSENSE_REG_MODE_CSD].SW_SEL_CMOD2   = CY_CAPSENSE_MPSC_RM_DITHER_SW_SEL_CMOD2;
                            }
                            else
                            {
                                ptrHwBase->MODE[CY_CAPSENSE_REG_MODE_CSD].SENSE_DUTY_CTL = CY_CAPSENSE_MPSC_RM_SENSE_DUTY_CTL;
                                ptrHwBase->MODE[CY_CAPSENSE_REG_MODE_CSD].SW_SEL_CDAC_FL = CY_CAPSENSE_MPSC_RM_SW_SEL_CDAC_FL;
                                ptrHwBase->MODE[CY_CAPSENSE_REG_MODE_CSD].SW_SEL_TOP     = CY_CAPSENSE_MPSC_RM_SW_SEL_TOP;
                                ptrHwBase->MODE[CY_CAPSENSE_REG_MODE_CSD].SW_SEL_COMP    = CY_CAPSENSE_MPSC_RM_SW_SEL_COMP;
                                ptrHwBase->MODE[CY_CAPSENSE_REG_MODE_CSD].SW_SEL_SH      = CY_CAPSENSE_MPSC_RM_SW_SEL_SH;
                                ptrHwBase->MODE[CY_CAPSENSE_REG_MODE_CSD].SW_SEL_CMOD1   = CY_CAPSENSE_MPSC_RM_SW_SEL_CMOD1;
                                ptrHwBase->MODE[CY_CAPSENSE_REG_MODE_CSD].SW_SEL_CMOD2   = CY_CAPSENSE_MPSC_RM_SW_SEL_CMOD2;
                            }
                        }
                    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED) */
                    break;
                case CY_CAPSENSE_HW_CONFIG_BIST_FUNCTIONALITY:
                    Cy_CapSense_SetIOsInDesiredState(CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO, 0u,
                                                     CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_EN, context);

