zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
/*******************************************************************************
* Function Name: Cy_CapSense_GetLfsrDitherLimit
****************************************************************************//**
*
* Determines the max allowed clock dithering variation for the specified
* parameters.
*
* \param snsClkDivider
* The divider value for the sense clock.
*
* \param snsClkDividerMin
* The minimal valid value of the sense clock divider.
*
* \param ditherLimitPercents
* Max dither in percentage, the actual clock dither should be limited with.
*
* \param lfsrScale
*  Number of bits to shift the LFSR output left before adding to SENSE_DIV.
*
* \return
*  Dintering variation in the number of Mod Clock cycles.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetLfsrDitherLimit(
                uint32_t snsClkDivider,
                uint32_t snsClkDividerMin,
                uint32_t ditherLimitPercents,
                uint32_t lfsrScale)
{
    uint32_t ditherLimitCycles;
    uint32_t ditherLimitCyclesMax;

    /*
    * Determine the dither limit in clock cycles for the specified Dither limit
    * in percents.
    */
    ditherLimitCycles = ((ditherLimitPercents * snsClkDivider) / CY_CAPSENSE_PERCENTAGE_100);
    ditherLimitCycles >>= lfsrScale;

    /* Determine MAX allowed dither in cycles for the specified Sense Clock divider. */
    ditherLimitCyclesMax = (snsClkDivider - snsClkDividerMin) / (1u << lfsrScale);

    /*
    * Determine the minimal value to eliminate violation of allowed Sense Clock
    * divider range.
    */
    if (ditherLimitCycles > ditherLimitCyclesMax)
    {
        ditherLimitCycles = ditherLimitCyclesMax;
    }

    return ditherLimitCycles;
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_EN)

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_SsSquareRoot16
****************************************************************************//**
*
* Calculates square root of the specified value.
*
* The specified value is unsigned 16-bit value. The square root is rounded up.
*
* \param value
* Specifies a value the square root should be taken from.
*
* \return
* Returns the square root of the specified value.
*
*******************************************************************************/
uint32_t Cy_CapSense_SsSquareRoot16(uint16_t value)
{
    uint32_t m = 0x4000u;
    uint32_t y = 0u;
    uint32_t b = 0u;
    uint32_t x = value;

    while (m != 0u)
    {
        b = y | m;
        y = y >> 1u;
        if (x >= b) {
            x = x - b;
            y = y | m;
        }
        m >>= 2u;
    }
    if (value > (y * y))
    {
        y++;
    }

    return y;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN) */


/*******************************************************************************
* Function Name: Cy_CapSense_IsSmarSenseWidgetValid
****************************************************************************//**
*
* Checks if widget is configured for SmartSense and supported by SmartSense.
*
* The following configurations are verified:
* * CSX sensing method is not supported
* * Liquid Level widget is not applicable
* * WBX sensing method is not supported
* * Multi-phase technique is not supported.
*
* \param ptrWdConfig
* Specifies the pointer to a widget configuration structure.
*
* \return
* Returns CY_CAPSENSE_STATUS_SUCCESS if widget is valid for SmartSense operation.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_IsSmarSenseWidgetValid(
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    cy_capsense_status_t autoTuneStatus = CY_CAPSENSE_STATUS_SUCCESS;

    (void)ptrWdConfig;

    /* Skip auto-tuning for CSX widgets */
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        if (CY_CAPSENSE_CSX_GROUP == ptrWdConfig->senseMethod)
        {
            autoTuneStatus = CY_CAPSENSE_STATUS_BAD_CONFIG;
        }
    #endif

    /* Skip auto-tuning for Liquid level widgets */
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_EN)
        if (((uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E == ptrWdConfig->wdType) &&
            ((uint8_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_E == ptrWdConfig->wdType))
        {
            autoTuneStatus = CY_CAPSENSE_STATUS_BAD_CONFIG;
        }
    #endif

    /* Skip auto-tuning for wheatstone bridge widgets */
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
        if ((uint8_t)CY_CAPSENSE_WD_WHEATSTONE_BRIDGE_E == ptrWdConfig->wdType)
        {
            autoTuneStatus = CY_CAPSENSE_STATUS_BAD_CONFIG;
        }
    #endif

    /* Skip auto-tuning for MPSC widgets*/
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
        if (1u != ptrWdConfig->mpOrder)
        {
            autoTuneStatus = CY_CAPSENSE_STATUS_BAD_CONFIG;
        }
    #endif

    return autoTuneStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SsAutoTune
****************************************************************************//**
*
* Performs the parameters auto-tuning for the optimal CAPSENSE&trade; operation when
* smart sensing algorithm is enabled.
*
* This function performs the following tasks:
* - Tune the Sense Clock optimal value.
* - Calculate the number of sub-conversions for the optimal finger capacitance.
*
* \note
* The function supposes final auto-calibration is called right after this
* function.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - Zero     - All the SmartSense-configured widgets are auto-tuned successfully.
* - Non-zero - Auto-tuning failed for any widget.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SsAutoTune(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t autoTuneStatus = CY_CAPSENSE_STATUS_SUCCESS;

