zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
    uint32_t wdIndex;
    uint32_t snsIndex;
    uint32_t scanSlotId;
    uint32_t numberSubConv;
    uint32_t rawCountMax;
    cy_stc_capsense_hw_smartsense_config_t autoTuneConfig;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    cy_stc_capsense_widget_context_t * ptrWdCxt;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;
    cy_stc_capsense_common_context_t * ptrCommonCxt = context->ptrCommonContext;
    const cy_stc_capsense_scan_slot_t * ptrScanSlots;

    #if (CY_CAPSENSE_SMARTSENSE_ISX_EN)
        volatile uint32_t * ptrSnsCtl;
        uint32_t rawCount;
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN)
        uint32_t cic2Decimation;
        uint32_t cic2Sample;

        MSCLP_Type * msclpBase = ptrCommonCfg->ptrChConfig->ptrHwBase;
    #endif

    ptrCommonCxt->status |= CY_CAPSENSE_MW_STATE_SMARTSENSE_MASK;

    /* Step #0: Checks if configuration is valid */
    if (ptrCommonCfg->counterMode != CY_CAPSENSE_COUNTER_MODE_SATURATE)
    {
        autoTuneStatus |= CY_CAPSENSE_STATUS_BAD_CONFIG;
    }
    else
    {

        /* Step #1: Sets the default parameters for preliminary scans */
        for (wdIndex = 0u; wdIndex < CY_CAPSENSE_TOTAL_WIDGET_COUNT; wdIndex++)
        {
            ptrWdCfg = &context->ptrWdConfig[wdIndex];
            ptrWdCxt = ptrWdCfg->ptrWdContext;
            ptrSnsCxt = ptrWdCfg->ptrSnsContext;

            /* Skip widgets not configured / not supported for SmartSense */
            if (CY_CAPSENSE_STATUS_SUCCESS != Cy_CapSense_IsSmarSenseWidgetValid(ptrWdCfg))
            {
                continue;
            }
            if (0u == Cy_CapSense_IsWidgetEnabled(wdIndex, context))
            {
                continue;
            }

            /* Handling CSD active widgets */
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_CSD_ACTIVE_HW_EN)
                if ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) && ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E != ptrWdCfg->wdType))
                {
                    /* Initializes SmartSense scan configuration */
                    ptrWdCxt->snsClkSource <<= CY_CAPSENSE_CLK_SOURCE_SMARTSENSE_POS;
                    ptrWdCxt->numSubConversions = CY_CAPSENSE_SMARTSENSE_CSD_PRELIMINARY_SCAN_NSUB;
                    ptrWdCxt->cdacRef = CY_CAPSENSE_SMARTSENSE_CSD_PRELIMINARY_SCAN_REF_CDAC;
                    ptrWdCxt->rowCdacRef = CY_CAPSENSE_SMARTSENSE_CSD_PRELIMINARY_SCAN_REF_CDAC;
                    ptrWdCxt->snsClk = CY_CAPSENSE_SMARTSENSE_CSD_PRELIMINARY_SCAN_SNS_CLK;
                    ptrWdCxt->rowSnsClk = CY_CAPSENSE_SMARTSENSE_CSD_PRELIMINARY_SCAN_SNS_CLK;

                    for (snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
                    {
                        ptrSnsCxt->cdacComp = 0u;
                        ptrSnsCxt++;
                    }
                }
            #endif

            /* Handling CSD low power widgets */
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_CSD_LP_HW_EN)
                if ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) && ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E == ptrWdCfg->wdType))
                {
                    /* Initializes SmartSense scan configuration */
                    ptrWdCxt->snsClkSource <<= CY_CAPSENSE_CLK_SOURCE_SMARTSENSE_POS;
                    ptrWdCxt->numSubConversions = CY_CAPSENSE_SMARTSENSE_CSD_PRELIMINARY_SCAN_NSUB;
                    ptrWdCxt->cdacRef = CY_CAPSENSE_SMARTSENSE_CSD_PRELIMINARY_SCAN_REF_CDAC;
                    ptrWdCxt->rowCdacRef = CY_CAPSENSE_SMARTSENSE_CSD_PRELIMINARY_SCAN_REF_CDAC;
                    ptrWdCxt->snsClk = CY_CAPSENSE_SMARTSENSE_CSD_PRELIMINARY_SCAN_SNS_CLK;
                    ptrWdCxt->rowSnsClk = CY_CAPSENSE_SMARTSENSE_CSD_PRELIMINARY_SCAN_SNS_CLK;

                    for (snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
                    {
                        ptrSnsCxt->cdacComp = 0u;
                        ptrSnsCxt++;
                    }
                }
            #endif

            /* Handling ISX active widgets */
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_ISX_ACTIVE_HW_EN)
                if ((CY_CAPSENSE_ISX_GROUP == ptrWdCfg->senseMethod) && ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E != ptrWdCfg->wdType))
                {
                    /* Initializes SmartSense scan configuration */
                    ptrWdCxt->snsClkSource <<= CY_CAPSENSE_CLK_SOURCE_SMARTSENSE_POS;
                    ptrWdCxt->numSubConversions = CY_CAPSENSE_SMARTSENSE_ISX_PRELIMINARY_SCAN_NSUB;
                    ptrWdCxt->cdacRef = CY_CAPSENSE_SMARTSENSE_ISX_PRELIMINARY_SCAN_REF_CDAC;
                    ptrWdCxt->rowCdacRef = CY_CAPSENSE_SMARTSENSE_ISX_PRELIMINARY_SCAN_REF_CDAC;
                    ptrWdCxt->snsClk = CY_CAPSENSE_SMARTSENSE_ISX_PRELIMINARY_SCAN_SNS_CLK;
                    ptrWdCxt->rowSnsClk = CY_CAPSENSE_SMARTSENSE_ISX_PRELIMINARY_SCAN_SNS_CLK;

                    for (snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
                    {
                        ptrSnsCxt->cdacComp = 0u;
                        ptrSnsCxt++;
                    }
                }
            #endif

            /* Handling ISX low power widgets */
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_ISX_LP_HW_EN)
                if ((CY_CAPSENSE_ISX_GROUP == ptrWdCfg->senseMethod) && ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E == ptrWdCfg->wdType))
                {
                    /* Initializes SmartSense scan configuration */
                    ptrWdCxt->snsClkSource <<= CY_CAPSENSE_CLK_SOURCE_SMARTSENSE_POS;
                    ptrWdCxt->numSubConversions = CY_CAPSENSE_SMARTSENSE_ISX_PRELIMINARY_SCAN_NSUB;
                    ptrWdCxt->cdacRef = CY_CAPSENSE_SMARTSENSE_ISX_PRELIMINARY_SCAN_REF_CDAC;
                    ptrWdCxt->rowCdacRef = CY_CAPSENSE_SMARTSENSE_ISX_PRELIMINARY_SCAN_REF_CDAC;
                    ptrWdCxt->snsClk = CY_CAPSENSE_SMARTSENSE_ISX_PRELIMINARY_SCAN_SNS_CLK;
                    ptrWdCxt->rowSnsClk = CY_CAPSENSE_SMARTSENSE_ISX_PRELIMINARY_SCAN_SNS_CLK;

                    for (snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
                    {
                        ptrSnsCxt->cdacComp = 0u;
                        ptrSnsCxt++;
                    }
                }
            #endif
        }

