zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
        autoTuneStatus |= Cy_CapSense_SsInitialize(context);
        autoTuneStatus |= Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING, context);

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN)
            /* Sets FILTER_MODE to CIC1 */
            msclpBase->FILTER_CTL &= ~MSCLP_FILTER_CTL_FILTER_MODE_Msk;
        #endif

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_FRM_START_EN)
            /* Clear the external start scan mode */
            msclpBase->CTL &= ~MSCLP_CTL_EXT_FRAME_START_MODE_Msk;
        #endif

        /* Step #2: Executes preliminary scans for all active widgets:
         * For CSD sensors a single scan is enough to define a sensor capacitance.
         * For ISX sensors a multiple scans needed to find valid operation frequency.
         */
        #if (CY_CAPSENSE_SMARTSENSE_ACTIVE_HW_EN)
            ptrScanSlots = context->ptrScanSlots;
            for (scanSlotId = 0u; scanSlotId < CY_CAPSENSE_SLOT_COUNT; scanSlotId++)
            {
                wdIndex = ptrScanSlots[scanSlotId].wdId;
                ptrWdCfg = &context->ptrWdConfig[wdIndex];

                /* Skip widgets not configured / not supported for SmartSense */
                if (CY_CAPSENSE_STATUS_SUCCESS != Cy_CapSense_IsSmarSenseWidgetValid(ptrWdCfg))
                {
                    continue;
                }
                if (0u == Cy_CapSense_IsWidgetEnabled(wdIndex, context))
                {
                    continue;
                }

                switch (ptrWdCfg->senseMethod)
                {
                    #if (CY_CAPSENSE_SMARTSENSE_CSD_ACTIVE_HW_EN)
                        case CY_CAPSENSE_CSD_GROUP:
                            autoTuneStatus |= Cy_CapSense_ScanSlotInternalCPU(CY_CAPSENSE_SNS_FRAME_ACTIVE, scanSlotId, context);
                            break;
                    #endif
                    #if (CY_CAPSENSE_SMARTSENSE_ISX_ACTIVE_HW_EN)
                        case CY_CAPSENSE_ISX_GROUP:
                            autoTuneStatus |= Cy_CapSense_ScanSlotInternalCPU(CY_CAPSENSE_SNS_FRAME_ACTIVE, scanSlotId, context);

                            /* Step #2a: Executes series of scans for ISX to find valid frequency */
                            ptrWdCxt = ptrWdCfg->ptrWdContext;
                            snsIndex = ptrScanSlots[scanSlotId].snsId;
                            ptrSnsCtl = &context->ptrSensorFrameContext[scanSlotId * CY_CAPSENSE_SENSOR_FRAME_SIZE + CY_CAPSENSE_SNS_CTL_INDEX];

                            while (CY_CAPSENSE_SMARTSENSE_ISX_SNS_CLK_MIN < ptrWdCxt->snsClk)
                            {
                                ptrWdCxt->snsClk -= CY_CAPSENSE_SMARTSENSE_ISX_SNS_CLK_STEP;
                                *ptrSnsCtl &= ~MSCLP_SNS_SNS_CTL_SENSE_DIV_Msk;
                                *ptrSnsCtl |= (uint32_t)ptrWdCxt->snsClk << MSCLP_SNS_SNS_CTL_SENSE_DIV_Pos;

                                autoTuneStatus |= Cy_CapSense_ScanSlotInternalCPU(CY_CAPSENSE_SNS_FRAME_ACTIVE, scanSlotId, context);
                                rawCountMax = (uint32_t)ptrWdCxt->snsClk * ptrWdCxt->numSubConversions;
                                /* Stop scanning if 95% is reached */
                                rawCountMax *= CY_CAPSENSE_SMARTSENSE_ISX_PRELIMINARY_SCAN_STOP;
                                rawCountMax /= CY_CAPSENSE_PERCENTAGE_100;
                                rawCount = ptrWdCfg->ptrSnsContext[snsIndex].raw;

                                if (rawCount >= rawCountMax)
                                {
                                    ptrWdCxt->snsClk += CY_CAPSENSE_SMARTSENSE_ISX_SNS_CLK_STEP;
                                    *ptrSnsCtl &= ~MSCLP_SNS_SNS_CTL_SENSE_DIV_Msk;
                                    *ptrSnsCtl |= (uint32_t)ptrWdCxt->snsClk << MSCLP_SNS_SNS_CTL_SENSE_DIV_Pos;
                                    autoTuneStatus |= Cy_CapSense_ScanSlotInternalCPU(CY_CAPSENSE_SNS_FRAME_ACTIVE, scanSlotId, context);
                                    break;
                                }
                            }

                            break;
                    #endif
                    default:
                        /* No action */
                        break;
                }
            }
        #endif

        /* Performs preliminary scans for all LP widgets if SmartSense is configured for them */
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_LP_HW_EN)
            ptrScanSlots = context->ptrLpScanSlots;
            for (scanSlotId = 0u; scanSlotId < CY_CAPSENSE_SLOT_LP_COUNT; scanSlotId++)
            {
                wdIndex = ptrScanSlots[scanSlotId].wdId;
                ptrWdCfg = &context->ptrWdConfig[wdIndex];

                /* Skip widgets not configured / not supported for SmartSense */
                if (CY_CAPSENSE_STATUS_SUCCESS != Cy_CapSense_IsSmarSenseWidgetValid(ptrWdCfg))
                {
                    continue;
                }
                if (0u == Cy_CapSense_IsWidgetEnabled(wdIndex, context))
                {
                    continue;
                }

                switch (ptrWdCfg->senseMethod)
                {
                    #if (CY_CAPSENSE_SMARTSENSE_CSD_LP_HW_EN)
                        case CY_CAPSENSE_CSD_GROUP:
                            autoTuneStatus |= Cy_CapSense_ScanSlotInternalCPU(CY_CAPSENSE_SNS_FRAME_LOW_POWER, scanSlotId, context);
                            break;
                    #endif
                    #if (CY_CAPSENSE_SMARTSENSE_ISX_LP_HW_EN)
                        case CY_CAPSENSE_ISX_GROUP:
                            autoTuneStatus |= Cy_CapSense_ScanSlotInternalCPU(CY_CAPSENSE_SNS_FRAME_LOW_POWER, scanSlotId, context);

                            /* Step #2a: Executes series of scans for ISX to find valid frequency */
                            ptrWdCxt = ptrWdCfg->ptrWdContext;
                            snsIndex = ptrScanSlots[scanSlotId].snsId;
                            ptrSnsCtl = &context->ptrSensorFrameLpContext[scanSlotId * CY_MSCLP_11_SNS_REGS + CY_CAPSENSE_FRM_LP_SNS_CTL_INDEX];

                            while (CY_CAPSENSE_SMARTSENSE_ISX_SNS_CLK_MIN <= ptrWdCxt->snsClk)
                            {
                                ptrWdCxt->snsClk -= CY_CAPSENSE_SMARTSENSE_ISX_SNS_CLK_STEP;
                                *ptrSnsCtl &= ~MSCLP_SNS_SNS_CTL_SENSE_DIV_Msk;
                                *ptrSnsCtl |= (uint32_t)ptrWdCxt->snsClk << MSCLP_SNS_SNS_CTL_SENSE_DIV_Pos;
                                autoTuneStatus |= Cy_CapSense_ScanSlotInternalCPU(CY_CAPSENSE_SNS_FRAME_LOW_POWER, scanSlotId, context);
                                rawCountMax = (uint32_t)ptrWdCxt->snsClk * ptrWdCxt->numSubConversions;
                                /* Stop scanning if 95% is reached */
                                rawCountMax *= CY_CAPSENSE_SMARTSENSE_ISX_PRELIMINARY_SCAN_STOP;
                                rawCountMax /= CY_CAPSENSE_PERCENTAGE_100;
                                rawCount = ptrWdCfg->ptrSnsContext[snsIndex].raw;

                                if (rawCount >= rawCountMax)
                                {
                                    ptrWdCxt->snsClk += CY_CAPSENSE_SMARTSENSE_ISX_SNS_CLK_STEP;
                                    *ptrSnsCtl &= ~MSCLP_SNS_SNS_CTL_SENSE_DIV_Msk;
                                    *ptrSnsCtl |= (uint32_t)ptrWdCxt->snsClk << MSCLP_SNS_SNS_CTL_SENSE_DIV_Pos;
                                    autoTuneStatus |= Cy_CapSense_ScanSlotInternalCPU(CY_CAPSENSE_SNS_FRAME_LOW_POWER, scanSlotId, context);
                                    break;
                                }
                            }

                            break;
                    #endif
                    default:
                        /* No action */
                        break;
                }
            }
        #endif


