zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
        /*
         * Step #3: Calculates sensor capacitances, sense clock dividers, and sub-conversion numbers depending on the configured
         * serial resistances, and finger capacitances for each sensor. Sets the configured modClk value in Hz for calculations.
         */
        #if (CY_CAPSENSE_IMO_FREQUENCY == CY_CAPSENSE_IMO_25_MHZ)
            autoTuneConfig.modClock = CY_CAPSENSE_IMO_CLK_25_MHZ * CY_CAPSENSE_CONVERSION_MEGA / context->ptrInternalContext->modClk;
        #elif (CY_CAPSENSE_IMO_FREQUENCY == CY_CAPSENSE_IMO_38_MHZ)
            autoTuneConfig.modClock = CY_CAPSENSE_IMO_CLK_38_MHZ * CY_CAPSENSE_CONVERSION_MEGA / context->ptrInternalContext->modClk;
        #else
            autoTuneConfig.modClock = CY_CAPSENSE_IMO_CLK_46_MHZ * CY_CAPSENSE_CONVERSION_MEGA / context->ptrInternalContext->modClk;
        #endif

        for (wdIndex = 0u; wdIndex < CY_CAPSENSE_TOTAL_WIDGET_COUNT; wdIndex++)
        {
            ptrWdCfg = &context->ptrWdConfig[wdIndex];

            /* Skip widgets not configured / not supported for SmartSense */
            if (CY_CAPSENSE_STATUS_SUCCESS != Cy_CapSense_IsSmarSenseWidgetValid(ptrWdCfg))
            {
                continue;
            }
            if (0u == Cy_CapSense_IsWidgetEnabled(wdIndex, context))
            {
                continue;
            }


            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_CSD_EN)
                if ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) &&
                    ((((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E != ptrWdCfg->wdType) &&
                    (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_CSD_ACTIVE_HW_EN)) ||
                    (((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E == ptrWdCfg->wdType) &&
                    (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_CSD_LP_HW_EN))))
                {
                    ptrWdCxt = ptrWdCfg->ptrWdContext;
                    autoTuneConfig.snsResistance = CY_CAPSENSE_SMARTSENSE_CSD_RESISTANCE_CONST;
                    autoTuneConfig.correctionCoeff = 0u;
                    autoTuneConfig.kRef0 = ptrWdCxt->snsClk;
                    autoTuneConfig.nSub0 = ptrWdCxt->numSubConversions;
                    autoTuneConfig.refCdac = ptrWdCxt->cdacRef;
                    autoTuneConfig.fingerCap = ptrWdCxt->fingerCap;

                    /* Find maximum rawcount to calculate max possible sensor clock frequency */
                    rawCountMax = 0u;
                    for (snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
                    {
                        if (rawCountMax < ptrWdCfg->ptrSnsContext[snsIndex].raw)
                        {
                            rawCountMax = ptrWdCfg->ptrSnsContext[snsIndex].raw;
                        }
                    }

                    autoTuneConfig.raw = (uint16_t)rawCountMax;
                    (void)Cy_CapSense_GetSmartSenseCapacitance(&autoTuneConfig);
                    autoTuneConfig.snsCapacitance /= ptrWdCfg->numChopCycles;
                    (void)Cy_CapSense_GetSmartSenseFrequencyDivider(&autoTuneConfig);

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_FREQUENCY_WIDGET_EN)
                        /* Checks for sub-widget */
                        if (0u != (ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_EN_MASK))
                        {
                            if (0u != (ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_WIDGET_FREQ_CH_1_MASK))
                            {
                                autoTuneConfig.kRef1 += CY_CAPSENSE_CSD_MFS_DIVIDER_OFFSET_F1;
                            }

                            if (0u != (ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_WIDGET_FREQ_CH_2_MASK))
                            {
                                autoTuneConfig.kRef1 += CY_CAPSENSE_CSD_MFS_DIVIDER_OFFSET_F2;
                            }
                        }
                    #endif

                    /* Configures widget sense clock divider by the calculated value */
                    ptrWdCxt->snsClk = autoTuneConfig.kRef1;
                    ptrWdCxt->rowSnsClk = autoTuneConfig.kRef1;
                    autoTuneConfig.refCdac = context->ptrInternalContext->intrCsdRawTarget;

                    /* Finds minimum rawcount starting from the previously defined max raw to define sensitivity properly */
                    for (snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
                    {
                        if (rawCountMax > ptrWdCfg->ptrSnsContext[snsIndex].raw)
                        {
                            rawCountMax = ptrWdCfg->ptrSnsContext[snsIndex].raw;
                        }
                    }
                    autoTuneConfig.raw = (uint16_t)rawCountMax;
                    (void)Cy_CapSense_GetSmartSenseCapacitance(&autoTuneConfig);
                    autoTuneConfig.snsCapacitance /= ptrWdCfg->numChopCycles;

                    (void)Cy_CapSense_GetSmartSenseNumSubconversions(&autoTuneConfig);

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN)

                        numberSubConv = autoTuneConfig.nSub1;

                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE)
                            /* Decreases scan duration per boost configuration */
                            numberSubConv /= (uint8_t)((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_BOOST_VAL_MASK) >> CY_CAPSENSE_CDAC_BOOST_VAL_POS);
                        #endif

                        rawCountMax = numberSubConv * autoTuneConfig.kRef1;

                        /* Finds Decimation Rate */
                        cic2Decimation = CY_CAPSENSE_MAX_DECIMATION_RATE;
                        if ((CY_CAPSENSE_MAX_DECIMATION_RATE * CY_CAPSENSE_MAX_DECIMATION_RATE) > (rawCountMax / ptrWdCfg->numChopCycles))
                        {
                            cic2Decimation = Cy_CapSense_SsSquareRoot16((uint16_t)(rawCountMax / ptrWdCfg->numChopCycles));
                        }
                        cic2Decimation--;

                        do
                        {
                            cic2Decimation++;

                            /* Finds valid CIC2 sample number with rounding down */
                            cic2Sample = Cy_CapSense_GetCIC2HwDivider(cic2Decimation);
                            if (cic2Sample > cic2Decimation)
                            {
                                cic2Sample >>= 1u;
                            }

                            /* Switches to full sample numbers */
                            cic2Sample++;

