zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
                            /* Finds Nsub considering quantization we have with CIC2 sample number with rounding up */
                            numberSubConv = ((cic2Decimation * cic2Sample) + (autoTuneConfig.kRef1 - 1u)) / autoTuneConfig.kRef1;
                        }
                        /* Checks if back-calculated CIC2 sample number is unchanged */
                        while ((cic2Sample != ((numberSubConv * autoTuneConfig.kRef1) / cic2Decimation)) &&
                                (cic2Decimation < CY_CAPSENSE_MAX_DECIMATION_RATE));

                        /* Calculates 75% of signal per desired finger capacitance */
                        ptrWdCxt->sigPFC = (uint16_t)(((cic2Decimation * cic2Decimation) * autoTuneConfig.sigPFC) / rawCountMax);
                        ptrWdCxt->cicRate = (uint8_t)cic2Decimation;
                        ptrWdCxt->numSubConversions = (uint16_t)numberSubConv;

                    #else /* #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN) */

                        numberSubConv = autoTuneConfig.nSub1;
                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE)
                            /* Decreases scan duration per boost configuration */
                            numberSubConv /= (uint8_t)((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_BOOST_VAL_MASK) >> CY_CAPSENSE_CDAC_BOOST_VAL_POS);
                        #endif

                        /* Limits Nsub to maximum possible value to avoid RawCount overflow */
                        rawCountMax = ((uint32_t)MSCLP_SNS_RESULT_FIFO_RD_RAW_COUNT_Msk >> MSCLP_SNS_RESULT_FIFO_RD_RAW_COUNT_Pos) / autoTuneConfig.kRef1;
                        if (numberSubConv > rawCountMax)
                        {
                            numberSubConv = rawCountMax;
                        }

                        /* Counts System Chopping */
                        numberSubConv /= ptrWdCfg->numChopCycles;

                        ptrWdCxt->numSubConversions = (uint16_t)numberSubConv;

                        numberSubConv *= ptrWdCfg->numChopCycles;
                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE)
                            /* Decreases scan duration per boost configuration */
                            numberSubConv *= (uint8_t)((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_BOOST_VAL_MASK) >> CY_CAPSENSE_CDAC_BOOST_VAL_POS);
                        #endif

                        /*
                        * numberSubConv contains real value including chopping and compensation.
                        * autoTuneConfig.nSub1 contains initially calculated value.
                        * So, correcting the initially calculated sensitivity.
                        */
                        ptrWdCxt->sigPFC = (uint16_t)((numberSubConv * autoTuneConfig.sigPFC) / autoTuneConfig.nSub1);

                    #endif /* #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN) */
                }
            #endif

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_ISX_EN)
                if ((CY_CAPSENSE_ISX_GROUP == ptrWdCfg->senseMethod) &&
                    ((((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E != ptrWdCfg->wdType) &&
                    (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_ISX_ACTIVE_HW_EN)) ||
                    (((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E == ptrWdCfg->wdType) &&
                    (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_ISX_LP_HW_EN))))
                {
                    ptrWdCxt = ptrWdCfg->ptrWdContext;
                    autoTuneConfig.snsResistance = CY_CAPSENSE_SMARTSENSE_ISX_RESISTANCE_CONST;
                    autoTuneConfig.fingerCap = ptrWdCxt->fingerCap;

                    /* Find maximum rawcount to calculate max possible sensor clock frequency */
                    rawCountMax = 0u;
                    for (snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
                    {
                        if (rawCountMax < ptrWdCfg->ptrSnsContext[snsIndex].raw)
                        {
                            rawCountMax = ptrWdCfg->ptrSnsContext[snsIndex].raw;
                        }
                    }

                    autoTuneConfig.raw = (uint16_t)rawCountMax;

                    (void)Cy_CapSense_GetSmartSenseIsxInductance(&autoTuneConfig);
                    autoTuneConfig.snsCapacitance /= ptrWdCfg->numChopCycles;

                    (void)Cy_CapSense_GetSmartSenseIsxFrequencyDivider(&autoTuneConfig);

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_FREQUENCY_WIDGET_EN)
                        /* Checks for sub-widget */
                        if (0u != (ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_EN_MASK))
                        {
                            if (0u != (ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_WIDGET_FREQ_CH_1_MASK))
                            {
                                autoTuneConfig.kRef1 += CY_CAPSENSE_CSD_MFS_DIVIDER_OFFSET_F1;
                            }

                            if (0u != (ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_WIDGET_FREQ_CH_2_MASK))
                            {
                                autoTuneConfig.kRef1 += CY_CAPSENSE_CSD_MFS_DIVIDER_OFFSET_F2;
                            }
                        }
                    #endif

                    /* Configures widget sense clock divider by the calculated value */
                    ptrWdCxt->snsClk = autoTuneConfig.kRef1;
                    ptrWdCxt->rowSnsClk = autoTuneConfig.kRef1;
                    autoTuneConfig.refCdac = context->ptrInternalContext->intrIsxRawTarget;

                    /* Finds minimum rawcount starting from the previously defined max raw to define sensitivity properly */
                    rawCountMax = CY_CAPSENSE_32_BIT_MASK;
                    for (snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
                    {
                        if (rawCountMax > ptrWdCfg->ptrSnsContext[snsIndex].raw)
                        {
                            rawCountMax = ptrWdCfg->ptrSnsContext[snsIndex].raw;
                        }
                    }
                    autoTuneConfig.raw = (uint16_t)rawCountMax;

