zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
                    (void)Cy_CapSense_GetSmartSenseIsxInductance(&autoTuneConfig);
                    autoTuneConfig.snsCapacitance /= ptrWdCfg->numChopCycles;

                    (void)Cy_CapSense_GetSmartSenseIsxNumSubconversions(&autoTuneConfig);

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN)
                        /******************************************************************************/
                        /* ISX SmartSense to be fixed */
                        /******************************************************************************/

                        numberSubConv = autoTuneConfig.nSub1;

                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE)
                            /* Decreases scan duration per boost configuration */
                            numberSubConv /= (uint8_t)((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_BOOST_VAL_MASK) >> CY_CAPSENSE_CDAC_BOOST_VAL_POS);
                        #endif

                        rawCountMax = numberSubConv * autoTuneConfig.kRef1;

                        /* Finds Decimation Rate */
                        cic2Decimation = CY_CAPSENSE_MAX_DECIMATION_RATE;
                        if ((CY_CAPSENSE_MAX_DECIMATION_RATE * CY_CAPSENSE_MAX_DECIMATION_RATE) > (rawCountMax / ptrWdCfg->numChopCycles))
                        {
                            cic2Decimation = Cy_CapSense_SsSquareRoot16((uint16_t)(rawCountMax / ptrWdCfg->numChopCycles));
                        }
                        cic2Decimation--;

                        do
                        {
                            cic2Decimation++;

                            /* Finds valid CIC2 sample number with rounding down */
                            cic2Sample = Cy_CapSense_GetCIC2HwDivider(cic2Decimation);
                            if (cic2Sample > cic2Decimation)
                            {
                                cic2Sample >>= 1u;
                            }

                            /* Switches to full sample numbers */
                            cic2Sample++;

                            /* Finds Nsub considering quantization we have with CIC2 sample number with rounding up */
                            numberSubConv = ((cic2Decimation * cic2Sample) + (autoTuneConfig.kRef1 - 1u)) / autoTuneConfig.kRef1;
                        }
                        /* Checks if back-calculated CIC2 sample number is unchanged */
                        while ((cic2Sample != ((numberSubConv * autoTuneConfig.kRef1) / cic2Decimation)) &&
                                (cic2Decimation < CY_CAPSENSE_MAX_DECIMATION_RATE));

                        /* Calculates 75% of signal per desired finger capacitance */
                        ptrWdCxt->sigPFC = (uint16_t)(((cic2Decimation * cic2Decimation) * autoTuneConfig.sigPFC) / rawCountMax);
                        ptrWdCxt->cicRate = (uint8_t)cic2Decimation;
                        ptrWdCxt->numSubConversions = (uint16_t)numberSubConv;

                    #else /* #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN) */

                        numberSubConv = autoTuneConfig.nSub1;
                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE)
                            /* Decreases scan duration per boost configuration */
                            numberSubConv /= (uint8_t)((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_BOOST_VAL_MASK) >> CY_CAPSENSE_CDAC_BOOST_VAL_POS);
                        #endif

                        /* Limits Nsub to maximum possible value to avoid RawCount overflow */
                        rawCountMax = ((uint32_t)MSCLP_SNS_RESULT_FIFO_RD_RAW_COUNT_Msk >> MSCLP_SNS_RESULT_FIFO_RD_RAW_COUNT_Pos) / autoTuneConfig.kRef1;
                        if (numberSubConv > rawCountMax)
                        {
                            numberSubConv = rawCountMax;
                        }

                        /* Counts System Chopping */
                        numberSubConv /= ptrWdCfg->numChopCycles;

                        ptrWdCxt->numSubConversions = (uint16_t)numberSubConv;

                        numberSubConv *= ptrWdCfg->numChopCycles;
                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE)
                            /* Decreases scan duration per boost configuration */
                            numberSubConv *= (uint8_t)((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_BOOST_VAL_MASK) >> CY_CAPSENSE_CDAC_BOOST_VAL_POS);
                        #endif

                        /*
                        * numberSubConv contains real value including chopping and compensation.
                        * autoTuneConfig.nSub1 contains initially calculated value.
                        * So, correcting the initially calculated sensitivity.
                        */
                        ptrWdCxt->sigPFC = (uint16_t)((numberSubConv * autoTuneConfig.sigPFC) / autoTuneConfig.nSub1);

                    #endif /* #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN) */
                }
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_ISX_EN) */
        }

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN)
            /* Restores FILTER_MODE to CIC2 */
            msclpBase->FILTER_CTL |= MSCLP_FILTER_CTL_FILTER_MODE_Msk;
        #endif

        /* Step #4: Assigns clock sources and restores project parameters */
        for (wdIndex = 0u; wdIndex < CY_CAPSENSE_TOTAL_WIDGET_COUNT; wdIndex++)
        {
            ptrWdCfg = &context->ptrWdConfig[wdIndex];
            /* Skip widgets not configured / not supported for SmartSense */
            if (CY_CAPSENSE_STATUS_SUCCESS != Cy_CapSense_IsSmarSenseWidgetValid(ptrWdCfg))
            {
                continue;
            }
            if (0u == Cy_CapSense_IsWidgetEnabled(wdIndex, context))
            {
                continue;
            }
            ptrWdCxt = ptrWdCfg->ptrWdContext;
            /* Reverts back original customer's settings */
            ptrWdCxt->snsClkSource = (uint8_t)(((uint32_t)ptrWdCxt->snsClkSource >> CY_CAPSENSE_CLK_SOURCE_SMARTSENSE_POS) &
                    ~CY_CAPSENSE_CLK_SOURCE_SMARTSENSE_MASK);
        }

