zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
        autoTuneStatus |= Cy_CapSense_SsInitialize(context);
    }

    ptrCommonCxt->status &= ~CY_CAPSENSE_MW_STATE_SMARTSENSE_MASK;

    return autoTuneStatus;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_EN) */


/*******************************************************************************
* Function Name: Cy_CapSense_TransferRawCounts
****************************************************************************//**
*
* Transfers raw counts for specified sensors from internal MSCLP IP RAM to the
* corresponding field in the structure where the sensor data is stored.
*
* \param startSlotId
* The slot ID transfer will be started from.
*
* \param numberSlots
* The number of slots will be transferred.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_TransferRawCounts(
                uint32_t startSlotId,
                uint32_t numberSlots,
                cy_stc_capsense_context_t * context)
{
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    MSCLP_Type * ptrHwBase = context->ptrCommonConfig->ptrChConfig->ptrHwBase;
    uint32_t lastSlot;
    uint32_t currSlot;
    uint32_t tmpRawCount;
    uint32_t wdIndex;
    uint32_t snsIndex;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_RC_HW_IIR_FILTER_EN)
        /* Initialize frame data pointer */
        uint32_t * ptrSensorFrame = &context->ptrSensorFrameContext[startSlotId * CY_CAPSENSE_SENSOR_FRAME_SIZE];

        /* Initialize sensor data pointer */
        __IOM uint32_t * ptrSensorData = &ptrHwBase->SNS.SENSOR_DATA[0u];
    #endif

    lastSlot = startSlotId + numberSlots - 1u;

    /* Reads the raw counts for last scan */
    for (currSlot = startSlotId; currSlot <= lastSlot; currSlot++)
    {
        wdIndex = context->ptrScanSlots[currSlot].wdId;
        if (0u != Cy_CapSense_IsWidgetEnabled(wdIndex, context))
        {
            snsIndex = context->ptrScanSlots[currSlot].snsId;
            tmpRawCount = ptrHwBase->SNS.RESULT_FIFO_RD;
            ptrSnsCxt = &context->ptrWdConfig[wdIndex].ptrSnsContext[snsIndex];
            ptrSnsCxt->status &= (uint8_t)~CY_CAPSENSE_SNS_OVERFLOW_MASK;
            if (MSCLP_SNS_RESULT_FIFO_RD_OVERFLOW_Msk == (tmpRawCount & MSCLP_SNS_RESULT_FIFO_RD_OVERFLOW_Msk))
            {
                ptrSnsCxt->status |= CY_CAPSENSE_SNS_OVERFLOW_MASK;
            }
            ptrSnsCxt->raw = (uint16_t)tmpRawCount;

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_RC_HW_IIR_FILTER_EN)
                if (0u != context->ptrInternalContext->hwIirInit)
                {
                    ptrSensorFrame[CY_CAPSENSE_SNS_HW_IIR_INDEX] &= ~CY_CAPSENSE_FRC_HW_IIR_FILTER_MASK;
                    ptrSensorFrame[CY_CAPSENSE_SNS_HW_IIR_INDEX] |= (ptrSensorData[CY_CAPSENSE_FRM_LP_SNS_LP_AOS_SNS_CTL3] & CY_CAPSENSE_FRC_HW_IIR_FILTER_MASK);
                }
                else
                {
                    ptrSensorFrame[CY_CAPSENSE_SNS_HW_IIR_INDEX] &= ~CY_CAPSENSE_FRC_HW_IIR_FILTER_MASK;
                    ptrSensorFrame[CY_CAPSENSE_SNS_HW_IIR_INDEX] |= (uint32_t)((uint32_t)ptrSnsCxt->raw << CY_CAPSENSE_BYTE_SHIFT);
                }
            #endif
        }
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_RC_HW_IIR_FILTER_EN)
            ptrSensorFrame += CY_CAPSENSE_SENSOR_FRAME_SIZE;
            ptrSensorData += CY_MSCLP_11_SNS_REGS;
        #endif
    }
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_TransferLpRawCounts
****************************************************************************//**
*
* Transfers raw counts for the scanned low power sensors from internal MSCLP IP
* RAM to the raw count history.
*
* \param startSlotId
* The slot ID transfer will be started from.
*
* \param numberSlots
* The number of slots will be transferred.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_TransferLpRawCounts(
                uint32_t startSlotId,
                uint32_t numberSlots,
                cy_stc_capsense_context_t * context)
{
    MSCLP_Type * ptrHwBase;
    uint32_t lastSlot;
    uint32_t currSlot;
    uint32_t tmpRawCount;
    uint32_t wdIndex;
    uint32_t fifoSize;
    uint32_t i;
    uint8_t wdSnsMethod;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    cy_stc_capsense_common_context_t * ptrCommonCxt = context->ptrCommonContext;
    cy_stc_capsense_lp_historic_context_t * ptrHistoricData = context->ptrLpHistoricContext;

    ptrHwBase = context->ptrCommonConfig->ptrChConfig->ptrHwBase;
    lastSlot = startSlotId + numberSlots - 1u;
    fifoSize = ptrHwBase->SNS.RESULT_FIFO_STATUS & MSCLP_SNS_RESULT_FIFO_STATUS_USED_Msk;

    /* Reset baseline after low power scan */
    if ((ptrHwBase->SNS.RESULT_FIFO_STATUS2 & MSCLP_SNS_RESULT_FIFO_STATUS2_FIFO_OVERFLOW_Msk) != 0uL)
    {
        ptrCommonCxt->lpScanSt = CY_CAPSENSE_SCAN_ST_BSLN_RESET_MSK;
    }
    else
    {
        /* Set valid mask for baseline */
        ptrCommonCxt->lpScanSt = CY_CAPSENSE_SCAN_ST_BSLN_RESET_MSK | CY_CAPSENSE_SCAN_ST_BSLN_VALID_MSK;
    }

    ptrCommonCxt->lpFirstSnsId = (uint8_t)startSlotId;
    ptrCommonCxt->lpSnsNumber = (uint8_t)numberSlots;
    ptrCommonCxt->lpNumFrame = (uint8_t)(fifoSize / numberSlots);

    /* Reads raw counts history from MSCv3LP HW internal RAM to pop the FIFO */
    for (i = 0u; i < ptrCommonCxt->lpNumFrame; i++)
    {
        for (currSlot = startSlotId; currSlot <= lastSlot; currSlot++)
        {
            tmpRawCount = ptrHwBase->SNS.RESULT_FIFO_RD & MSCLP_SNS_RESULT_FIFO_RD_RAW_COUNT_Msk;

            wdIndex = context->ptrLpScanSlots[currSlot].wdId;
            if (0u != Cy_CapSense_IsWidgetEnabled(wdIndex, context))
            {
                ptrWdCfg = &context->ptrWdConfig[wdIndex];
                wdSnsMethod = ptrWdCfg->senseMethod;

