zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
                if ((CY_CAPSENSE_CSX_GROUP == wdSnsMethod) ||
                    (CY_CAPSENSE_ISX_GROUP == wdSnsMethod))
                {
                    /* Limit raw counts */
                    if (tmpRawCount < ptrWdCfg->ptrWdContext->maxRawCount)
                    {
                        /* Invert raw counts for CSX/ISX widgets */
                        tmpRawCount = (ptrWdCfg->ptrWdContext->maxRawCount - tmpRawCount);
                    }
                    else
                    {
                        tmpRawCount = 0u;
                    }
                }

                *ptrHistoricData = (cy_stc_capsense_lp_historic_context_t)tmpRawCount;
            }
            ptrHistoricData++;
        }
    }
}
#endif /* #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)) */


/*******************************************************************************
* Function Name: Cy_CapSense_WaitMrssStatusChange
****************************************************************************//**
*
* Waits till end of MRSS status is changed or till the provided timeout.
*
* \param timeout
* Watchdog timeout in microseconds.
*
* \param mrssStatus
* MRSS status to be set
* - CY_CAPSENSE_MRSS_TURN_ON - MRSS should be turned on
* - CY_CAPSENSE_MRSS_TURN_OFF - MRSS should be turned off
* - CY_CAPSENSE_MRSS_IMO_TURN_ON - MRSS_IMO should be turned on
* - CY_CAPSENSE_MRSS_IMO_TURN_OFF - MRSS_IMO should be turned off
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_TIMEOUT       - The software watchdog timeout occurred
*                                      during the wait, the MRSS status change was not
*                                      completed.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_WaitMrssStatusChange(
                uint32_t timeout,
                uint32_t mrssStatus,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t status = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t waitTime = timeout;
    uint32_t mrssMask = MSCLP_MRSS_STATUS_MRSS_UP_Msk;
    uint32_t mrssStatusLocal = mrssStatus;

    if ((CY_CAPSENSE_MRSS_IMO_TURN_ON == mrssStatus) || (CY_CAPSENSE_MRSS_IMO_TURN_OFF == mrssStatus))
    {
        mrssMask = MSCLP_MRSS_STATUS_IMO_UP_Msk;
        mrssStatusLocal = (mrssStatusLocal & 0x1u) << MSCLP_MRSS_STATUS_IMO_UP_Pos;
    }

    while (mrssStatusLocal == (context->ptrCommonConfig->ptrChConfig->ptrHwBase->MRSS_STATUS & mrssMask))
    {
        if (0uL == waitTime)
        {
            status = CY_CAPSENSE_STATUS_TIMEOUT;
            break;
        }
        /* Delay for 1us */
        Cy_SysLib_DelayUs(1u);
        waitTime--;
    }

    return status;
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_RC_HW_IIR_FILTER_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_ScanInitializeHwIirAllSlots
****************************************************************************//**
*
* Initializes (or re-initializes) the hardware IIR filter for all slots.
*
* This function initiates the blocking scan of all slots to initialize
* the hardware IIR filter. This should be done before firmware filters and 
* baselines initialization.
*
* Calling this function is accompanied by:
* * Cy_CapSense_InitializeAllFilters()
* * Cy_CapSense_InitializeAllBaselines()
* * Cy_CapSense_InitializeAllStatuses()
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_HW_BUSY          - The HW is busy with the previous scan.
* - CY_CAPSENSE_STATUS_TIMEOUT          - The software watchdog timeout occurred
*                                         during the scan, the scan was not completed.
* - CY_CAPSENSE_STATUS_MIXED_SENSORS    - The requested sensors types can't be scanned
*                                         in one frame (in autonomous mode).
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanInitializeHwIirAllSlots(
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t result;

    result = Cy_CapSense_ScanInitializeHwIirSlots(0u, CY_CAPSENSE_SLOT_COUNT, context);

    return result;
}


/*******************************************************************************
* Function Name: Cy_CapSense_ScanInitializeHwIirSlots
****************************************************************************//**
*
* Initializes (or re-initializes) the hardware IIR filter for specified slots.
*
* This function initiates the blocking scan of specified slots to initialize
* the hardware IIR filter. This should be done before firmware filters and
* baselines initialization.
*
* Calling this function is accompanied by:
* * Cy_CapSense_InitializeWidgetFilter()
* * Cy_CapSense_InitializeWidgetBaseline()
* * Cy_CapSense_InitializeWidgetStatus()
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param startSlotId
* The slot ID initialization will be started from.
*
* \param numberSlots
* The number of slots will be initialized.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_HW_BUSY          - The HW is busy with the previous scan.
* - CY_CAPSENSE_STATUS_TIMEOUT          - The software watchdog timeout occurred
*                                         during the scan, the scan was not completed.
* - CY_CAPSENSE_STATUS_MIXED_SENSORS    - The requested sensors types can't be scanned
*                                         in one frame (in autonomous mode).
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanInitializeHwIirSlots(
                uint32_t startSlotId,
                uint32_t numberSlots,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t result = CY_CAPSENSE_STATUS_SUCCESS;
    MSCLP_Type * ptrHwBase = context->ptrCommonConfig->ptrChConfig->ptrHwBase;
    uint32_t watchdog = 0u;
    uint32_t slotIdx;

    /* Disable HW IP to allow MRSS operations */
    ptrHwBase->CTL &= (~MSCLP_CTL_ENABLED_Msk);

    /* Check for system VDDA value and enable PUMP if VDDA is less then threshold */
    #if (CY_MSCLP_VDDA_PUMP_TRESHOLD > CY_CAPSENSE_VDDA_MV)
        ptrHwBase->PUMP_CTL = MSCLP_PUMP_CTL_PUMP_MODE_Msk;
    #else
        ptrHwBase->PUMP_CTL = 0x00u;
    #endif

    /* Check if IMO is running */
    if (0u == (context->ptrCommonConfig->ptrChConfig->ptrHwBase->MRSS_STATUS & MSCLP_MRSS_STATUS_MRSS_UP_Msk))
    {
        /* Enable only REF and IMO to provide access to the SNS_STC registers */
        ptrHwBase->MRSS_CMD = MSCLP_MRSS_CMD_MRSS_START_Msk;
        (void)Cy_CapSense_WaitMrssStatusChange(
                        CY_MSCLP_CLK_LF_PERIOD_MAX * CY_MSCLP_MRSS_TIMEOUT_SMALL,
                        CY_CAPSENSE_MRSS_TURN_ON, context);
    }

    /* Initialize the hardware raw count filter */
    ptrHwBase->SNS.CE_INIT_CTL |= MSCLP_SNS_CE_INIT_CTL_SENSOR_INIT_Msk;

    result |= Cy_CapSense_ScanSlots(startSlotId, numberSlots, context);

    for (slotIdx = startSlotId; slotIdx < (startSlotId + numberSlots); slotIdx++)
    {
        watchdog += Cy_CapSense_GetScanWatchdogTime(context->ptrScanSlots[slotIdx].wdId, slotIdx, context);
    }
    result |= Cy_CapSense_WaitEndScan(watchdog, context);

    return result;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_RC_HW_IIR_FILTER_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_GetCIC2SamplesMax
****************************************************************************//**
*
* This internal function determines the MAX number of CIC2 samples for specified
* decimation rate that can be accumulated in the internal CIC2 HW register
* with no overflow.
*
* \param cic2Rate
* CIC2 decimation rate.
*
* \return
* The MAX allowed number of CIC2 samples.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetCIC2SamplesMax(
                uint32_t cic2Rate)
{
    uint32_t retVal;

    retVal = CY_CAPSENSE_CIC2_ACC_MAX_VAL / (cic2Rate * cic2Rate);

    return retVal;
}


