zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
/*******************************************************************************
* Function Name: Cy_CapSense_GetCIC2HwDivider
****************************************************************************//**
*
* This internal function determines the value of the divider that will be
* applied to the data, accumulated by the CIC2 HW for the specified number of
* samples.
*
* \param cic2Samples
* The number of valid (FullNumber - 1) CIC2 samples for the specified sensing
* parameters. This value can be obtained by using the Cy_CapSense_GetCIC2SamplesNum
* function.
*
* \return
* The CIC2 HW divider value.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetCIC2HwDivider(
                uint32_t cic2Samples)
{
    uint32_t cic2Divider;

    cic2Divider = 1uL << Cy_CapSense_GetCIC2HwShift(cic2Samples);

    if (CY_CAPSENSE_CIC2_DIVIDER_MAX < cic2Divider)
    {
        cic2Divider = CY_CAPSENSE_CIC2_DIVIDER_MAX;
    }

    return cic2Divider;
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetCIC2HwShift
****************************************************************************//**
*
* This internal function determines the value of the shift that will be
* applied to the data, accumulated by the CIC2 HW for the specified number of
* samples.
*
* \param cic2Samples
* The number of valid (FullNumber - 1) CIC2 samples for the specified sensing
* parameters. This value can be obtained by using the Cy_CapSense_GetCIC2SamplesNum
* function.
*
* \return
* The CIC2 HW Shift value.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetCIC2HwShift(
                uint32_t cic2Samples)
{
    uint32_t cic2Shift = 0u;

    while (cic2Samples > (1uL << cic2Shift))
    {
        cic2Shift++;
    }

    if (CY_CAPSENSE_CIC2_SHIFT_MAX < cic2Shift)
    {
        cic2Shift = CY_CAPSENSE_CIC2_SHIFT_MAX;
    }

    return cic2Shift;
}


#if (CY_CAPSENSE_CIC2_FILTER_AUTO_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_InitializeCic2Shift
****************************************************************************//**
*
* Performs the auto-selection of CIC2 HW filter Shift parameter.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS      - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_TIMEOUT      - A timeout reached during the scan time measurement.
* - CY_CAPSENSE_STATUS_BAD_PARAM    - Not valid input parameter.
* - CY_CAPSENSE_STATUS_HW_BUSY      - The MSCLP HW block is busy and cannot be
*                                     switched to another mode.
* - CY_CAPSENSE_STATUS_BAD_CONFIG   - The parameters are out of specified range.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_InitializeCic2Shift(
                cy_stc_capsense_context_t * context)
{
    uint32_t wdIndex;
    uint32_t scanSlotId;
    uint32_t tmpVal;
    uint32_t tmpShift;
    uint32_t tmpSample;
    cy_capsense_status_t retVal = CY_CAPSENSE_STATUS_SUCCESS;

    cy_stc_capsense_widget_context_t * ptrWdCxt;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = context->ptrWdConfig;

    for (wdIndex = 0u; wdIndex < CY_CAPSENSE_TOTAL_WIDGET_COUNT; wdIndex++)
    {
        if (0u != Cy_CapSense_IsWidgetEnabled(wdIndex, context))
        {
            ptrWdCxt = ptrWdCfg->ptrWdContext;

            if (0u != (ptrWdCxt->cicShift & CY_CAPSENSE_CIC_AUTO_MASK))
            {
                scanSlotId = ptrWdCfg->firstSlotId;

                /* Obtain the scan duration in terms of Mod Clock cycles. */
                retVal |= Cy_CapSense_ExecuteSaturatedScan(&tmpVal, wdIndex, scanSlotId, CY_CAPSENSE_SATURATED_SCAN_TIME, context);
                /* Obtain the number of valid (FullNumber - 1) CIC2 samples */
                tmpSample = (tmpVal / ptrWdCxt->cicRate) - 1u;
                tmpShift = Cy_CapSense_GetCIC2HwShift(tmpSample);
                tmpVal >>= tmpShift;
                tmpVal *= ptrWdCfg->numChopCycles;
                if (CY_CAPSENSE_16_BIT_MASK < tmpVal)
                {
                    tmpShift++;
                }
                ptrWdCxt->cicShift = (uint8_t)tmpShift;
                ptrWdCxt->cicShift |= CY_CAPSENSE_CIC_AUTO_MASK;
            }

            #if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || \
                (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
                if ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) &&
                    (((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrWdCfg->wdType) ||
                    ((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdCfg->wdType)))
                {
                    if (0u != (ptrWdCxt->rowCicShift & CY_CAPSENSE_CIC_AUTO_MASK))
                    {
                        scanSlotId = (uint32_t)ptrWdCfg->firstSlotId + ptrWdCfg->numCols;

                        /* Obtain the scan duration in terms of Mod Clock cycles. */
                        retVal |= Cy_CapSense_ExecuteSaturatedScan(&tmpVal, wdIndex, scanSlotId, CY_CAPSENSE_SATURATED_SCAN_TIME, context);
                        /* Obtain the number of valid (FullNumber - 1) CIC2 samples */
                        tmpSample = (tmpVal / ptrWdCxt->cicRate) - 1u;
                        tmpShift = Cy_CapSense_GetCIC2HwShift(tmpSample);
                        tmpVal >>= tmpShift;
                        tmpVal *= ptrWdCfg->numChopCycles;
                        if (CY_CAPSENSE_16_BIT_MASK < tmpVal)
                        {
                            tmpShift++;
                        }
                        ptrWdCxt->rowCicShift = (uint8_t)tmpShift;
                        ptrWdCxt->rowCicShift |= CY_CAPSENSE_CIC_AUTO_MASK;
                    }
                }
            #endif
        }
        ptrWdCfg++;
    }

    /* Update Active frame configuration with new calculated CIC2 shift value. */
    Cy_CapSense_GenerateAllSensorConfig(CY_CAPSENSE_SNS_FRAME_ACTIVE, context);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        /* Update LP frame configuration with new calculated CIC2 shift value. */
        Cy_CapSense_GenerateAllSensorConfig(CY_CAPSENSE_SNS_FRAME_LOW_POWER, context);
    #endif /* CY_CAPSENSE_LP_EN */

