zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
    /* Resetting the HW configuration in order to trigger the base frame initialization in scope of the
     * next  Cy_CapSense_SwitchHwConfiguration() function call with the desired HW configuration.
     */
    if (CY_CAPSENSE_STATUS_SUCCESS == retVal)
    {
        retVal |= Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT, context);
    }

    if (CY_CAPSENSE_STATUS_SUCCESS == retVal)
    {
        retVal |= Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING, context);
    }

    return retVal;
}
#endif /* #if (CY_CAPSENSE_CIC2_FILTER_AUTO_EN) */


#if (CY_CAPSENSE_CIC_RATE_MODE_AUTO_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_InitializeCic2Rate
****************************************************************************//**
*
* Performs the auto-selection of CIC2 HW filter Decimation Rate parameter.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS      - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_TIMEOUT      - A timeout reached during the scan time measurement.
* - CY_CAPSENSE_STATUS_BAD_PARAM    - Not valid input parameter.
* - CY_CAPSENSE_STATUS_HW_BUSY      - The MSCLP HW block is busy and cannot be
*                                     switched to another mode.
* - CY_CAPSENSE_STATUS_BAD_CONFIG   - The parameters are out of specified range.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_InitializeCic2Rate(
                cy_stc_capsense_context_t * context)
{
    uint32_t wdIndex;
    uint32_t scanSlotId;
    uint32_t sampleOverflow;
    uint32_t scanTime;
    uint32_t tmpVal;
    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_MATRIX_EN) || \
        (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_TOUCHPAD_EN))
        uint32_t tmpValRow;
    #endif
    cy_capsense_status_t retVal = CY_CAPSENSE_STATUS_SUCCESS;

    cy_stc_capsense_widget_context_t * ptrWdCxt;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = context->ptrWdConfig;

    for (wdIndex = 0u; wdIndex < CY_CAPSENSE_TOTAL_WIDGET_COUNT; wdIndex++)
    {
        if (0u != Cy_CapSense_IsWidgetEnabled(wdIndex, context))
        {
            if ((CY_CAPSENSE_CIC_RATE_MODE_AUTO == ptrWdCfg->cicRateMode))
            {
                ptrWdCxt = ptrWdCfg->ptrWdContext;
                scanSlotId = ptrWdCfg->firstSlotId;

                /* Obtain the scan duration in terms of Mod Clock cycles */
                retVal |= Cy_CapSense_ExecuteSaturatedScan(&tmpVal, wdIndex, scanSlotId, CY_CAPSENSE_SATURATED_SCAN_TIME, context);

                #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_MATRIX_EN) || \
                    (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_TOUCHPAD_EN))
                    if ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) &&
                        (((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrWdCfg->wdType) ||
                        ((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdCfg->wdType)))
                    {
                        scanSlotId = (uint32_t)ptrWdCfg->firstSlotId + ptrWdCfg->numCols;
                        /* Obtain the scan duration in terms of Mod Clock cycles. */
                        retVal |= Cy_CapSense_ExecuteSaturatedScan(&tmpValRow, wdIndex, scanSlotId, CY_CAPSENSE_SATURATED_SCAN_TIME, context);
                        if (tmpValRow < tmpVal)
                        {
                            tmpVal = tmpValRow;
                        }
                    }
                #endif

                scanTime = tmpVal;

                /* Phase 1 */
                tmpVal /= (CY_CAPSENSE_CIC2_MIN_VALID_SAMPLES + 1u);
                if (0u == tmpVal)
                {
                    tmpVal = 1u;
                }
                if (CY_CAPSENSE_MAX_DECIMATION_RATE > tmpVal)
                {
                    ptrWdCxt->cicRate = (uint8_t)tmpVal;
                }
                else
                {
                    /* Phase 2 */
                    tmpVal = CY_CAPSENSE_MAX_DECIMATION_RATE;
                    sampleOverflow = (scanTime / CY_CAPSENSE_MAX_DECIMATION_RATE) - 1u;

                    if ((CY_CAPSENSE_CIC2_MAX_VALID_SAMPLES / ptrWdCfg->numChopCycles) >= sampleOverflow)
                    {
                        ptrWdCxt->cicRate = (uint8_t)CY_CAPSENSE_MAX_DECIMATION_RATE;
                    }
                    else
                    {
                        /* Phase 3 */
                        ptrWdCxt->cicRate = (uint8_t)(((uint32_t)CY_CAPSENSE_25_BIT_MASK / ptrWdCfg->numChopCycles) / (scanTime - 1u));
                        if (0u == ptrWdCxt->cicRate)
                        {
                            retVal = CY_CAPSENSE_STATUS_BAD_CONFIG;
                            ptrWdCxt->cicRate = 1u;
                        }
                    }
                }
            }
        }
        ptrWdCfg++;
    }

    /* Update Active frame configuration with new calculated CIC2 decimation value. */
    Cy_CapSense_GenerateAllSensorConfig(CY_CAPSENSE_SNS_FRAME_ACTIVE, context);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        /* Update LP frame configuration with new calculated CIC2 decimation value. */
        Cy_CapSense_GenerateAllSensorConfig(CY_CAPSENSE_SNS_FRAME_LOW_POWER, context);
    #endif /* CY_CAPSENSE_LP_EN */

    /* Resetting the HW configuration in order to trigger the base frame initialization in scope of the
     * next  Cy_CapSense_SwitchHwConfiguration() function call with the desired HW configuration.
     */
    if (CY_CAPSENSE_STATUS_SUCCESS == retVal)
    {
        retVal |= Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT, context);
    }

    if (CY_CAPSENSE_STATUS_SUCCESS == retVal)
    {
        retVal |= Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING, context);
    }

    return retVal;
}
#endif /* (CY_CAPSENSE_CIC2_FILTER_AUTO_EN) */
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN)) */


