zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
/*******************************************************************************
* Function Name: Cy_CapSense_RepeatScan
****************************************************************************//**
*
* Triggers the scan of the frame, which is already configured in the MSCLP
* HW block. The function is available only for the single-channel solution.
*
* The function repeats the frame scan last configured and
* triggered by the Cy_CapSense_ScanSlots() or Cy_CapSense_ScanLpSlots()
* functions.
*
* The function can be used only with the following limitations:
* - the previous scan is completed;
* - the scan frame to repeat consists of less than 37 sensors;
* - there were regular scans previously performed, not BIST or calibration
*   or SmartSense scans.
*
* The function can be used as many times as needed.
*
* \note
* The function is available only for the fifth-generation
* low power CAPSENSE&trade;.
*
* \param context
* The pointer to the CAPSENSE&trade; context
* structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed
*                                         successfully.
* - CY_CAPSENSE_STATUS_INVALID_STATE    - The previous scan is not completed or
*                                         it was a specific scan (BIST,
*                                         SmartSense, etc.) and the MSCLP HW
*                                         configuration was changed.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_RepeatScan(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_INVALID_STATE;

    if ((CY_CAPSENSE_BUSY != Cy_CapSense_IsBusy(context)) &&
        (CY_CAPSENSE_ENABLE == context->ptrInternalContext->repeatScanEn))
    {
        Cy_CapSense_SetBusyFlags(context);
        context->ptrInternalContext->currentSlotIndex = context->ptrInternalContext->startSlotIndex;
        context->ptrCommonConfig->ptrChConfig->ptrHwBase->CTL |= MSCLP_CTL_ENABLED_Msk;

        #if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_EXT_FRM_START_EN)
            context->ptrCommonConfig->ptrChConfig->ptrHwBase->WAKEUP_CMD = MSCLP_WAKEUP_CMD_START_FRAME_AOS_Msk;
        #endif

        capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    }

    return capStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetupCpuOperatingMode
****************************************************************************//**
*
* Configures the MSCLP HW block for operation in the CPU operating mode.
* Use the Cy_CapSense_StartCpuScan() function to trigger scan in the CPU operating
* mode. The end of the scan in the CPU operating mode can be detected by using the
* Cy_CapSense_WaitEndOfCpuScan() function.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetupCpuOperatingMode(cy_stc_capsense_context_t * context)
{
    MSCLP_Type * ptrHwBase = context->ptrCommonConfig->ptrChConfig->ptrHwBase;

    /* Disable HW IP to allow MRSS operations */
    ptrHwBase->CTL &= (~MSCLP_CTL_ENABLED_Msk);

    /* Check for system VDDA value and enable PUMP if VDDA is less then threshold */
    #if (CY_MSCLP_VDDA_PUMP_TRESHOLD > CY_CAPSENSE_VDDA_MV)
        ptrHwBase->PUMP_CTL = MSCLP_PUMP_CTL_PUMP_MODE_Msk;
    #else
        ptrHwBase->PUMP_CTL = 0x00u;
    #endif

    /* Check if IMO is running for the calibration operation */
    if (0u == (context->ptrCommonConfig->ptrChConfig->ptrHwBase->MRSS_STATUS & MSCLP_MRSS_STATUS_MRSS_UP_Msk))
    {
        /* Enable only REF and IMO to provide access to the SNS_STC registers */
        ptrHwBase->MRSS_CMD = MSCLP_MRSS_CMD_MRSS_START_Msk;
        (void)Cy_CapSense_WaitMrssStatusChange(
                        CY_MSCLP_CLK_LF_PERIOD_MAX * CY_MSCLP_MRSS_TIMEOUT_SMALL,
                        CY_CAPSENSE_MRSS_TURN_ON, context);
    }

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_FRM_START_EN)
        /* Clear the external start scan mode */
        ptrHwBase->CTL &= ~MSCLP_CTL_EXT_FRAME_START_MODE_Msk;
    #endif

    /* Enable HW IP to allow a scan frame start */
    ptrHwBase->CTL |= MSCLP_CTL_ENABLED_Msk;

    /* Disable HW processing */
    ptrHwBase->CE_CTL = 0x00u;

    /* Disable all interrupts */
    ptrHwBase->INTR_LP_MASK = 0x00u;
    (void)ptrHwBase->INTR_LP_MASK;

    /* Clear all pending interrupts */
    ptrHwBase->INTR_LP = CY_CAPSENSE_MSCLP_INTR_LP_ALL_MSK;
    (void)ptrHwBase->INTR_LP;
    ptrHwBase->INTR = CY_CAPSENSE_MSCLP_INTR_ALL_MSK;
    (void)ptrHwBase->INTR;

    /* Set CPU operating mode */
    context->ptrInternalContext->operatingMode = CY_CAPSENSE_CTL_OPERATING_MODE_CPU;
    CY_REG32_CLR_SET(ptrHwBase->CTL, MSCLP_CTL_OPERATING_MODE, CY_CAPSENSE_CTL_OPERATING_MODE_CPU);

    /* Set raw counts to store to FIFO */
    CY_REG32_CLR_SET(ptrHwBase->SCAN_CTL1, MSCLP_SCAN_CTL1_RC_STORE_EN, CY_CAPSENSE_ENABLE);
}


/*******************************************************************************
* Function Name: Cy_CapSense_StartCpuScan
****************************************************************************//**
*
* Sets configuration of sensor frame registers of the MSCLP HW block and
* starts the scan. The end of the scan in the CPU operating mode can be detected
* by using the Cy_CapSense_WaitEndOfCpuScan() function.
*
* \note Call the Cy_CapSense_SetupCpuOperatingMode() function to switch the
* MSCLP HW block to the CPU operating mode before triggering CPU scan by using
* the Cy_CapSense_StartCpuScan() routine.
*
* \param scanConfig
* The pointer to a scan configuration structure.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_StartCpuScan(const uint32_t * scanConfig, cy_stc_capsense_context_t * context)
{
    MSCLP_Type * ptrHwBase = context->ptrCommonConfig->ptrChConfig->ptrHwBase;

