zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
    /* Enable HW IP */
    ptrHwBase->CTL |= MSCLP_CTL_ENABLED_Msk;

    /* Clear all pending interrupts */
    ptrHwBase->INTR_LP = CY_CAPSENSE_MSCLP_INTR_LP_ALL_MSK;
    (void)ptrHwBase->INTR_LP;
    ptrHwBase->INTR = CY_CAPSENSE_MSCLP_INTR_ALL_MSK;
    (void)ptrHwBase->INTR;

    /* Set sensor config registers (frame) */
    Cy_MSCLP_ConfigureScan(ptrHwBase, CY_MSCLP_6_SNS_REGS, scanConfig);

    /* Configure the last slot */
    ptrHwBase->SNS.SNS_CTL |= MSCLP_SNS_SNS_CTL_LAST_Msk | MSCLP_SNS_SNS_CTL_VALID_Msk;

    /* Start scanning with START_SCAN */
    ptrHwBase->SNS.SNS_CTL |= MSCLP_SNS_SNS_CTL_START_SCAN_Msk;

    /* Start FSM with START_FRAME */
    ptrHwBase->SNS.FRAME_CMD = MSCLP_SNS_FRAME_CMD_START_FRAME_Msk;
}


/*******************************************************************************
* Function Name: Cy_CapSense_WaitEndOfCpuScan
****************************************************************************//**
*
* This internal function checks for the scan status. If the scan ends before
* the software watch-dog triggering, the function returns a non-zero watch-dog
* cycles number. If the software watch-dog triggers during the scan,
* the function returns zero.
*
* Use the Cy_CapSense_GetScanWatchdogTime() or Cy_CapSense_CalcSampleWatchdogTime()
* function to calculate the watchdog time in microseconds for the scan with the
* specified parameters.
*
* \param watchdogTime
* A watch-dog time interval in microseconds.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns watch-dog counter. If it is equal to zero, it means timeout happened.
*
*******************************************************************************/
uint32_t Cy_CapSense_WaitEndOfCpuScan(uint32_t watchdogTime, cy_stc_capsense_context_t * context)
{
    uint32_t tmpVal;
    const uint32_t cpuCyclesPerLoop = 5u;
    MSCLP_Type * ptrHwBase = context->ptrCommonConfig->ptrChConfig->ptrHwBase;

    tmpVal = context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA;
    tmpVal = Cy_CapSense_WatchdogCyclesNum(watchdogTime, tmpVal, cpuCyclesPerLoop);

    while ((ptrHwBase->INTR & MSCLP_INTR_MASK_SCAN_Msk) == 0u)
    {
        if (0uL == tmpVal)
        {
            break;
        }
        tmpVal--;
    }

    /* Clear all pending interrupts */
    ptrHwBase->INTR = CY_CAPSENSE_MSCLP_INTR_ALL_MSK;
    (void)ptrHwBase->INTR;
    return tmpVal;
}


/*******************************************************************************
* Function Name: Cy_CapSense_ExecuteSaturatedScan
****************************************************************************//**
*
* This internal function executes a scan with the saturated channel to obtain
* the MAX raw count or the scan duration for the specified scan slot.
*
* \param ptrMaxRaw
* Specifies the pointer to store the resulting MAX raw count value or scan
* time in Mod Clock cycles.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param scanSlotId
* The slot ID scans will be done for.
*
* \param mode
* Saturated scan execution mode:
* - CY_CAPSENSE_SATURATED_MAX_COUNT   - Used to obtain the MAX raw count.
* - CY_CAPSENSE_SATURATED_SCAN_TIME   - Used to obtain the scan duration in terms of Mod Clock cycles.
*
* \param context
* The pointer to the context structure allocated by the user or middleware.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS      - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_TIMEOUT      - A timeout reached during the scan time measurement.
* - CY_CAPSENSE_STATUS_BAD_PARAM    - Not valid input parameter.
* - CY_CAPSENSE_STATUS_HW_BUSY      - The MSCLP HW block is busy and cannot be
*                                     switched to another mode.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ExecuteSaturatedScan(
                uint32_t * ptrMaxRaw,
                uint32_t widgetId,
                uint32_t scanSlotId,
                uint32_t mode,
                cy_stc_capsense_context_t * context)
{
    uint32_t tmpVal;
    uint32_t slotFrameIdx;
    uint32_t * ptrSnsFrame;
    uint32_t scanConfigTmp[CY_MSCLP_6_SNS_REGS];
    cy_stc_capsense_widget_config_t const * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_capsense_status_t status;

    MSCLP_Type * ptrHwBase = context->ptrCommonConfig->ptrChConfig->ptrHwBase;

    uint32_t kref;
    uint32_t epiCounts;
    uint32_t epiKrefDelay;

    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN) && \
            ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_AUTO_EN) || \
            (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC_RATE_MODE_AUTO_EN)))
        /* shiftTemp is only needed if CIC2 filter and auto modes are enabled */
        uint32_t shiftTemp = 0u;
    #endif
    cy_stc_capsense_widget_context_t * ptrWdCxt = &context->ptrWdContext[widgetId];

    (void)mode;

    /* Configures the MSCLP HW block for operation with the permanently saturated channel. */
    status = Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_CHANNEL_SATURATION, context);

    /* Obtain the scan parameters offset in the cy_capsense_sensorFrameContext[]
     * array for the slots that are part of Active widgets.
     */
    slotFrameIdx = scanSlotId * CY_CAPSENSE_SENSOR_FRAME_SIZE;
    ptrSnsFrame = &context->ptrSensorFrameContext[slotFrameIdx];

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        if (ptrWdCfg->wdType == (uint8_t)CY_CAPSENSE_WD_LOW_POWER_E)
        {
            /* Obtain the scan parameters offset in the cy_capsense_sensorFrameContext[]
             * array for the slots that are part of Low power widgets.
             */
            slotFrameIdx  = scanSlotId * CY_MSCLP_11_SNS_REGS;
            slotFrameIdx += CY_CAPSENSE_FRM_LP_SNS_SW_SEL_CSW_LO_MASK2_INDEX;
            ptrSnsFrame = &context->ptrSensorFrameLpContext[slotFrameIdx];
        }
    #endif

    /* The measurement with a saturated channel will be performed with all the sensors disconnected.
     * The code below sets up the configuration of the LO_MASK registers with 0x00000000u.
     * The SW_SEL_CSW_FUNC[0u] is configured in the scope of the Cy_CapSense_ConfigureSaturationMode()
     * routine with all the switches open.
     */
    scanConfigTmp[CY_CAPSENSE_SNS_SW_SEL_CSW_LO_MASK2_INDEX] = 0x00u; /* Set up the SNS_SW_SEL_CSW_LO_MASK2 register configuration. */
    scanConfigTmp[CY_CAPSENSE_SNS_SW_SEL_CSW_LO_MASK1_INDEX] = 0x00u; /* Set up the SNS_SW_SEL_CSW_LO_MASK1 register configuration. */
    scanConfigTmp[CY_CAPSENSE_SNS_SW_SEL_CSW_LO_MASK0_INDEX] = 0x00u; /* Set up the SNS_SW_SEL_CSW_LO_MASK0 register configuration. */

    /* The code below sets up configuration of the sense control registers. */
    scanConfigTmp[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] = ptrSnsFrame[CY_CAPSENSE_SNS_SCAN_CTL_INDEX]; /* Set up the SNS_SCAN_CTL register configuration. */
    scanConfigTmp[CY_CAPSENSE_SNS_CDAC_CTL_INDEX] = ptrSnsFrame[CY_CAPSENSE_SNS_CDAC_CTL_INDEX]; /* Set up the SNS_CDAC_CTL register configuration. */
    scanConfigTmp[CY_CAPSENSE_SNS_CTL_INDEX] = ptrSnsFrame[CY_CAPSENSE_SNS_CTL_INDEX]; /* Set up the SNS_CTL register configuration. */

    /* Disable system chopping */
    scanConfigTmp[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] &= ~MSCLP_SNS_SNS_SCAN_CTL_NUM_CONV_Msk;

    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN) && \
            ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_AUTO_EN) || \
            (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC_RATE_MODE_AUTO_EN)))
        if (CY_CAPSENSE_SATURATED_SCAN_TIME == mode)
        {
            /* Disable the CIC2 shift and set the decimation rate to 1 (DECIM_RATE = 0) to increment the
             * CIC2 accumulator each Mod Clock cycle and then copy the result to FIFO without shifting.
             * The final value in the FIFO fill is the equal number of Mod Clock cycles per scan minus 1 because
             * the first CIC2 sample is invalid and will be skipped. This skipped Mod Clock cycle will be considered
             * at the end of this function.
             */
            scanConfigTmp[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] &= (uint32_t)(~MSCLP_SNS_SNS_SCAN_CTL_CIC2_SHIFT_Msk);
            scanConfigTmp[CY_CAPSENSE_SNS_CTL_INDEX] &= (uint32_t)(~MSCLP_SNS_SNS_CTL_DECIM_RATE_Msk);

            /* In case Max Rawcount are going to be overflowed let's use CIC2 shift */
            shiftTemp = 0u;
            tmpVal = ptrWdCxt->snsClk;
            if (tmpVal < ptrWdCxt->rowSnsClk)
            {
                tmpVal = ptrWdCxt->rowSnsClk;
            }
            tmpVal *= ptrWdCxt->numSubConversions;
            if (CY_CAPSENSE_CLK_SOURCE_PRS == ((uint32_t)ptrWdCxt->snsClkSource & CY_CAPSENSE_CLK_SOURCE_MASK))
            {
                tmpVal <<= 1u;
            }
            while ((tmpVal >> shiftTemp) > CY_CAPSENSE_16_BIT_MASK)
            {
                shiftTemp++;
            }
            if (CY_CAPSENSE_CIC2_SHIFT_MAX < shiftTemp)
            {
                status = CY_CAPSENSE_STATUS_CONFIG_OVERFLOW;
            }
            /* Consider System Chopping for overflow */
            tmpVal <<= (ptrWdCfg->numChopCycles - 1u);
            if (CY_CAPSENSE_25_BIT_MASK < tmpVal)
            {
                status = CY_CAPSENSE_STATUS_CONFIG_OVERFLOW;
            }
            scanConfigTmp[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] |= (uint32_t)(shiftTemp << MSCLP_SNS_SNS_SCAN_CTL_CIC2_SHIFT_Pos);
        }
    #endif

    /* Disables CIC2 HW filter for WBX widget */
    #if ((CY_CAPSENSE_WBX_EN) && (CY_CAPSENSE_CIC2_FILTER_EN))
        if ((uint8_t)CY_CAPSENSE_WD_WHEATSTONE_BRIDGE_E == ptrWdCfg->wdType)
        {
            context->ptrCommonConfig->ptrChConfig->ptrHwBase->FILTER_CTL &= 
                (uint32_t)~MSCLP_FILTER_CTL_FILTER_MODE_Msk;
        }
    #endif

