zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
    if (status == CY_CAPSENSE_STATUS_SUCCESS)
    {
        /* Initiate the scan in the CPU operating mode. */
        Cy_CapSense_StartCpuScan((const uint32_t *)scanConfigTmp, context);

        tmpVal = Cy_CapSense_GetScanWatchdogTime(widgetId, scanSlotId, context);
        tmpVal = Cy_CapSense_WaitEndOfCpuScan(tmpVal, context);

        if (0u == tmpVal)
        {
            status |= CY_CAPSENSE_STATUS_TIMEOUT;
        }
    }

    /* Restores CIC2 HW filter configuration */
    #if ((CY_CAPSENSE_WBX_EN) && (CY_CAPSENSE_CIC2_FILTER_EN))
        if ((uint8_t)CY_CAPSENSE_WD_WHEATSTONE_BRIDGE_E == ptrWdCfg->wdType)
        {
            context->ptrCommonConfig->ptrChConfig->ptrHwBase->FILTER_CTL |= 
                MSCLP_FILTER_CTL_FILTER_MODE_Msk;
        }
    #endif


    tmpVal = (ptrHwBase->SNS.RESULT_FIFO_RD & MSCLP_SNS_RESULT_FIFO_RD_RAW_COUNT_Msk) >>
            MSCLP_SNS_RESULT_FIFO_RD_RAW_COUNT_Pos;

    /* Disable HW IP */
    ptrHwBase->CTL &= (~MSCLP_CTL_ENABLED_Msk);

    *ptrMaxRaw = CY_CAPSENSE_16_BIT_MASK;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN)
        if ((uint8_t)CY_CAPSENSE_WD_WHEATSTONE_BRIDGE_E != ptrWdCfg->wdType)
        {
            #if (((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_AUTO_EN) || \
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC_RATE_MODE_AUTO_EN)))
                if (CY_CAPSENSE_SATURATED_SCAN_TIME == mode)
                {
                    tmpVal <<= shiftTemp;
                    /* The final value in the FIFO fill is the equal number of Mod Clock cycles per scan minus 1 because
                     * the first CIC2 sample is invalid and is always skipped. The code below takes into account this skipped
                     * Mod Clock cycle.
                     */
                    tmpVal++;
                    *ptrMaxRaw = tmpVal;
                }
                else
            #endif
            {
                tmpVal *= ptrWdCfg->numChopCycles;
                if (tmpVal <= CY_CAPSENSE_16_BIT_MASK)
                {
                    *ptrMaxRaw = (uint16_t)tmpVal;
                }
            }
        }
        else
    #endif
    {
        epiKrefDelay = CY_CAPSENSE_NUM_EPI_KREF_DELAY;
        kref = ((scanConfigTmp[CY_CAPSENSE_SNS_CTL_INDEX] & MSCLP_SNS_SNS_CTL_SENSE_DIV_Msk) >> MSCLP_SNS_SNS_CTL_SENSE_DIV_Pos) + 1u;
        if (CY_CAPSENSE_CLK_SOURCE_PRS == ((uint32_t)ptrWdCxt->snsClkSource & CY_CAPSENSE_CLK_SOURCE_MASK))
        {
            epiKrefDelay = CY_CAPSENSE_NUM_EPI_KREF_DELAY_PRS;
        }
        epiCounts = epiKrefDelay * ((kref + 3u) >> 2u);
        if (CY_CAPSENSE_CLK_SOURCE_PRS == ((uint32_t)ptrWdCxt->snsClkSource & CY_CAPSENSE_CLK_SOURCE_MASK))
        {
            if ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) || (CY_CAPSENSE_ISX_GROUP == ptrWdCfg->senseMethod))
            {
                kref <<= 1u;
            }
        }
        if (0uL == (kref & 0x01uL))
        {
            epiCounts--;
        }
        tmpVal -= epiCounts;
        tmpVal *= ptrWdCfg->numChopCycles;
        if (tmpVal <= CY_CAPSENSE_16_BIT_MASK)
        {
            *ptrMaxRaw = (uint16_t)tmpVal;
        }
    }

    if (0u == *ptrMaxRaw)
    {
        *ptrMaxRaw = 1u;
    }
    return status;
}


/*******************************************************************************
* Function Name: Cy_CapSense_ConfigureSaturationMode
****************************************************************************//**
*
* Configures the MSCLP HW block for operation with the permanently saturated
* channel.
* The raw data counter is continuously enabled from the beginning to the end of
* the scan. The scan is performed in the CPU operating mode.
*
* \param context
* The pointer to the context structure allocated by the user or middleware.
*
*******************************************************************************/
void Cy_CapSense_ConfigureSaturationMode(
                cy_stc_capsense_context_t * context)
{
    uint32_t i;
    MSCLP_Type * ptrHwBase = context->ptrCommonConfig->ptrChConfig->ptrHwBase;

    Cy_CapSense_SetupCpuOperatingMode(context);

    /* Configure the Switch Control Global Function #0 to have all switches open.
     * All the sensing electrodes will be disconnected during the MAX raw count measurement.
     */
    ptrHwBase->SW_SEL_CSW_FUNC[0u] = 0x00u;

    /* Iterate through all the MODE structures and update them with the configuration,
     * required to saturate the measurement channel.
     */
    for (i = 0u; i < MSCLP_SENSE_MODE_NR; i++)
    {
        /* The 0x03 value of the RMF field enables the internal voltage divider and
         * configures it to generate VDDA*0.8 voltage at the output.
         */
        ptrHwBase->MODE[i].SW_SEL_TOP  = _VAL2FLD(MSCLP_MODE_SW_SEL_TOP_RMF, 0x03u);

        /* Set the CPF and the CMG bits to get the positive comparator input connected
         * to the VDDA*0.8 voltage level and the negative comparator input to the GND.
         */
        ptrHwBase->MODE[i].SW_SEL_COMP = _VAL2FLD(MSCLP_MODE_SW_SEL_COMP_CPF, 0x01u) |
                                         _VAL2FLD(MSCLP_MODE_SW_SEL_COMP_CMG, 0x01u);
    }

}

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_AUTO_DITHER_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_ConfigureAutoDitherMode
****************************************************************************//**
*
* Configures the MSCLP HW block for operation in the auto-dithering mode.
*
* \param context
* The pointer to the context structure allocated by the user or middleware.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_CONFIG_OVERFLOW  - The numberSlots parameter exceeds
*                                         the maximum number of sensor configurations
*                                         which is possible to be loaded into the
*                                         internal buffer of the CAPSENSE&trade; HW block.
* - CY_CAPSENSE_STATUS_BAD_CONFIG       - The function does not suppose to be
*                                         called with the current CAPSENSE&trade;
*                                         configuration.
* - CY_CAPSENSE_STATUS_HW_BUSY          - The MSCLP HW block is busy and cannot be
*                                         configured.
*
*******************************************************************************/
static cy_capsense_status_t Cy_CapSense_ConfigureAutoDitherMode(
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t status = CY_CAPSENSE_STATUS_SUCCESS;
    cy_en_msclp_status_t msclpStatus;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;
    MSCLP_Type * ptrHwBase = ptrCommonCfg->ptrChConfig->ptrHwBase;

    /* Generate sensor frame configuration for active widgets*/
    Cy_CapSense_GenerateAllSensorConfig(CY_CAPSENSE_SNS_FRAME_ACTIVE, context);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        /* Generate sensor frame configuration for LP widgets */
        Cy_CapSense_GenerateAllSensorConfig(CY_CAPSENSE_SNS_FRAME_LOW_POWER, context);
    #endif /* CY_CAPSENSE_LP_EN */

    /* Write configuration data into all MSCLP block registers */
    msclpStatus = Cy_MSCLP_Configure(ptrHwBase,
                            context->ptrBaseFrameContext,
                            CY_MSCLP_CAPSENSE_KEY,
                            ptrCommonCfg->ptrChConfig->ptrHwContext);

