zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
    Cy_CapSense_SetupCpuOperatingMode(context);

    if (CY_MSCLP_SUCCESS != msclpStatus)
    {
        status = CY_CAPSENSE_STATUS_HW_BUSY;
    }

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN)
        /* Set FILTER_MODE to CIC1 */
        ptrHwBase->FILTER_CTL &= ~MSCLP_FILTER_CTL_FILTER_MODE_Msk;
    #endif /* CY_CAPSENSE_CIC2_FILTER_EN */

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_FRM_START_EN)
        /* Clear the external start scan mode */
        ptrHwBase->CTL &= ~MSCLP_CTL_EXT_FRAME_START_MODE_Msk;
    #endif

    return status;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_AUTO_DITHER_EN) */

/*******************************************************************************
* Function Name: Cy_CapSense_GetScanWatchdogTime
****************************************************************************//**
*
* This internal function calculates the watchdog time in microseconds for the
* specified slot. The calculated value is the duration of one sample with the
* five-time margin.
*
* WATCHDOG_TIME = (SCAN_CYCLES / MOD_CLK_FREQ) * 5;
*
* where:
*
* SCAN_CYCLES = (INIT_CYCLES + PRO_CYCLES + CONV_CYCLES + EPI_CYCLES) * NUM_CONV;
* INIT_CYCLES = INIT_CMOD_RAIL_CYCLES + INIT_CMOD_SHORT_CYCLES;
* PRO_CYCLES = PRO_OFFSET_CYCLES + (PRO_WAIT_KREF_DELAY * SENSE_DIV / 4);
* CONV_CYCLES = (PRO_DUMMY_SUB_CONVS + NUM_SUB_CONVS) * SENSE_DIV;
* EPI_CYCLES = EPI_KREF_DELAY * SENSE_DIV / 4;
*
* The corresponding parameters are listed below:
* - EPI_KREF_DELAY - The duration of EPILOGUE defined in relation to Kref.
*   The value is interpreted as SENSE_DIV/4 increments.
* - INIT_CMOD_RAIL_CYCLES - Duration of the coarse initialization phase when
*   Cmod1 is connected to VDDA and Cmod2 is connected to VSSA. The parameter is
*   defined in terms of Mod Clock cycles.
* - INIT_CMOD_SHORT_CYCLES - Duration of the coarse short phase when
*   Cmod1 and Cmod2 are shorted together. The parameter is defined in terms of
*   Mod Clock cycles.
* - PRO_OFFSET_CYCLES - Maximum number of Mod Clock cycles to be assigned for
*   the PRO_OFFSET state. If NUM_PRO_OFFSET_TRIPS are observed before this
*   timeout, exit at that point.
* - PRO_DUMMY_SUB_CONVS - Number of sub-conversions (dummy cycles) to be run
*   during PRO_DUMMY.
* - PRO_WAIT_KREF_DELAY - The duration of PRO_WAIT defined in relation to Kref.
*   The value is interpreted as SENSE_DIV/4 increments.
* - SENSE_DIV - The length of one sub-conversion in terms of Mod Clock cycles.
* - NUM_SUB_CONVS - Number of sub-conversions.
* - NUM_CONV - Number of chop cycles.
* - MOD_CLK_FREQ - Modulation clock frequency.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param scanSlotId
* The slot ID the watchdog time calculation will be done for.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns watch-dog time interval in microseconds.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetScanWatchdogTime(
                uint32_t widgetId,
                uint32_t scanSlotId,
                cy_stc_capsense_context_t * context)
{
    uint32_t tmpVal;
    uint32_t snsClkDivider;
    uint32_t modClkFreqMhz;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;

    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_TOUCHPAD_EN) ||\
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_MATRIX_EN))
        const cy_stc_capsense_scan_slot_t * ptrScanSlots;
    #endif /* CY_CAPSENSE_CSD_TOUCHPAD_EN || CY_CAPSENSE_CSD_MATRIX_EN */

    /* Define the MARGIN_KOEFF = 5 */
    const uint32_t watchdogTimeMarginCoeff = 5u;

    (void)scanSlotId;

    /* Initialize the .modClkFreqMhz field with the MRSS IMO frequency value. */
    #if (CY_CAPSENSE_IMO_FREQUENCY == CY_CAPSENSE_IMO_25_MHZ)
        modClkFreqMhz  = CY_CAPSENSE_IMO_CLK_25_MHZ;
    #elif (CY_CAPSENSE_IMO_FREQUENCY == CY_CAPSENSE_IMO_38_MHZ)
        modClkFreqMhz  = CY_CAPSENSE_IMO_CLK_38_MHZ;
    #else /* (CY_CAPSENSE_IMO_FREQUENCY == CY_CAPSENSE_IMO_46_MHZ) */
        modClkFreqMhz  = CY_CAPSENSE_IMO_CLK_46_MHZ;
    #endif

    /* Initialize pointers with the configuration address for the specified scan slot and MSC channel #0 */
    ptrWdCfg = &context->ptrWdConfig[widgetId];

    /* Initialize the .snsClkDivider field with the value for the slot that is
    *  specified by the scanSlotId parameter of the function.
    */
    snsClkDivider = ptrWdCfg->ptrWdContext->snsClk;
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        if (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod)
        {
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_TOUCHPAD_EN) ||\
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_MATRIX_EN))
                ptrScanSlots = &context->ptrScanSlots[scanSlotId];
                if (ptrWdCfg->numCols <= ptrScanSlots->snsId)
                {
                    snsClkDivider = ptrWdCfg->ptrWdContext->rowSnsClk;
                }
            #endif /* CY_CAPSENSE_CSD_TOUCHPAD_EN || CY_CAPSENSE_CSD_MATRIX_EN */
                    }
    #endif /* CY_CAPSENSE_CSD_EN */

    /* Calculate the INIT_CYCLES number. */
    tmpVal  = ((uint32_t)context->ptrInternalContext->numCoarseInitChargeCycles + context->ptrInternalContext->numCoarseInitSettleCycles);

    /* Add the PRO_OFFSET_CYCLES number. */
    tmpVal += (uint32_t)context->ptrInternalContext->numProOffsetCycles;

    /* Add the sum of PRO_CYCLES and EPI_CYCLES. Shift by 2 is required because for the fifth-generation low power devices
    *  the .numEpiCycles parameter are interpreted as SENSE_DIV/4 increments.
    */
    if (CY_CAPSENSE_CLK_SOURCE_PRS == (ptrWdCfg->ptrWdContext->snsClkSource & CY_CAPSENSE_CLK_SOURCE_MASK))
    {
        tmpVal += ((uint32_t)context->ptrInternalContext->numProWaitKrefDelayPrs + context->ptrInternalContext->numEpiKrefDelayPrs) * (snsClkDivider >> 2u);
    }
    else
    {
        tmpVal += ((uint32_t)context->ptrInternalContext->numProWaitKrefDelay + context->ptrInternalContext->numEpiKrefDelay) * (snsClkDivider >> 2u);
    }

    /* Add the CONV_CYCLES number. */
    tmpVal += ((uint32_t)context->ptrInternalContext->numFineInitCycles + ptrWdCfg->ptrWdContext->numSubConversions) * snsClkDivider;

    if (CY_CAPSENSE_CLK_SOURCE_PRS == (ptrWdCfg->ptrWdContext->snsClkSource & CY_CAPSENSE_CLK_SOURCE_MASK))
    {
        /* Taking into account correction that is implemented in the Cy_CapSense_AdjustSnsClkDivider() function,
         * the scan duration is two time longer if the PRS is used as the sense clock source.
         */
        tmpVal <<= 1u;
    }

    /* Calculate the SCAN_CYCLES number by multiplying the Mod Clock cycles number per one chop cycle by
    *  number of chop cycles.
    */
    tmpVal *= ptrWdCfg->numChopCycles;

    /* Convert the calculated duration in terms of clk_mod cycles to the microseconds. */
    tmpVal /= modClkFreqMhz;

    /* Multiply the calculated value by the MARGIN_KOEFF value. */
    tmpVal *= watchdogTimeMarginCoeff;

