zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
    return tmpVal;
}

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_AUTO_DITHER_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_CdacDitherScaleCalc
****************************************************************************//**
*
* This internal function calculates the dither scale value based on highest
* raw count value in AUTO dithering mode.
*
* \note
* This function doesn't handle liquid level and wheatstone bridge widgets.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return status
* Returns the status of the operation (different statuses can be combined):
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed
*                                         successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - At least one of input parameters is
*                                         not valid.
* - CY_CAPSENSE_STATUS_HW_BUSY          - The HW is busy with the previous scan.
*
*******************************************************************************/
static cy_capsense_status_t Cy_CapSense_CdacDitherScaleCalc(
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t status = CY_CAPSENSE_STATUS_SUCCESS;
    cy_en_msclp_status_t msclpStatus;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    uint32_t wdIndex;
    uint32_t * ptrSnsFrame;
    uint32_t rawCountMax;

    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;
    MSCLP_Type * ptrHwBase = ptrCommonCfg->ptrChConfig->ptrHwBase;

    /* Force HW configuration update on the next scan */
    status = Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_AUTO_DITHERING, context);

    ptrWdCfg = context->ptrWdConfig;
    for (wdIndex = 0u; wdIndex < CY_CAPSENSE_TOTAL_WIDGET_COUNT; wdIndex++)
    {
        if (0u != Cy_CapSense_IsWidgetEnabled(wdIndex, context))
        {
            if ((CY_CAPSENSE_CDAC_DITHERING_MODE_AUTO == ptrWdCfg->cdacDitherScaleMode) &&
                ((uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E != ptrWdCfg->wdType) &&
                ((uint8_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_E != ptrWdCfg->wdType) &&
                ((uint8_t)CY_CAPSENSE_WD_WHEATSTONE_BRIDGE_E != ptrWdCfg->wdType))
            {
                /* Handle only CSD and CSX widgets */
                if (CY_CAPSENSE_ISX_GROUP != ptrWdCfg->senseMethod)
                {
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
                        /* Scan low power widgets */
                        if ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E == ptrWdCfg->wdType)
                        {
                            ptrSnsFrame = &context->ptrSensorFrameLpContext[ptrWdCfg->firstSlotId * CY_CAPSENSE_LP_SENSOR_FRAME_SIZE + 
                                                                                        CY_CAPSENSE_FRM_LP_SNS_SW_SEL_CSW_LO_MASK2_INDEX];
                            status |= Cy_CapSense_CdacDitherGetMaxRaw(ptrSnsFrame, ptrWdCfg, CY_CAPSENSE_LP_SENSOR_FRAME_SIZE, &rawCountMax, context);
                        }
                        else
                    #endif /* CY_CAPSENSE_LP_EN */
                    /* Scan active widgets */
                    {
                        ptrSnsFrame = &context->ptrSensorFrameContext[ptrWdCfg->firstSlotId * CY_CAPSENSE_SENSOR_FRAME_SIZE];
                        status |= Cy_CapSense_CdacDitherGetMaxRaw(ptrSnsFrame, ptrWdCfg, CY_CAPSENSE_SENSOR_FRAME_SIZE, &rawCountMax, context);
                    }

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                        /* Divide the result by 2 for the FW CSX scanning method */
                        if (CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod)
                        {
                            rawCountMax /= CY_CAPSENSE_DIVIDER_TWO;
                        }
                    #endif

                    /* Set dither value according to measured widget raw counts */
                    if (rawCountMax < CY_CAPSENSE_DITHERING_SNS_CAP_300_FEMTO_RAW)
                    {
                        context->ptrWdContext[wdIndex].cdacDitherValue = 6u;
                    } else if (rawCountMax < CY_CAPSENSE_DITHERING_SNS_CAP_500_FEMTO_RAW)
                    {
                        context->ptrWdContext[wdIndex].cdacDitherValue = 5u;
                    } else if (rawCountMax < CY_CAPSENSE_DITHERING_SNS_CAP_1000_FEMTO_RAW)
                    {
                        context->ptrWdContext[wdIndex].cdacDitherValue = 4u;
                    } else if (rawCountMax < CY_CAPSENSE_DITHERING_SNS_CAP_3000_FEMTO_RAW)
                    {
                        context->ptrWdContext[wdIndex].cdacDitherValue = 3u;
                    } else if (rawCountMax < CY_CAPSENSE_DITHERING_SNS_CAP_5000_FEMTO_RAW)
                    {
                        context->ptrWdContext[wdIndex].cdacDitherValue = 2u;
                    } else if (rawCountMax < CY_CAPSENSE_DITHERING_SNS_CAP_10000_FEMTO_RAW)
                    {
                        context->ptrWdContext[wdIndex].cdacDitherValue = 1u;
                    } else
                    {
                        context->ptrWdContext[wdIndex].cdacDitherValue = 0u;
                    }
                }
            }
        }
        /* Increment pointer to the next widget */
        ptrWdCfg++;
    }

    /* Update Active frame configuration */
    Cy_CapSense_GenerateAllSensorConfig(CY_CAPSENSE_SNS_FRAME_ACTIVE, context);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        /* Update LP frame configuration */
        Cy_CapSense_GenerateAllSensorConfig(CY_CAPSENSE_SNS_FRAME_LOW_POWER, context);
    #endif /* CY_CAPSENSE_LP_EN */

    /* Write configuration data into all MSCLP block registers */
    msclpStatus = Cy_MSCLP_Configure(ptrHwBase,
                                    context->ptrBaseFrameContext,
                                    CY_MSCLP_CAPSENSE_KEY,
                                    ptrCommonCfg->ptrChConfig->ptrHwContext);

