zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
    if (CY_MSCLP_SUCCESS != msclpStatus)
    {
        status = CY_CAPSENSE_STATUS_HW_BUSY;
    }

    return status;
}

/*******************************************************************************
* Function Name: Cy_CapSense_CdacDitherGetMaxRaw
****************************************************************************//**
*
* This internal function performs scanning for each sensor in a widget and finds
* the biggest raw count value.
*
* \param ptrSnsFrame
* The pointer to sensor frame array for current widget.
*
* \param ptrWdCfg
* The pointer to the widget config structure.
*
* \param snsFrameSize
* Sensor frame size:
* - CY_CAPSENSE_SENSOR_FRAME_SIZE - for active widgets
* - CY_CAPSENSE_LP_SENSOR_FRAME_SIZE - for low power widgets
*
* \param ptrRawCountMax
* The pointer to variable for storing raw counts maximum value.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return status
* Returns the status of the operation (different statuses can be combined):
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed
*                                      successfully.
* - CY_CAPSENSE_STATUS_TIMEOUT       - The software watchdog timeout occurred
*                                      during the scan, the scan was not completed.
*
*******************************************************************************/
static cy_capsense_status_t Cy_CapSense_CdacDitherGetMaxRaw(
                uint32_t * ptrSnsFrame,
                const cy_stc_capsense_widget_config_t * ptrWdCfg,
                uint32_t snsFrameSize,
                uint32_t * ptrRawCountMax,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t status = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t tmpRawCount;
    uint32_t watchdog;
    uint32_t scanConfigTmp[CY_MSCLP_6_SNS_REGS];
    uint32_t scanSlotId;
    uint32_t index;

    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;
    MSCLP_Type * ptrHwBase = ptrCommonCfg->ptrChConfig->ptrHwBase;

    /* Reset maximum raw raw counts value before measurement */
    *ptrRawCountMax = 0u;

    /* Perform preliminary scans for active widgets */
    for (scanSlotId = 0u; scanSlotId < ptrWdCfg->numSns; scanSlotId++)
    {
        /* Inherit sensor frame to local array */
        for (index = 0u; index < CY_MSCLP_6_SNS_REGS; index++)
        {
            scanConfigTmp[index] = ptrSnsFrame[index];
        }
        /* Configure Sensor Clock, Clock Sources */
        scanConfigTmp[CY_CAPSENSE_SNS_CTL_INDEX] &= (uint32_t)~(MSCLP_SNS_SNS_CTL_START_SCAN_Msk | 
                                                    MSCLP_SNS_SNS_CTL_LAST_Msk | MSCLP_SNS_SNS_CTL_MULTI_CH_MODE_Msk | 
                                                    MSCLP_SNS_SNS_CTL_SENSE_DIV_Msk | MSCLP_SNS_SNS_CTL_LFSR_MODE_Msk);
        scanConfigTmp[CY_CAPSENSE_SNS_CTL_INDEX] |= (((CY_CAPSENSE_CDAC_DITHERING_KREF - 1u) << MSCLP_SNS_SNS_CTL_SENSE_DIV_Pos) |
                                                                (1u << MSCLP_SNS_SNS_CTL_LAST_Pos));

        /* Configure Number of sub-conversions, Compensation divider */
        scanConfigTmp[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] = (((CY_CAPSENSE_CDAC_DITHERING_NUM_SUBCONV - 1u) << MSCLP_SNS_SNS_SCAN_CTL_NUM_SUB_CONVS_Pos) |
                                                        ((CY_CAPSENSE_CDAC_DITHERING_COMP_DIV - 1u) << MSCLP_SNS_SNS_SCAN_CTL_COMP_DIV_Pos));

        /* Configure Cap DACs and Clock reference rate*/
        scanConfigTmp[CY_CAPSENSE_SNS_CDAC_CTL_INDEX] = 0u;
        scanConfigTmp[CY_CAPSENSE_SNS_CDAC_CTL_INDEX] |= ((CY_CAPSENSE_CDAC_DITHERING_CDAC_REF << MSCLP_SNS_SNS_CDAC_CTL_SEL_RE_Pos) |
                                                        (CY_CAPSENSE_CDAC_DITHERING_CLOCK_REF_RATE << MSCLP_SNS_SNS_CDAC_CTL_CLOCK_REF_RATE_Pos));

        Cy_CapSense_StartCpuScan((const uint32_t *)scanConfigTmp, context);

        watchdog = Cy_CapSense_WaitEndOfCpuScan(CY_CAPSENSE_CDAC_DITHERING_WATCHDOG_TIME, context);

        /* Check if the watchdog timeout happened */
        if (0u == watchdog)
        {
            status = CY_CAPSENSE_STATUS_TIMEOUT;
        }
        else
        {
            /* Read raw counts */
            tmpRawCount = ptrHwBase->SNS.RESULT_FIFO_RD & MSCLP_SNS_RESULT_FIFO_RD_RAW_COUNT_Msk;
            if (*ptrRawCountMax < tmpRawCount)
            {
                /* Keep maximum raw counts */
                *ptrRawCountMax = tmpRawCount;
            }
        }
        /* Increment pointer to the next sensor */
        ptrSnsFrame += snsFrameSize;
    }

    return status;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_AUTO_DITHER_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_ShortIntegration
****************************************************************************//**
*
* Initiates the check of specified slots. Widgets with short integration time
* like Foam Detection feature can't be scanned with the others in one scan.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param startSlotId
* The slot ID scan will be started from.
*
* \param numberSlots
* The number of slots will be scanned.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_MIXED_SENSORS    - Sensors with short integration time
* and w/o can't be scanned in one frame.
*
*******************************************************************************/
static cy_capsense_status_t Cy_CapSense_ShortIntegration(
                uint32_t startSlotId,
                uint32_t numberSlots,
                cy_stc_capsense_context_t * context)
{
    uint32_t curSlotIndex;
    uint32_t wdIndex;
    uint32_t snsIndex;
    const cy_stc_capsense_scan_slot_t * ptrScanSlots;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    uint32_t regularWdCnt = 0u;
    uint32_t irregularWdCnt = 0u;
    uint32_t lastSlot = startSlotId + numberSlots - 1u;
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;

    ptrScanSlots = context->ptrScanSlots;
    curSlotIndex = startSlotId;

    do
    {
        wdIndex  = ptrScanSlots[curSlotIndex].wdId;
        snsIndex = ptrScanSlots[curSlotIndex].snsId;
        ptrWdCfg = &context->ptrWdConfig[wdIndex];

