zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.c
        if ((((uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E == ptrWdCfg->wdType) ||
             ((uint8_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_E == ptrWdCfg->wdType)) &&
              (0u != (ptrWdCfg->centroidConfig & CY_CAPSENSE_LLW_FOAM_EN_MASK)))
        {
            irregularWdCnt++;
        }
        else
        {
            regularWdCnt++;
        }

        if ((0u != regularWdCnt) && (0u != irregularWdCnt))
        {
            capStatus = CY_CAPSENSE_STATUS_MIXED_SENSORS;
            break;
        }

        /* Jump to the next widget */
        curSlotIndex += (ptrWdCfg->numSlots - snsIndex);
    } while (curSlotIndex <= lastSlot);

    if ((CY_CAPSENSE_STATUS_SUCCESS == capStatus) && (0u < irregularWdCnt))
    {
        /* Configures Foam Detection scan */
        context->ptrCommonConfig->ptrChConfig->ptrHwBase->SENSE_DUTY_CTL = 
                ((CY_CAPSENSE_SM_REG_SENSE_DUTY_CTL_FLD_PHASE_WIDTH_SEL_FOAM << MSCLP_SENSE_DUTY_CTL_PHASE_WIDTH_SEL_Pos) | 
                 (CY_CAPSENSE_SM_REG_SENSE_DUTY_CTL_FLD_PHASE_SHIFT_CYCLES_FOAM << MSCLP_SENSE_DUTY_CTL_PHASE_SHIFT_CYCLES_Pos) | 
                 ((uint32_t)ptrWdCfg->ptrWdContext->sigPFC << MSCLP_SENSE_DUTY_CTL_PHASE_WIDTH_Pos));
    }

    return capStatus;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN) */

#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_COMP_AUTO_EN) && \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CALIBRATION_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateCompCdacWbx
****************************************************************************//**
*
* Performs a compensation CDAC auto-calibration specifically for an WBX widget.
*
* The internal function that performs the compensation CDAC successive
* approximation seek for the specified widget with fixed reference CDAC and
* fixed compensation divider.
*
* The function performs up to 2x9 scans of the slots in specified widget in the CPU
* driven scan mode to seek for a minimal compensation CDAC value needed to match
* count target.
*
* Specific of WBX widgets is they could require like direct 
* (similar to CSD widgets) compensation CDAC configuration as well as inverse, 
* when compensation CDAC adds some current to reach a target instead of 
* compensating it. Therefore This function perform two-phase calibration 
* if needed and also stores direction into a bit field of widget status 
* register: CY_CAPSENSE_WD_WBX_COMPENSATION_DIRECTION_MASK
*
* The function usage is limited by the CapDAC auto-calibration.
*
* \note
* This function is available only
* for the fifth-generation low power CAPSENSE&trade;.
*
* \param widgetId
* The widget ID scans will be done for.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS   - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The calibration is failed due to
*                                  the issues with scanning (either
*                                  watchdog timer, interrupt breaking, etc.).
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateCompCdacWbx(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t rawTarget;
    uint32_t rawDeltaDirect = CY_CAPSENSE_32_BIT_MASK;
    uint32_t rawDeltaInverted = CY_CAPSENSE_32_BIT_MASK;
    uint16_t rawCalibration;
    uint8_t cCompClosestDirect = 0u;
    uint8_t cCompClosestInverted = 0u;
    uint8_t cdacMask = (uint8_t)CY_CAPSENSE_CAL_COMP_CDAC_MIDDLE_CODE;
    cy_stc_capsense_widget_config_t const * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_stc_capsense_sensor_context_t * ptrSnsCxt = &ptrWdCfg->ptrSnsContext[0u];

    /* Calculates raw target for current sensing method */
    rawTarget = Cy_CapSense_CalculateRawTarget(widgetId, CY_CAPSENSE_ROW_SNS_CALIBRATION, context);
    rawCalibration = rawTarget;
    ptrWdCfg->ptrWdContext->maxRawCountRow = rawTarget;
    
    /* Switches to Ccomp direct mode in case of repeated calibration */
    ptrWdCfg->ptrWdContext->status &= (uint32_t)~(uint32_t)CY_CAPSENSE_WD_WBX_COMPENSATION_DIRECTION_MASK;

    ptrSnsCxt->cdacComp = 0u;
    while (0u != cdacMask)
    {
        /* Scans a widget with newly defined Ccomp */
        ptrSnsCxt->cdacComp |= cdacMask;
        Cy_CapSense_SetWidgetFrameCompCdacCode(widgetId, CY_CAPSENSE_CAL_MODE_COMP_CDAC_CODE_VAL, context);
        calibStatus |= Cy_CapSense_ScanWidgetInternalCPU(widgetId, context);
        Cy_CapSense_PreProcessWidget(widgetId, context);
        /* Updates Ccomp based on scan results */
        if ((uint32_t)ptrSnsCxt->raw < rawTarget)
        {
            ptrSnsCxt->cdacComp &= ~cdacMask;
        }
        else
        {
            if (rawDeltaDirect >= ((uint32_t)ptrSnsCxt->raw - rawTarget))
            {
                cCompClosestDirect = ptrSnsCxt->cdacComp;
                rawDeltaDirect = (uint32_t)ptrSnsCxt->raw - rawTarget;
                rawCalibration = ptrSnsCxt->raw;
            }
        }
        cdacMask >>= 1u;
    }

    /* Switches to Ccomp inverted mode */
    ptrSnsCxt->cdacComp = 0u;
    cdacMask = (uint8_t)CY_CAPSENSE_CAL_COMP_CDAC_MIDDLE_CODE;
    ptrWdCfg->ptrWdContext->status |= (uint32_t)CY_CAPSENSE_WD_WBX_COMPENSATION_DIRECTION_MASK;
    while (0u != cdacMask)
    {
        /* Scans a widget with newly defined Ccomp */
        ptrSnsCxt->cdacComp |= cdacMask;
        Cy_CapSense_SetWidgetFrameCompCdacCode(widgetId, CY_CAPSENSE_CAL_MODE_COMP_CDAC_CODE_VAL, context);
        calibStatus |= Cy_CapSense_ScanWidgetInternalCPU(widgetId, context);
        Cy_CapSense_PreProcessWidget(widgetId, context);
        /* Updates Ccomp based on scan results */
        if ((uint32_t)ptrSnsCxt->raw > rawTarget)
        {
            if (rawDeltaInverted >= ((uint32_t)ptrSnsCxt->raw - rawTarget))
            {
                cCompClosestInverted = ptrSnsCxt->cdacComp;
                rawDeltaInverted = (uint32_t)ptrSnsCxt->raw - rawTarget;
                ptrWdCfg->ptrWdContext->maxRawCountRow = ptrSnsCxt->raw;
            }
            ptrSnsCxt->cdacComp &= ~cdacMask;
        }
        cdacMask >>= 1u;
    }

    /* Stores Ccomp which produces rawcounts above and closest to the target */
    if (rawDeltaInverted > rawDeltaDirect)
    {
        ptrSnsCxt->cdacComp = cCompClosestDirect;
        ptrWdCfg->ptrWdContext->status &= (uint32_t)~(uint32_t)CY_CAPSENSE_WD_WBX_COMPENSATION_DIRECTION_MASK;
        ptrWdCfg->ptrWdContext->maxRawCountRow = rawCalibration;
    }
    else
    {
        ptrSnsCxt->cdacComp = cCompClosestInverted;
        ptrWdCfg->ptrWdContext->status |= (uint32_t)CY_CAPSENSE_WD_WBX_COMPENSATION_DIRECTION_MASK;
    }

    if ((uint32_t)ptrWdCfg->ptrWdContext->maxRawCountRow > (((uint32_t)context->ptrCommonConfig->wbxCalibrationError * 
                            ptrWdCfg->ptrWdContext->maxRawCount) / CY_CAPSENSE_PERCENTAGE_100))
    {
        /* If the rawcounts are higher than the error threshold, then the calibration is failed */
        calibStatus |= CY_CAPSENSE_STATUS_CALIBRATION_FAIL;
    }

    return calibStatus;
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_COMP_AUTO_EN) && \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CALIBRATION_EN)) */

#endif /* CY_IP_M0S8MSCV3LP */


/* [] END OF FILE */
